/* automatically generated by rust-bindgen 0.71.1 */

pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __uint_least16_t = __uint16_t;
pub type __time_t = ::std::os::raw::c_long;
pub type wchar_t = ::std::os::raw::c_int;
pub type char16_t = __uint_least16_t;
#[doc = "\n CEF string type definitions. Whomever allocates |str| is responsible for\n providing an appropriate |dtor| implementation that will free the string in\n the same memory space. When reusing an existing string structure make sure\n to call |dtor| for the old value before assigning new |str| and |dtor|\n values. Static strings will have a NULL |dtor| value. Using the below\n functions if you want this managed for you.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_wide_t {
    pub str_: *mut wchar_t,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut wchar_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_string_wide_t"][::std::mem::size_of::<_cef_string_wide_t>() - 24usize];
    ["Alignment of _cef_string_wide_t"][::std::mem::align_of::<_cef_string_wide_t>() - 8usize];
    ["Offset of field: _cef_string_wide_t::str_"]
        [::std::mem::offset_of!(_cef_string_wide_t, str_) - 0usize];
    ["Offset of field: _cef_string_wide_t::length"]
        [::std::mem::offset_of!(_cef_string_wide_t, length) - 8usize];
    ["Offset of field: _cef_string_wide_t::dtor"]
        [::std::mem::offset_of!(_cef_string_wide_t, dtor) - 16usize];
};
#[doc = "\n CEF string type definitions. Whomever allocates |str| is responsible for\n providing an appropriate |dtor| implementation that will free the string in\n the same memory space. When reusing an existing string structure make sure\n to call |dtor| for the old value before assigning new |str| and |dtor|\n values. Static strings will have a NULL |dtor| value. Using the below\n functions if you want this managed for you.\n"]
pub type cef_string_wide_t = _cef_string_wide_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_utf8_t {
    pub str_: *mut ::std::os::raw::c_char,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut ::std::os::raw::c_char)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_string_utf8_t"][::std::mem::size_of::<_cef_string_utf8_t>() - 24usize];
    ["Alignment of _cef_string_utf8_t"][::std::mem::align_of::<_cef_string_utf8_t>() - 8usize];
    ["Offset of field: _cef_string_utf8_t::str_"]
        [::std::mem::offset_of!(_cef_string_utf8_t, str_) - 0usize];
    ["Offset of field: _cef_string_utf8_t::length"]
        [::std::mem::offset_of!(_cef_string_utf8_t, length) - 8usize];
    ["Offset of field: _cef_string_utf8_t::dtor"]
        [::std::mem::offset_of!(_cef_string_utf8_t, dtor) - 16usize];
};
pub type cef_string_utf8_t = _cef_string_utf8_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_utf16_t {
    pub str_: *mut char16_t,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut char16_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_string_utf16_t"][::std::mem::size_of::<_cef_string_utf16_t>() - 24usize];
    ["Alignment of _cef_string_utf16_t"][::std::mem::align_of::<_cef_string_utf16_t>() - 8usize];
    ["Offset of field: _cef_string_utf16_t::str_"]
        [::std::mem::offset_of!(_cef_string_utf16_t, str_) - 0usize];
    ["Offset of field: _cef_string_utf16_t::length"]
        [::std::mem::offset_of!(_cef_string_utf16_t, length) - 8usize];
    ["Offset of field: _cef_string_utf16_t::dtor"]
        [::std::mem::offset_of!(_cef_string_utf16_t, dtor) - 16usize];
};
pub type cef_string_utf16_t = _cef_string_utf16_t;
unsafe extern "C" {
    #[doc = "\n These functions set string values. If |copy| is true (1) the value will be\n copied instead of referenced. It is up to the user to properly manage\n the lifespan of references.\n"]
    pub fn cef_string_wide_set(
        src: *const wchar_t,
        src_len: usize,
        output: *mut cef_string_wide_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf8_set(
        src: *const ::std::os::raw::c_char,
        src_len: usize,
        output: *mut cef_string_utf8_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf16_set(
        src: *const char16_t,
        src_len: usize,
        output: *mut cef_string_utf16_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n These functions clear string values. The structure itself is not freed.\n"]
    pub fn cef_string_wide_clear(str_: *mut cef_string_wide_t);
}
unsafe extern "C" {
    pub fn cef_string_utf8_clear(str_: *mut cef_string_utf8_t);
}
unsafe extern "C" {
    pub fn cef_string_utf16_clear(str_: *mut cef_string_utf16_t);
}
unsafe extern "C" {
    #[doc = "\n These functions compare two string values with the same results as strcmp().\n"]
    pub fn cef_string_wide_cmp(
        str1: *const cef_string_wide_t,
        str2: *const cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf8_cmp(
        str1: *const cef_string_utf8_t,
        str2: *const cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf16_cmp(
        str1: *const cef_string_utf16_t,
        str2: *const cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n These functions convert between UTF-8, -16, and -32 strings. They are\n potentially slow so unnecessary conversions should be avoided. The best\n possible result will always be written to |output| with the boolean return\n value indicating whether the conversion is 100% valid.\n"]
    pub fn cef_string_wide_to_utf8(
        src: *const wchar_t,
        src_len: usize,
        output: *mut cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf8_to_wide(
        src: *const ::std::os::raw::c_char,
        src_len: usize,
        output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_wide_to_utf16(
        src: *const wchar_t,
        src_len: usize,
        output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf16_to_wide(
        src: *const char16_t,
        src_len: usize,
        output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf8_to_utf16(
        src: *const ::std::os::raw::c_char,
        src_len: usize,
        output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf16_to_utf8(
        src: *const char16_t,
        src_len: usize,
        output: *mut cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n These functions convert an ASCII string, typically a hardcoded constant, to\n a Wide/UTF16 string. Use instead of the UTF8 conversion routines if you know\n the string is ASCII.\n"]
    pub fn cef_string_ascii_to_wide(
        src: *const ::std::os::raw::c_char,
        src_len: usize,
        output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_ascii_to_utf16(
        src: *const ::std::os::raw::c_char,
        src_len: usize,
        output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
#[doc = "\n It is sometimes necessary for the system to allocate string structures with\n the expectation that the user will free them. The userfree types act as a\n hint that the user is responsible for freeing the structure.\n"]
pub type cef_string_userfree_wide_t = *mut cef_string_wide_t;
pub type cef_string_userfree_utf8_t = *mut cef_string_utf8_t;
pub type cef_string_userfree_utf16_t = *mut cef_string_utf16_t;
unsafe extern "C" {
    #[doc = "\n These functions allocate a new string structure. They must be freed by\n calling the associated free function.\n"]
    pub fn cef_string_userfree_wide_alloc() -> cef_string_userfree_wide_t;
}
unsafe extern "C" {
    pub fn cef_string_userfree_utf8_alloc() -> cef_string_userfree_utf8_t;
}
unsafe extern "C" {
    pub fn cef_string_userfree_utf16_alloc() -> cef_string_userfree_utf16_t;
}
unsafe extern "C" {
    #[doc = "\n These functions free the string structure allocated by the associated\n alloc function. Any string contents will first be cleared.\n"]
    pub fn cef_string_userfree_wide_free(str_: cef_string_userfree_wide_t);
}
unsafe extern "C" {
    pub fn cef_string_userfree_utf8_free(str_: cef_string_userfree_utf8_t);
}
unsafe extern "C" {
    pub fn cef_string_userfree_utf16_free(str_: cef_string_userfree_utf16_t);
}
unsafe extern "C" {
    #[doc = "\n These functions convert utf16 string case using the current ICU locale. This\n may change the length of the string in some cases.\n"]
    pub fn cef_string_utf16_to_lower(
        src: *const char16_t,
        src_len: usize,
        output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf16_to_upper(
        src: *const char16_t,
        src_len: usize,
        output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
pub type cef_char_t = char16_t;
pub type cef_string_userfree_t = cef_string_userfree_utf16_t;
pub type cef_string_t = cef_string_utf16_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_list_t {
    _unused: [u8; 0],
}
#[doc = "\n CEF string maps are a set of key/value string pairs.\n"]
pub type cef_string_list_t = *mut _cef_string_list_t;
unsafe extern "C" {
    #[doc = "\n Allocate a new string map.\n"]
    pub fn cef_string_list_alloc() -> cef_string_list_t;
}
unsafe extern "C" {
    #[doc = "\n Return the number of elements in the string list.\n"]
    pub fn cef_string_list_size(list: cef_string_list_t) -> usize;
}
unsafe extern "C" {
    #[doc = "\n Retrieve the value at the specified zero-based string list index. Returns\n true (1) if the value was successfully retrieved.\n"]
    pub fn cef_string_list_value(
        list: cef_string_list_t,
        index: usize,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Append a new value at the end of the string list.\n"]
    pub fn cef_string_list_append(list: cef_string_list_t, value: *const cef_string_t);
}
unsafe extern "C" {
    #[doc = "\n Clear the string list.\n"]
    pub fn cef_string_list_clear(list: cef_string_list_t);
}
unsafe extern "C" {
    #[doc = "\n Free the string list.\n"]
    pub fn cef_string_list_free(list: cef_string_list_t);
}
unsafe extern "C" {
    #[doc = "\n Creates a copy of an existing string list.\n"]
    pub fn cef_string_list_copy(list: cef_string_list_t) -> cef_string_list_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_map_t {
    _unused: [u8; 0],
}
#[doc = "\n CEF string maps are a set of key/value string pairs.\n"]
pub type cef_string_map_t = *mut _cef_string_map_t;
unsafe extern "C" {
    #[doc = "\n Allocate a new string map.\n"]
    pub fn cef_string_map_alloc() -> cef_string_map_t;
}
unsafe extern "C" {
    #[doc = "\n Return the number of elements in the string map.\n"]
    pub fn cef_string_map_size(map: cef_string_map_t) -> usize;
}
unsafe extern "C" {
    #[doc = "\n Return the value assigned to the specified key.\n"]
    pub fn cef_string_map_find(
        map: cef_string_map_t,
        key: *const cef_string_t,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Return the key at the specified zero-based string map index.\n"]
    pub fn cef_string_map_key(
        map: cef_string_map_t,
        index: usize,
        key: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Return the value at the specified zero-based string map index.\n"]
    pub fn cef_string_map_value(
        map: cef_string_map_t,
        index: usize,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Append a new key/value pair at the end of the string map. If the key exists,\n overwrite the existing value with a new value w/o changing the pair order.\n"]
    pub fn cef_string_map_append(
        map: cef_string_map_t,
        key: *const cef_string_t,
        value: *const cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Clear the string map.\n"]
    pub fn cef_string_map_clear(map: cef_string_map_t);
}
unsafe extern "C" {
    #[doc = "\n Free the string map.\n"]
    pub fn cef_string_map_free(map: cef_string_map_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_multimap_t {
    _unused: [u8; 0],
}
#[doc = "\n CEF string multimaps are a set of key/value string pairs.\n More than one value can be assigned to a single key.\n"]
pub type cef_string_multimap_t = *mut _cef_string_multimap_t;
unsafe extern "C" {
    #[doc = "\n Allocate a new string multimap.\n"]
    pub fn cef_string_multimap_alloc() -> cef_string_multimap_t;
}
unsafe extern "C" {
    #[doc = "\n Return the number of elements in the string multimap.\n"]
    pub fn cef_string_multimap_size(map: cef_string_multimap_t) -> usize;
}
unsafe extern "C" {
    #[doc = "\n Return the number of values with the specified key.\n"]
    pub fn cef_string_multimap_find_count(
        map: cef_string_multimap_t,
        key: *const cef_string_t,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = "\n Return the value_index-th value with the specified key.\n"]
    pub fn cef_string_multimap_enumerate(
        map: cef_string_multimap_t,
        key: *const cef_string_t,
        value_index: usize,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Return the key at the specified zero-based string multimap index.\n"]
    pub fn cef_string_multimap_key(
        map: cef_string_multimap_t,
        index: usize,
        key: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Return the value at the specified zero-based string multimap index.\n"]
    pub fn cef_string_multimap_value(
        map: cef_string_multimap_t,
        index: usize,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Append a new key/value pair at the end of the string multimap.\n"]
    pub fn cef_string_multimap_append(
        map: cef_string_multimap_t,
        key: *const cef_string_t,
        value: *const cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Clear the string multimap.\n"]
    pub fn cef_string_multimap_clear(map: cef_string_multimap_t);
}
unsafe extern "C" {
    #[doc = "\n Free the string multimap.\n"]
    pub fn cef_string_multimap_free(map: cef_string_multimap_t);
}
pub type time_t = __time_t;
#[doc = "\n Represents a wall clock time in UTC. Values are not guaranteed to be\n monotonically non-decreasing and are subject to large amounts of skew.\n Time is stored internally as microseconds since the Windows epoch (1601).\n\n This is equivalent of Chromium `base::Time` (see base/time/time.h).\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_basetime_t {
    pub val: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_basetime_t"][::std::mem::size_of::<_cef_basetime_t>() - 8usize];
    ["Alignment of _cef_basetime_t"][::std::mem::align_of::<_cef_basetime_t>() - 8usize];
    ["Offset of field: _cef_basetime_t::val"]
        [::std::mem::offset_of!(_cef_basetime_t, val) - 0usize];
};
#[doc = "\n Represents a wall clock time in UTC. Values are not guaranteed to be\n monotonically non-decreasing and are subject to large amounts of skew.\n Time is stored internally as microseconds since the Windows epoch (1601).\n\n This is equivalent of Chromium `base::Time` (see base/time/time.h).\n"]
pub type cef_basetime_t = _cef_basetime_t;
#[doc = "\n Time information. Values should always be in UTC.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_time_t {
    #[doc = "\n Four or five digit year \"2007\" (1601 to 30827 on Windows, 1970 to 2038 on\n 32-bit POSIX)\n"]
    pub year: ::std::os::raw::c_int,
    #[doc = "\n 1-based month (values 1 = January, etc.)\n"]
    pub month: ::std::os::raw::c_int,
    #[doc = "\n 0-based day of week (0 = Sunday, etc.)\n"]
    pub day_of_week: ::std::os::raw::c_int,
    #[doc = "\n 1-based day of month (1-31)\n"]
    pub day_of_month: ::std::os::raw::c_int,
    #[doc = "\n Hour within the current day (0-23)\n"]
    pub hour: ::std::os::raw::c_int,
    #[doc = "\n Minute within the current hour (0-59)\n"]
    pub minute: ::std::os::raw::c_int,
    #[doc = "\n Second within the current minute (0-59 plus leap seconds which may take\n it up to 60).\n"]
    pub second: ::std::os::raw::c_int,
    #[doc = "\n Milliseconds within the current second (0-999)\n"]
    pub millisecond: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_time_t"][::std::mem::size_of::<_cef_time_t>() - 32usize];
    ["Alignment of _cef_time_t"][::std::mem::align_of::<_cef_time_t>() - 4usize];
    ["Offset of field: _cef_time_t::year"][::std::mem::offset_of!(_cef_time_t, year) - 0usize];
    ["Offset of field: _cef_time_t::month"][::std::mem::offset_of!(_cef_time_t, month) - 4usize];
    ["Offset of field: _cef_time_t::day_of_week"]
        [::std::mem::offset_of!(_cef_time_t, day_of_week) - 8usize];
    ["Offset of field: _cef_time_t::day_of_month"]
        [::std::mem::offset_of!(_cef_time_t, day_of_month) - 12usize];
    ["Offset of field: _cef_time_t::hour"][::std::mem::offset_of!(_cef_time_t, hour) - 16usize];
    ["Offset of field: _cef_time_t::minute"][::std::mem::offset_of!(_cef_time_t, minute) - 20usize];
    ["Offset of field: _cef_time_t::second"][::std::mem::offset_of!(_cef_time_t, second) - 24usize];
    ["Offset of field: _cef_time_t::millisecond"]
        [::std::mem::offset_of!(_cef_time_t, millisecond) - 28usize];
};
#[doc = "\n Time information. Values should always be in UTC.\n"]
pub type cef_time_t = _cef_time_t;
unsafe extern "C" {
    #[doc = "\n Converts cef_time_t to/from time_t. Returns true (1) on success and false\n (0) on failure.\n"]
    pub fn cef_time_to_timet(
        cef_time: *const cef_time_t,
        time: *mut time_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_time_from_timet(time: time_t, cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Converts cef_time_t to/from a double which is the number of seconds since\n epoch (Jan 1, 1970). Webkit uses this format to represent time. A value of 0\n means \"not initialized\". Returns true (1) on success and false (0) on\n failure.\n"]
    pub fn cef_time_to_doublet(
        cef_time: *const cef_time_t,
        time: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_time_from_doublet(time: f64, cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Retrieve the current system time. Returns true (1) on success and false (0)\n on failure.\n"]
    pub fn cef_time_now(cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Retrieve the current system time.\n"]
    pub fn cef_basetime_now() -> cef_basetime_t;
}
unsafe extern "C" {
    #[doc = "\n Retrieve the delta in milliseconds between two time values. Returns true (1)\n on success and false (0) on failure."]
    pub fn cef_time_delta(
        cef_time1: *const cef_time_t,
        cef_time2: *const cef_time_t,
        delta: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Converts cef_time_t to cef_basetime_t. Returns true (1) on success and\n false (0) on failure.\n"]
    pub fn cef_time_to_basetime(
        from: *const cef_time_t,
        to: *mut cef_basetime_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "\n Converts cef_basetime_t to cef_time_t. Returns true (1) on success and\n false (0) on failure.\n"]
    pub fn cef_time_from_basetime(
        from: cef_basetime_t,
        to: *mut cef_time_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported content setting types. Some types are platform-specific or only\n supported with Chrome style. Should be kept in sync with Chromium's\n ContentSettingsType type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_content_setting_types_t {
    #[doc = " provided context. However, it may be overridden by other settings. This\n enum should NOT be read directly to determine whether cookies are enabled;\n the client should instead rely on the CookieSettings API."]
    CEF_CONTENT_SETTING_TYPE_COOKIES = 0,
    #[doc = " provided context. However, it may be overridden by other settings. This\n enum should NOT be read directly to determine whether cookies are enabled;\n the client should instead rely on the CookieSettings API."]
    CEF_CONTENT_SETTING_TYPE_IMAGES = 1,
    #[doc = " provided context. However, it may be overridden by other settings. This\n enum should NOT be read directly to determine whether cookies are enabled;\n the client should instead rely on the CookieSettings API."]
    CEF_CONTENT_SETTING_TYPE_JAVASCRIPT = 2,
    #[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
    CEF_CONTENT_SETTING_TYPE_POPUPS = 3,
    #[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
    CEF_CONTENT_SETTING_TYPE_GEOLOCATION = 4,
    #[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
    CEF_CONTENT_SETTING_TYPE_NOTIFICATIONS = 5,
    #[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
    CEF_CONTENT_SETTING_TYPE_AUTO_SELECT_CERTIFICATE = 6,
    #[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
    CEF_CONTENT_SETTING_TYPE_MIXEDSCRIPT = 7,
    #[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
    CEF_CONTENT_SETTING_TYPE_MEDIASTREAM_MIC = 8,
    #[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
    CEF_CONTENT_SETTING_TYPE_MEDIASTREAM_CAMERA = 9,
    #[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
    CEF_CONTENT_SETTING_TYPE_PROTOCOL_HANDLERS = 10,
    #[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
    CEF_CONTENT_SETTING_TYPE_DEPRECATED_PPAPI_BROKER = 11,
    #[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
    CEF_CONTENT_SETTING_TYPE_AUTOMATIC_DOWNLOADS = 12,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_MIDI_SYSEX = 13,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_SSL_CERT_DECISIONS = 14,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_PROTECTED_MEDIA_IDENTIFIER = 15,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_APP_BANNER = 16,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_SITE_ENGAGEMENT = 17,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_DURABLE_STORAGE = 18,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_USB_CHOOSER_DATA = 19,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_BLUETOOTH_GUARD = 20,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_BACKGROUND_SYNC = 21,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_AUTOPLAY = 22,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_IMPORTANT_SITE_INFO = 23,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_PERMISSION_AUTOBLOCKER_DATA = 24,
    #[doc = " Advanced device-specific functions on MIDI devices. MIDI-SysEx\n communications can be used for changing the MIDI device's persistent state\n such as firmware."]
    CEF_CONTENT_SETTING_TYPE_ADS = 25,
    #[doc = " Website setting which stores metadata for the subresource filter to aid in\n decisions for whether or not to show the UI."]
    CEF_CONTENT_SETTING_TYPE_ADS_DATA = 26,
    #[doc = " MIDI stands for Musical Instrument Digital Interface. It is a standard\n that allows electronic musical instruments, computers, and other devices\n to communicate with each other."]
    CEF_CONTENT_SETTING_TYPE_MIDI = 27,
    #[doc = " This content setting type is for caching password protection service's\n verdicts of each origin."]
    CEF_CONTENT_SETTING_TYPE_PASSWORD_PROTECTION = 28,
    #[doc = " Website setting which stores engagement data for media related to a\n specific origin."]
    CEF_CONTENT_SETTING_TYPE_MEDIA_ENGAGEMENT = 29,
    #[doc = " Content setting which stores whether or not the site can play audible\n sound. This will not block playback but instead the user will not hear it."]
    CEF_CONTENT_SETTING_TYPE_SOUND = 30,
    #[doc = " Website setting which stores the list of client hints that the origin\n requested the browser to remember. The browser is expected to send all\n client hints in the HTTP request headers for every resource requested\n from that origin."]
    CEF_CONTENT_SETTING_TYPE_CLIENT_HINTS = 31,
    #[doc = " Generic Sensor API covering ambient-light-sensor, accelerometer, gyroscope\n and magnetometer are all mapped to a single content_settings_type.\n Setting for the Generic Sensor API covering ambient-light-sensor,\n accelerometer, gyroscope and magnetometer. These are all mapped to a\n single ContentSettingsType."]
    CEF_CONTENT_SETTING_TYPE_SENSORS = 32,
    #[doc = " Content setting which stores whether or not the user has granted the site\n permission to respond to accessibility events, which can be used to\n provide a custom accessibility experience. Requires explicit user consent\n because some users may not want sites to know they're using assistive\n technology. Deprecated in M131."]
    CEF_CONTENT_SETTING_TYPE_DEPRECATED_ACCESSIBILITY_EVENTS = 33,
    #[doc = " Used to store whether to allow a website to install a payment handler."]
    CEF_CONTENT_SETTING_TYPE_PAYMENT_HANDLER = 34,
    #[doc = " Content setting which stores whether to allow sites to ask for permission\n to access USB devices. If this is allowed specific device permissions are\n stored under USB_CHOOSER_DATA."]
    CEF_CONTENT_SETTING_TYPE_USB_GUARD = 35,
    #[doc = " Nothing is stored in this setting at present. Please refer to\n BackgroundFetchPermissionContext for details on how this permission\n is ascertained."]
    CEF_CONTENT_SETTING_TYPE_BACKGROUND_FETCH = 36,
    #[doc = " Website setting which stores the amount of times the user has dismissed\n intent picker UI without explicitly choosing an option."]
    CEF_CONTENT_SETTING_TYPE_INTENT_PICKER_DISPLAY = 37,
    #[doc = " Used to store whether to allow a website to detect user active/idle state."]
    CEF_CONTENT_SETTING_TYPE_IDLE_DETECTION = 38,
    #[doc = " Content settings for access to serial ports. The \"guard\" content setting\n stores whether to allow sites to ask for permission to access a port. The\n permissions granted to access particular ports are stored in the \"chooser\n data\" website setting."]
    CEF_CONTENT_SETTING_TYPE_SERIAL_GUARD = 39,
    #[doc = " Content settings for access to serial ports. The \"guard\" content setting\n stores whether to allow sites to ask for permission to access a port. The\n permissions granted to access particular ports are stored in the \"chooser\n data\" website setting."]
    CEF_CONTENT_SETTING_TYPE_SERIAL_CHOOSER_DATA = 40,
    #[doc = " Nothing is stored in this setting at present. Please refer to\n PeriodicBackgroundSyncPermissionContext for details on how this permission\n is ascertained.\n This content setting is not registered because it does not require access\n to any existing providers."]
    CEF_CONTENT_SETTING_TYPE_PERIODIC_BACKGROUND_SYNC = 41,
    #[doc = " Content setting which stores whether to allow sites to ask for permission\n to do Bluetooth scanning."]
    CEF_CONTENT_SETTING_TYPE_BLUETOOTH_SCANNING = 42,
    #[doc = " Content settings for access to HID devices. The \"guard\" content setting\n stores whether to allow sites to ask for permission to access a device.\n The permissions granted to access particular devices are stored in the\n \"chooser data\" website setting."]
    CEF_CONTENT_SETTING_TYPE_HID_GUARD = 43,
    #[doc = " Content settings for access to HID devices. The \"guard\" content setting\n stores whether to allow sites to ask for permission to access a device.\n The permissions granted to access particular devices are stored in the\n \"chooser data\" website setting."]
    CEF_CONTENT_SETTING_TYPE_HID_CHOOSER_DATA = 44,
    #[doc = " Wake Lock API, which has two lock types: screen and system locks.\n Currently, screen locks do not need any additional permission, and system\n locks are always denied while the right UI is worked out."]
    CEF_CONTENT_SETTING_TYPE_WAKE_LOCK_SCREEN = 45,
    #[doc = " Wake Lock API, which has two lock types: screen and system locks.\n Currently, screen locks do not need any additional permission, and system\n locks are always denied while the right UI is worked out."]
    CEF_CONTENT_SETTING_TYPE_WAKE_LOCK_SYSTEM = 46,
    #[doc = " Legacy SameSite cookie behavior. This disables SameSite=Lax-by-default,\n SameSite=None requires Secure, and Schemeful Same-Site, forcing the\n legacy behavior wherein 1) cookies that don't specify SameSite are treated\n as SameSite=None, 2) SameSite=None cookies are not required to be Secure,\n and 3) schemeful same-site is not active.\n\n This will also be used to revert to legacy behavior when future changes\n in cookie handling are introduced."]
    CEF_CONTENT_SETTING_TYPE_LEGACY_COOKIE_ACCESS = 47,
    #[doc = " Content settings which stores whether to allow sites to ask for permission\n to save changes to an original file selected by the user through the\n File System Access API."]
    CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_WRITE_GUARD = 48,
    #[doc = " Used to store whether to allow a website to exchange data with NFC\n devices."]
    CEF_CONTENT_SETTING_TYPE_NFC = 49,
    #[doc = " Website setting to store permissions granted to access particular\n Bluetooth devices."]
    CEF_CONTENT_SETTING_TYPE_BLUETOOTH_CHOOSER_DATA = 50,
    #[doc = " Full access to the system clipboard (sanitized read without user gesture,\n and unsanitized read and write with user gesture)."]
    CEF_CONTENT_SETTING_TYPE_CLIPBOARD_READ_WRITE = 51,
    #[doc = " This is special-cased in the permissions layer to always allow, and as\n such doesn't have associated prefs data."]
    CEF_CONTENT_SETTING_TYPE_CLIPBOARD_SANITIZED_WRITE = 52,
    #[doc = " This content setting type is for caching safe browsing real time url\n check's verdicts of each origin."]
    CEF_CONTENT_SETTING_TYPE_SAFE_BROWSING_URL_CHECK_DATA = 53,
    #[doc = " Used to store whether a site is allowed to request AR or VR sessions with\n the WebXr Device API."]
    CEF_CONTENT_SETTING_TYPE_VR = 54,
    #[doc = " Used to store whether a site is allowed to request AR or VR sessions with\n the WebXr Device API."]
    CEF_CONTENT_SETTING_TYPE_AR = 55,
    #[doc = " Content setting which stores whether to allow site to open and read files\n and directories selected through the File System Access API."]
    CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_READ_GUARD = 56,
    #[doc = " Access to first party storage in a third-party context. Exceptions are\n scoped to the combination of requesting/top-level origin, and are managed\n through the Storage Access API. For the time being, this content setting\n exists in parallel to third-party cookie rules stored in COOKIES."]
    CEF_CONTENT_SETTING_TYPE_STORAGE_ACCESS = 57,
    #[doc = " Content setting which stores whether to allow a site to control camera\n movements. It does not give access to camera."]
    CEF_CONTENT_SETTING_TYPE_CAMERA_PAN_TILT_ZOOM = 58,
    #[doc = " Content setting for Screen Enumeration and Screen Detail functionality.\n Permits access to detailed multi-screen information, like size and\n position. Permits placing fullscreen and windowed content on specific\n screens. See also: https://w3c.github.io/window-placement"]
    CEF_CONTENT_SETTING_TYPE_WINDOW_MANAGEMENT = 59,
    #[doc = " Stores whether to allow insecure websites to make private network\n requests.\n See also: https://wicg.github.io/cors-rfc1918\n Set through enterprise policies only."]
    CEF_CONTENT_SETTING_TYPE_INSECURE_PRIVATE_NETWORK = 60,
    #[doc = " Content setting which stores whether or not a site can access low-level\n locally installed font data using the Local Fonts Access API."]
    CEF_CONTENT_SETTING_TYPE_LOCAL_FONTS = 61,
    #[doc = " Stores per-origin state for permission auto-revocation (for all permission\n types)."]
    CEF_CONTENT_SETTING_TYPE_PERMISSION_AUTOREVOCATION_DATA = 62,
    #[doc = " Stores per-origin state of the most recently selected directory for the\n use by the File System Access API."]
    CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_LAST_PICKED_DIRECTORY = 63,
    #[doc = " Controls access to the getDisplayMedia API."]
    CEF_CONTENT_SETTING_TYPE_DISPLAY_CAPTURE = 64,
    #[doc = " Website setting to store permissions metadata granted to paths on the\n local file system via the File System Access API.\n |FILE_SYSTEM_WRITE_GUARD| is the corresponding \"guard\" setting. The stored\n data represents valid permission only if\n |FILE_SYSTEM_ACCESS_EXTENDED_PERMISSION| is enabled via user opt-in.\n Otherwise, they represent \"recently granted but revoked permission\", which\n are used to restore the permission."]
    CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_ACCESS_CHOOSER_DATA = 65,
    #[doc = " Stores a grant that allows a relying party to send a request for identity\n information to specified identity providers, potentially through any\n anti-tracking measures that would otherwise prevent it. This setting is\n associated with the relying party's origin."]
    CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_SHARING = 66,
    #[doc = " Whether to use the v8 optimized JIT for running JavaScript on the page."]
    CEF_CONTENT_SETTING_TYPE_JAVASCRIPT_JIT = 67,
    #[doc = " Content setting which stores user decisions to allow loading a site over\n HTTP. Entries are added by hostname when a user bypasses the HTTPS-First\n Mode interstitial warning when a site does not support HTTPS. Allowed\n hosts are exact hostname matches -- subdomains of a host on the allowlist\n must be separately allowlisted."]
    CEF_CONTENT_SETTING_TYPE_HTTP_ALLOWED = 68,
    #[doc = " Stores metadata related to form fill, such as e.g. whether user data was\n autofilled on a specific website."]
    CEF_CONTENT_SETTING_TYPE_FORMFILL_METADATA = 69,
    #[doc = " Setting to indicate that there is an active federated sign-in session\n between a specified relying party and a specified identity provider for\n a specified account. When this is present it allows access to session\n management capabilities between the sites. This setting is associated\n with the relying party's origin."]
    CEF_CONTENT_SETTING_TYPE_DEPRECATED_FEDERATED_IDENTITY_ACTIVE_SESSION = 70,
    #[doc = " Setting to indicate whether Chrome should automatically apply darkening to\n web content."]
    CEF_CONTENT_SETTING_TYPE_AUTO_DARK_WEB_CONTENT = 71,
    #[doc = " Setting to indicate whether Chrome should request the desktop view of a\n site instead of the mobile one."]
    CEF_CONTENT_SETTING_TYPE_REQUEST_DESKTOP_SITE = 72,
    #[doc = " Setting to indicate whether browser should allow signing into a website\n via the browser FedCM API."]
    CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_API = 73,
    #[doc = " Stores notification interactions per origin for the past 90 days.\n Interactions per origin are pre-aggregated over seven-day windows: A\n notification interaction or display is assigned to the last Monday\n midnight in local time."]
    CEF_CONTENT_SETTING_TYPE_NOTIFICATION_INTERACTIONS = 74,
    #[doc = " Website setting which stores the last reduced accept language negotiated\n for a given origin, to be used on future visits to the origin."]
    CEF_CONTENT_SETTING_TYPE_REDUCED_ACCEPT_LANGUAGE = 75,
    #[doc = " Website setting which is used for NotificationPermissionReviewService to\n store origin blocklist from review notification permissions feature."]
    CEF_CONTENT_SETTING_TYPE_NOTIFICATION_PERMISSION_REVIEW = 76,
    #[doc = " Website setting to store permissions granted to access particular devices\n in private network."]
    CEF_CONTENT_SETTING_TYPE_PRIVATE_NETWORK_GUARD = 77,
    #[doc = " Website setting to store permissions granted to access particular devices\n in private network."]
    CEF_CONTENT_SETTING_TYPE_PRIVATE_NETWORK_CHOOSER_DATA = 78,
    #[doc = " Website setting which stores whether the browser has observed the user\n signing into an identity-provider based on observing the IdP-SignIn-Status\n HTTP header."]
    CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_IDENTITY_PROVIDER_SIGNIN_STATUS = 79,
    #[doc = " Website setting which is used for UnusedSitePermissionsService to\n store revoked permissions of unused sites from unused site permissions\n feature."]
    CEF_CONTENT_SETTING_TYPE_REVOKED_UNUSED_SITE_PERMISSIONS = 80,
    #[doc = " Similar to STORAGE_ACCESS, but applicable at the page-level rather than\n being specific to a frame."]
    CEF_CONTENT_SETTING_TYPE_TOP_LEVEL_STORAGE_ACCESS = 81,
    #[doc = " Setting to indicate whether user has opted in to allowing auto re-authn\n via the FedCM API."]
    CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_AUTO_REAUTHN_PERMISSION = 82,
    #[doc = " Website setting which stores whether the user has explicitly registered\n a website as an identity-provider."]
    CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_IDENTITY_PROVIDER_REGISTRATION = 83,
    #[doc = " Content setting which is used to indicate whether anti-abuse functionality\n should be enabled."]
    CEF_CONTENT_SETTING_TYPE_ANTI_ABUSE = 84,
    #[doc = " Content setting used to indicate whether third-party storage partitioning\n should be enabled."]
    CEF_CONTENT_SETTING_TYPE_THIRD_PARTY_STORAGE_PARTITIONING = 85,
    #[doc = " Used to indicate whether HTTPS-First Mode is enabled on the hostname."]
    CEF_CONTENT_SETTING_TYPE_HTTPS_ENFORCED = 86,
    #[doc = " Setting for enabling the `getAllScreensMedia` API. Spec link:\n https://github.com/screen-share/capture-all-screens"]
    CEF_CONTENT_SETTING_TYPE_ALL_SCREEN_CAPTURE = 87,
    #[doc = " Stores per origin metadata for cookie controls."]
    CEF_CONTENT_SETTING_TYPE_COOKIE_CONTROLS_METADATA = 88,
    #[doc = " Content Setting for temporary 3PC accesses granted by user behavior\n heuristics."]
    CEF_CONTENT_SETTING_TYPE_TPCD_HEURISTICS_GRANTS = 89,
    #[doc = " Content Setting for 3PC accesses granted by metadata delivered via the\n component updater service. This type will only be used when\n `net::features::kTpcdMetadataGrants` is enabled."]
    CEF_CONTENT_SETTING_TYPE_TPCD_METADATA_GRANTS = 90,
    #[doc = " Content Setting for 3PC accesses granted via 3PC deprecation trial."]
    CEF_CONTENT_SETTING_TYPE_TPCD_TRIAL = 91,
    #[doc = " Content Setting for 3PC accesses granted via top-level 3PC deprecation\n trial. Similar to TPCD_TRIAL, but applicable at the page-level for the\n lifetime of the page that served the token, rather than being specific to\n a requesting-origin/top-level-site combination and persistent."]
    CEF_CONTENT_SETTING_TYPE_TOP_LEVEL_TPCD_TRIAL = 92,
    #[doc = " Content Setting for a first-party origin trial that allows websites to\n enable third-party cookie deprecation.\n ALLOW (default): no effect (e.g. third-party cookies allowed, if not\n                  blocked otherwise).\n BLOCK: third-party cookies blocked, but 3PCD mitigations enabled."]
    CEF_CONTENT_SETTING_TOP_LEVEL_TPCD_ORIGIN_TRIAL = 93,
    #[doc = " Content setting used to indicate whether entering picture-in-picture\n automatically should be enabled."]
    CEF_CONTENT_SETTING_TYPE_AUTO_PICTURE_IN_PICTURE = 94,
    #[doc = " Whether user has opted into keeping file/directory permissions persistent\n between visits for a given origin. When enabled, permission metadata\n stored under |FILE_SYSTEM_ACCESS_CHOOSER_DATA| can auto-grant incoming\n permission request."]
    CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_ACCESS_EXTENDED_PERMISSION = 95,
    #[doc = " Whether the FSA Persistent Permissions restore prompt is eligible to be\n shown to the user, for a given origin."]
    CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_ACCESS_RESTORE_PERMISSION = 96,
    #[doc = " Whether an application capturing another tab, may scroll and zoom\n the captured tab."]
    CEF_CONTENT_SETTING_TYPE_CAPTURED_SURFACE_CONTROL = 97,
    #[doc = " Content setting for access to smart card readers.\n The \"guard\" content setting stores whether to allow sites to access the\n Smart Card API."]
    CEF_CONTENT_SETTING_TYPE_SMART_CARD_GUARD = 98,
    #[doc = " Content setting for access to smart card readers.\n The \"guard\" content setting stores whether to allow sites to access the\n Smart Card API."]
    CEF_CONTENT_SETTING_TYPE_SMART_CARD_DATA = 99,
    #[doc = " Content settings for access to printers for the Web Printing API."]
    CEF_CONTENT_SETTING_TYPE_WEB_PRINTING = 100,
    #[doc = " Content setting used to indicate whether entering HTML Fullscreen\n automatically (i.e. without transient activation) should be enabled."]
    CEF_CONTENT_SETTING_TYPE_AUTOMATIC_FULLSCREEN = 101,
    #[doc = " Content settings used to indicate that a web app is allowed to prompt the\n user for the installation of sub apps."]
    CEF_CONTENT_SETTING_TYPE_SUB_APP_INSTALLATION_PROMPTS = 102,
    #[doc = " Whether an application can enumerate audio output device."]
    CEF_CONTENT_SETTING_TYPE_SPEAKER_SELECTION = 103,
    #[doc = " Content settings for access to the Direct Sockets API."]
    CEF_CONTENT_SETTING_TYPE_DIRECT_SOCKETS = 104,
    #[doc = " Keyboard Lock API allows a site to capture keyboard inputs that would\n otherwise be handled by the OS or the browser."]
    CEF_CONTENT_SETTING_TYPE_KEYBOARD_LOCK = 105,
    #[doc = " Pointer Lock API allows a site to hide the cursor and have exclusive\n access to mouse inputs."]
    CEF_CONTENT_SETTING_TYPE_POINTER_LOCK = 106,
    #[doc = " Website setting which is used for UnusedSitePermissionsService to store\n auto-revoked notification permissions from abusive sites."]
    CEF_CONTENT_SETTING_TYPE_REVOKED_ABUSIVE_NOTIFICATION_PERMISSIONS = 107,
    #[doc = " Content setting that controls tracking protection status per site.\n BLOCK: Protections enabled. This is the default state.\n ALLOW: Protections disabled."]
    CEF_CONTENT_SETTING_TYPE_TRACKING_PROTECTION = 108,
    #[doc = " With this permission, when the application calls `getDisplayMedia()`, a\n system audio track can be returned without showing the display media\n selection picker. The application can explicitly specify\n `systemAudio: 'exclude'` or `video: true` to still show the display media\n selection picker if needed. Please note that the setting only works for\n WebUI."]
    CEF_CONTENT_SETTING_TYPE_DISPLAY_MEDIA_SYSTEM_AUDIO = 109,
    #[doc = " Whether to use the higher-tier v8 optimizers for running JavaScript on the\n page."]
    CEF_CONTENT_SETTING_TYPE_JAVASCRIPT_OPTIMIZER = 110,
    #[doc = " Content Setting for the Storage Access Headers persistent origin trial\n that allows origins to opt into the storage access header behavior. Should\n be scoped to `REQUESTING_ORIGIN_AND_TOP_SCHEMEFUL_SITE_SCOPE` in order to\n correspond to the design of persistent origin trials. See also:\n https://github.com/cfredric/storage-access-headers\n ALLOW: storage access request headers will be attached to cross-site\n        requests, and url requests will look for response headers from\n        origins to retry a request or load with storage access.\n BLOCK (default): no effect."]
    CEF_CONTENT_SETTING_TYPE_STORAGE_ACCESS_HEADER_ORIGIN_TRIAL = 111,
    #[doc = " Whether or not sites can request Hand Tracking data within WebXR Sessions."]
    CEF_CONTENT_SETTING_TYPE_HAND_TRACKING = 112,
    #[doc = " Website setting to indicate whether user has opted in to allow web apps to\n install other web apps."]
    CEF_CONTENT_SETTING_TYPE_WEB_APP_INSTALLATION = 113,
    #[doc = " Content settings for private network access in the context of the\n Direct Sockets API."]
    CEF_CONTENT_SETTING_TYPE_DIRECT_SOCKETS_PRIVATE_NETWORK_ACCESS = 114,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported content setting values. Should be kept in sync with Chromium's\n ContentSetting type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_content_setting_values_t {
    CEF_CONTENT_SETTING_VALUE_DEFAULT = 0,
    CEF_CONTENT_SETTING_VALUE_ALLOW = 1,
    CEF_CONTENT_SETTING_VALUE_BLOCK = 2,
    CEF_CONTENT_SETTING_VALUE_ASK = 3,
    CEF_CONTENT_SETTING_VALUE_SESSION_ONLY = 4,
    CEF_CONTENT_SETTING_VALUE_DETECT_IMPORTANT_CONTENT = 5,
    CEF_CONTENT_SETTING_VALUE_NUM_VALUES = 6,
}
#[doc = "\n Structure representing a point.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_point_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_point_t"][::std::mem::size_of::<_cef_point_t>() - 8usize];
    ["Alignment of _cef_point_t"][::std::mem::align_of::<_cef_point_t>() - 4usize];
    ["Offset of field: _cef_point_t::x"][::std::mem::offset_of!(_cef_point_t, x) - 0usize];
    ["Offset of field: _cef_point_t::y"][::std::mem::offset_of!(_cef_point_t, y) - 4usize];
};
#[doc = "\n Structure representing a point.\n"]
pub type cef_point_t = _cef_point_t;
#[doc = "\n Structure representing a rectangle.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_rect_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_rect_t"][::std::mem::size_of::<_cef_rect_t>() - 16usize];
    ["Alignment of _cef_rect_t"][::std::mem::align_of::<_cef_rect_t>() - 4usize];
    ["Offset of field: _cef_rect_t::x"][::std::mem::offset_of!(_cef_rect_t, x) - 0usize];
    ["Offset of field: _cef_rect_t::y"][::std::mem::offset_of!(_cef_rect_t, y) - 4usize];
    ["Offset of field: _cef_rect_t::width"][::std::mem::offset_of!(_cef_rect_t, width) - 8usize];
    ["Offset of field: _cef_rect_t::height"][::std::mem::offset_of!(_cef_rect_t, height) - 12usize];
};
#[doc = "\n Structure representing a rectangle.\n"]
pub type cef_rect_t = _cef_rect_t;
#[doc = "\n Structure representing a size.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_size_t {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_size_t"][::std::mem::size_of::<_cef_size_t>() - 8usize];
    ["Alignment of _cef_size_t"][::std::mem::align_of::<_cef_size_t>() - 4usize];
    ["Offset of field: _cef_size_t::width"][::std::mem::offset_of!(_cef_size_t, width) - 0usize];
    ["Offset of field: _cef_size_t::height"][::std::mem::offset_of!(_cef_size_t, height) - 4usize];
};
#[doc = "\n Structure representing a size.\n"]
pub type cef_size_t = _cef_size_t;
#[doc = "\n Structure representing insets.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_insets_t {
    pub top: ::std::os::raw::c_int,
    pub left: ::std::os::raw::c_int,
    pub bottom: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_insets_t"][::std::mem::size_of::<_cef_insets_t>() - 16usize];
    ["Alignment of _cef_insets_t"][::std::mem::align_of::<_cef_insets_t>() - 4usize];
    ["Offset of field: _cef_insets_t::top"][::std::mem::offset_of!(_cef_insets_t, top) - 0usize];
    ["Offset of field: _cef_insets_t::left"][::std::mem::offset_of!(_cef_insets_t, left) - 4usize];
    ["Offset of field: _cef_insets_t::bottom"]
        [::std::mem::offset_of!(_cef_insets_t, bottom) - 8usize];
    ["Offset of field: _cef_insets_t::right"]
        [::std::mem::offset_of!(_cef_insets_t, right) - 12usize];
};
#[doc = "\n Structure representing insets.\n"]
pub type cef_insets_t = _cef_insets_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _XEvent {
    _unused: [u8; 0],
}
pub type XEvent = _XEvent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XDisplay {
    _unused: [u8; 0],
}
pub type XDisplay = _XDisplay;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Describes how to interpret the components of a pixel.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_color_type_t {
    #[doc = "\n RGBA with 8 bits per pixel (32bits total).\n"]
    CEF_COLOR_TYPE_RGBA_8888 = 0,
    #[doc = "\n BGRA with 8 bits per pixel (32bits total).\n"]
    CEF_COLOR_TYPE_BGRA_8888 = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n CEF supports both a Chrome runtime style (based on the Chrome UI layer) and\n an Alloy runtime style (based on the Chromium content layer). Chrome style\n provides the full Chrome UI and browser functionality whereas Alloy style\n provides less default browser functionality but adds additional client\n callbacks and support for windowless (off-screen) rendering. The style type\n is individually configured for each window/browser at creation time and\n different styles can be mixed during runtime. For additional comparative\n details on runtime styles see\n https://bitbucket.org/chromiumembedded/cef/wiki/Architecture.md#markdown-header-cef3\n\n Windowless rendering will always use Alloy style. Windowed rendering with a\n default window or client-provided parent window can configure the style via\n CefWindowInfo.runtime_style. Windowed rendering with the Views framework can\n configure the style via CefWindowDelegate::GetWindowRuntimeStyle and\n CefBrowserViewDelegate::GetBrowserRuntimeStyle. Alloy style Windows with the\n Views framework can host only Alloy style BrowserViews but Chrome style\n Windows can host both style BrowserViews. Additionally, a Chrome style\n Window can host at most one Chrome style BrowserView but potentially\n multiple Alloy style BrowserViews. See CefWindowInfo.runtime_style\n documentation for any additional platform-specific limitations.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_runtime_style_t {
    #[doc = "\n Use the default style. See above documentation for exceptions.\n"]
    CEF_RUNTIME_STYLE_DEFAULT = 0,
    #[doc = "\n Use Chrome style.\n"]
    CEF_RUNTIME_STYLE_CHROME = 1,
    #[doc = "\n Use Alloy style.\n"]
    CEF_RUNTIME_STYLE_ALLOY = 2,
}
unsafe extern "C" {
    pub fn cef_get_xdisplay() -> *mut XDisplay;
}
#[doc = "\n Structure representing CefExecuteProcess arguments.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_main_args_t {
    pub argc: ::std::os::raw::c_int,
    pub argv: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_main_args_t"][::std::mem::size_of::<_cef_main_args_t>() - 16usize];
    ["Alignment of _cef_main_args_t"][::std::mem::align_of::<_cef_main_args_t>() - 8usize];
    ["Offset of field: _cef_main_args_t::argc"]
        [::std::mem::offset_of!(_cef_main_args_t, argc) - 0usize];
    ["Offset of field: _cef_main_args_t::argv"]
        [::std::mem::offset_of!(_cef_main_args_t, argv) - 8usize];
};
#[doc = "\n Structure representing CefExecuteProcess arguments.\n"]
pub type cef_main_args_t = _cef_main_args_t;
#[doc = "\n Class representing window information.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_window_info_t {
    #[doc = "\n The initial title of the window, to be set when the window is created.\n Some layout managers (e.g., Compiz) can look at the window title\n in order to decide where to place the window when it is\n created. When this attribute is not empty, the window title will\n be set before the window is mapped to the dispay. Otherwise the\n title will be initially empty.\n"]
    pub window_name: cef_string_t,
    #[doc = "\n Initial window bounds.\n"]
    pub bounds: cef_rect_t,
    #[doc = "\n Pointer for the parent window.\n"]
    pub parent_window: ::std::os::raw::c_ulong,
    #[doc = "\n Set to true (1) to create the browser using windowless (off-screen)\n rendering. No window will be created for the browser and all rendering\n will occur via the CefRenderHandler interface. The |parent_window| value\n will be used to identify monitor info and to act as the parent window for\n dialogs, context menus, etc. If |parent_window| is not provided then the\n main screen monitor will be used and some functionality that requires a\n parent window may not function correctly. In order to create windowless\n browsers the CefSettings.windowless_rendering_enabled value must be set to\n true. Transparent painting is enabled by default but can be disabled by\n setting CefBrowserSettings.background_color to an opaque value.\n"]
    pub windowless_rendering_enabled: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to enable shared textures for windowless rendering. Only\n valid if windowless_rendering_enabled above is also set to true. Currently\n only supported on Windows (D3D11).\n"]
    pub shared_texture_enabled: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to enable the ability to issue BeginFrame requests from\n the client application by calling CefBrowserHost::SendExternalBeginFrame.\n"]
    pub external_begin_frame_enabled: ::std::os::raw::c_int,
    #[doc = "\n Pointer for the new browser window. Only used with windowed rendering.\n"]
    pub window: ::std::os::raw::c_ulong,
    #[doc = "\n Optionally change the runtime style. Alloy style will always be used if\n |windowless_rendering_enabled| is true. See cef_runtime_style_t\n documentation for details.\n"]
    pub runtime_style: cef_runtime_style_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_window_info_t"][::std::mem::size_of::<_cef_window_info_t>() - 80usize];
    ["Alignment of _cef_window_info_t"][::std::mem::align_of::<_cef_window_info_t>() - 8usize];
    ["Offset of field: _cef_window_info_t::window_name"]
        [::std::mem::offset_of!(_cef_window_info_t, window_name) - 0usize];
    ["Offset of field: _cef_window_info_t::bounds"]
        [::std::mem::offset_of!(_cef_window_info_t, bounds) - 24usize];
    ["Offset of field: _cef_window_info_t::parent_window"]
        [::std::mem::offset_of!(_cef_window_info_t, parent_window) - 40usize];
    ["Offset of field: _cef_window_info_t::windowless_rendering_enabled"]
        [::std::mem::offset_of!(_cef_window_info_t, windowless_rendering_enabled) - 48usize];
    ["Offset of field: _cef_window_info_t::shared_texture_enabled"]
        [::std::mem::offset_of!(_cef_window_info_t, shared_texture_enabled) - 52usize];
    ["Offset of field: _cef_window_info_t::external_begin_frame_enabled"]
        [::std::mem::offset_of!(_cef_window_info_t, external_begin_frame_enabled) - 56usize];
    ["Offset of field: _cef_window_info_t::window"]
        [::std::mem::offset_of!(_cef_window_info_t, window) - 64usize];
    ["Offset of field: _cef_window_info_t::runtime_style"]
        [::std::mem::offset_of!(_cef_window_info_t, runtime_style) - 72usize];
};
#[doc = "\n Class representing window information.\n"]
pub type cef_window_info_t = _cef_window_info_t;
#[doc = "\n Structure containing the plane information of the shared texture.\n Sync with native_pixmap_handle.h\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_accelerated_paint_native_pixmap_plane_info_t {
    #[doc = "\n The strides and offsets in bytes to be used when accessing the buffers via\n a memory mapping. One per plane per entry. Size in bytes of the plane is\n necessary to map the buffers.\n"]
    pub stride: u32,
    pub offset: u64,
    pub size: u64,
    #[doc = "\n File descriptor for the underlying memory object (usually dmabuf).\n"]
    pub fd: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_accelerated_paint_native_pixmap_plane_info_t"]
        [::std::mem::size_of::<_cef_accelerated_paint_native_pixmap_plane_info_t>() - 32usize];
    ["Alignment of _cef_accelerated_paint_native_pixmap_plane_info_t"]
        [::std::mem::align_of::<_cef_accelerated_paint_native_pixmap_plane_info_t>() - 8usize];
    ["Offset of field: _cef_accelerated_paint_native_pixmap_plane_info_t::stride"][::std::mem::offset_of!(
        _cef_accelerated_paint_native_pixmap_plane_info_t,
        stride
    ) - 0usize];
    ["Offset of field: _cef_accelerated_paint_native_pixmap_plane_info_t::offset"][::std::mem::offset_of!(
        _cef_accelerated_paint_native_pixmap_plane_info_t,
        offset
    ) - 8usize];
    ["Offset of field: _cef_accelerated_paint_native_pixmap_plane_info_t::size"]
        [::std::mem::offset_of!(_cef_accelerated_paint_native_pixmap_plane_info_t, size) - 16usize];
    ["Offset of field: _cef_accelerated_paint_native_pixmap_plane_info_t::fd"]
        [::std::mem::offset_of!(_cef_accelerated_paint_native_pixmap_plane_info_t, fd) - 24usize];
};
#[doc = "\n Structure containing the plane information of the shared texture.\n Sync with native_pixmap_handle.h\n"]
pub type cef_accelerated_paint_native_pixmap_plane_t =
    _cef_accelerated_paint_native_pixmap_plane_info_t;
#[doc = "\n Structure containing shared texture information for the OnAcceleratedPaint\n callback. Resources will be released to the underlying pool for reuse when\n the callback returns from client code.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_accelerated_paint_info_t {
    #[doc = "\n Planes of the shared texture, usually file descriptors of dmabufs.\n"]
    pub planes: [cef_accelerated_paint_native_pixmap_plane_t; 4usize],
    #[doc = "\n Plane count.\n"]
    pub plane_count: ::std::os::raw::c_int,
    #[doc = "\n Modifier could be used with EGL driver.\n"]
    pub modifier: u64,
    #[doc = "\n The pixel format of the texture.\n"]
    pub format: cef_color_type_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_accelerated_paint_info_t"]
        [::std::mem::size_of::<_cef_accelerated_paint_info_t>() - 152usize];
    ["Alignment of _cef_accelerated_paint_info_t"]
        [::std::mem::align_of::<_cef_accelerated_paint_info_t>() - 8usize];
    ["Offset of field: _cef_accelerated_paint_info_t::planes"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_t, planes) - 0usize];
    ["Offset of field: _cef_accelerated_paint_info_t::plane_count"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_t, plane_count) - 128usize];
    ["Offset of field: _cef_accelerated_paint_info_t::modifier"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_t, modifier) - 136usize];
    ["Offset of field: _cef_accelerated_paint_info_t::format"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_t, format) - 144usize];
};
#[doc = "\n Structure containing shared texture information for the OnAcceleratedPaint\n callback. Resources will be released to the underlying pool for reuse when\n the callback returns from client code.\n"]
pub type cef_accelerated_paint_info_t = _cef_accelerated_paint_info_t;
pub type cef_color_t = u32;
impl cef_log_severity_t {
    pub const LOGSEVERITY_DEBUG: cef_log_severity_t = cef_log_severity_t::LOGSEVERITY_VERBOSE;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Log severity levels.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_log_severity_t {
    #[doc = "\n Default logging (currently INFO logging).\n"]
    LOGSEVERITY_DEFAULT = 0,
    #[doc = "\n Verbose logging.\n"]
    LOGSEVERITY_VERBOSE = 1,
    #[doc = "\n INFO logging.\n"]
    LOGSEVERITY_INFO = 2,
    #[doc = "\n WARNING logging.\n"]
    LOGSEVERITY_WARNING = 3,
    #[doc = "\n ERROR logging.\n"]
    LOGSEVERITY_ERROR = 4,
    #[doc = "\n FATAL logging.\n"]
    LOGSEVERITY_FATAL = 5,
    #[doc = "\n Disable logging to file for all messages, and to stderr for messages with\n severity less than FATAL.\n"]
    LOGSEVERITY_DISABLE = 99,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Log items prepended to each log line.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_log_items_t {
    #[doc = "\n Prepend the default list of items.\n"]
    LOG_ITEMS_DEFAULT = 0,
    #[doc = "\n Prepend no items.\n"]
    LOG_ITEMS_NONE = 1,
    #[doc = "\n Prepend the process ID.\n"]
    LOG_ITEMS_FLAG_PROCESS_ID = 2,
    #[doc = "\n Prepend the thread ID.\n"]
    LOG_ITEMS_FLAG_THREAD_ID = 4,
    #[doc = "\n Prepend the timestamp.\n"]
    LOG_ITEMS_FLAG_TIME_STAMP = 8,
    #[doc = "\n Prepend the tickcount.\n"]
    LOG_ITEMS_FLAG_TICK_COUNT = 16,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Represents the state of a setting.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_state_t {
    #[doc = "\n Use the default state for the setting.\n"]
    STATE_DEFAULT = 0,
    #[doc = "\n Enable or allow the setting.\n"]
    STATE_ENABLED = 1,
    #[doc = "\n Disable or disallow the setting.\n"]
    STATE_DISABLED = 2,
}
#[doc = "\n Initialization settings. Specify NULL or 0 to get the recommended default\n values. Many of these and other settings can also configured using command-\n line switches.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_settings_t {
    #[doc = "\n Size of this structure.\n"]
    pub size: usize,
    #[doc = "\n Set to true (1) to disable the sandbox for sub-processes. See\n cef_sandbox_win.h for requirements to enable the sandbox on Windows. Also\n configurable using the \"no-sandbox\" command-line switch.\n"]
    pub no_sandbox: ::std::os::raw::c_int,
    #[doc = "\n The path to a separate executable that will be launched for sub-processes.\n If this value is empty on Windows or Linux then the main process\n executable will be used. If this value is empty on macOS then a helper\n executable must exist at \"Contents/Frameworks/<app>\n Helper.app/Contents/MacOS/<app> Helper\" in the top-level app bundle. See\n the comments on CefExecuteProcess() for details. If this value is\n non-empty then it must be an absolute path. Also configurable using the\n \"browser-subprocess-path\" command-line switch.\n"]
    pub browser_subprocess_path: cef_string_t,
    #[doc = "\n The path to the CEF framework directory on macOS. If this value is empty\n then the framework must exist at \"Contents/Frameworks/Chromium Embedded\n Framework.framework\" in the top-level app bundle. If this value is\n non-empty then it must be an absolute path. Also configurable using the\n \"framework-dir-path\" command-line switch.\n"]
    pub framework_dir_path: cef_string_t,
    #[doc = "\n The path to the main bundle on macOS. If this value is empty then it\n defaults to the top-level app bundle. If this value is non-empty then it\n must be an absolute path. Also configurable using the \"main-bundle-path\"\n command-line switch.\n"]
    pub main_bundle_path: cef_string_t,
    #[doc = "\n Set to true (1) to have the browser process message loop run in a separate\n thread. If false (0) then the CefDoMessageLoopWork() function must be\n called from your application message loop. This option is only supported\n on Windows and Linux.\n"]
    pub multi_threaded_message_loop: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to control browser process main (UI) thread message pump\n scheduling via the CefBrowserProcessHandler::OnScheduleMessagePumpWork()\n callback. This option is recommended for use in combination with the\n CefDoMessageLoopWork() function in cases where the CEF message loop must\n be integrated into an existing application message loop (see additional\n comments and warnings on CefDoMessageLoopWork). Enabling this option is\n not recommended for most users; leave this option disabled and use either\n the CefRunMessageLoop() function or multi_threaded_message_loop if\n possible.\n"]
    pub external_message_pump: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to enable windowless (off-screen) rendering support. Do\n not enable this value if the application does not use windowless rendering\n as it may reduce rendering performance on some systems.\n"]
    pub windowless_rendering_enabled: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to disable configuration of browser process features using\n standard CEF and Chromium command-line arguments. Configuration can still\n be specified using CEF data structures or via the\n CefApp::OnBeforeCommandLineProcessing() method.\n"]
    pub command_line_args_disabled: ::std::os::raw::c_int,
    #[doc = "\n The directory where data for the global browser cache will be stored on\n disk. If this value is non-empty then it must be an absolute path that is\n either equal to or a child directory of CefSettings.root_cache_path. If\n this value is empty then browsers will be created in \"incognito mode\"\n where in-memory caches are used for storage and no profile-specific data\n is persisted to disk (installation-specific data will still be persisted\n in root_cache_path). HTML5 databases such as localStorage will only\n persist across sessions if a cache path is specified. Can be overridden\n for individual CefRequestContext instances via the\n CefRequestContextSettings.cache_path value. Any child directory value will\n be ignored and the \"default\" profile (also a child directory) will be used\n instead.\n"]
    pub cache_path: cef_string_t,
    #[doc = "\n The root directory for installation-specific data and the parent directory\n for profile-specific data. All CefSettings.cache_path and\n CefRequestContextSettings.cache_path values must have this parent\n directory in common. If this value is empty and CefSettings.cache_path is\n non-empty then it will default to the CefSettings.cache_path value. Any\n non-empty value must be an absolute path. If both values are empty then\n the default platform-specific directory will be used\n (\"~/.config/cef_user_data\" directory on Linux, \"~/Library/Application\n Support/CEF/User Data\" directory on MacOS, \"AppData\\Local\\CEF\\User Data\"\n directory under the user profile directory on Windows). Use of the default\n directory is not recommended in production applications (see below).\n\n Multiple application instances writing to the same root_cache_path\n directory could result in data corruption. A process singleton lock based\n on the root_cache_path value is therefore used to protect against this.\n This singleton behavior applies to all CEF-based applications using\n version 120 or newer. You should customize root_cache_path for your\n application and implement CefBrowserProcessHandler::\n OnAlreadyRunningAppRelaunch, which will then be called on any app relaunch\n with the same root_cache_path value.\n\n Failure to set the root_cache_path value correctly may result in startup\n crashes or other unexpected behaviors (for example, the sandbox blocking\n read/write access to certain files).\n"]
    pub root_cache_path: cef_string_t,
    #[doc = "\n To persist session cookies (cookies without an expiry date or validity\n interval) by default when using the global cookie manager set this value\n to true (1). Session cookies are generally intended to be transient and\n most Web browsers do not persist them. A |cache_path| value must also be\n specified to enable this feature. Also configurable using the\n \"persist-session-cookies\" command-line switch. Can be overridden for\n individual CefRequestContext instances via the\n CefRequestContextSettings.persist_session_cookies value.\n"]
    pub persist_session_cookies: ::std::os::raw::c_int,
    #[doc = "\n Value that will be returned as the User-Agent HTTP header. If empty the\n default User-Agent string will be used. Also configurable using the\n \"user-agent\" command-line switch.\n"]
    pub user_agent: cef_string_t,
    #[doc = "\n Value that will be inserted as the product portion of the default\n User-Agent string. If empty the Chromium product version will be used. If\n |userAgent| is specified this value will be ignored. Also configurable\n using the \"user-agent-product\" command-line switch.\n"]
    pub user_agent_product: cef_string_t,
    #[doc = "\n The locale string that will be passed to WebKit. If empty the default\n locale of \"en-US\" will be used. This value is ignored on Linux where\n locale is determined using environment variable parsing with the\n precedence order: LANGUAGE, LC_ALL, LC_MESSAGES and LANG. Also\n configurable using the \"lang\" command-line switch.\n"]
    pub locale: cef_string_t,
    #[doc = "\n The directory and file name to use for the debug log. If empty a default\n log file name and location will be used. On Windows and Linux a\n \"debug.log\" file will be written in the main executable directory. On\n MacOS a \"~/Library/Logs/[app name]_debug.log\" file will be written where\n [app name] is the name of the main app executable. Also configurable using\n the \"log-file\" command-line switch.\n"]
    pub log_file: cef_string_t,
    #[doc = "\n The log severity. Only messages of this severity level or higher will be\n logged. When set to DISABLE no messages will be written to the log file,\n but FATAL messages will still be output to stderr. Also configurable using\n the \"log-severity\" command-line switch with a value of \"verbose\", \"info\",\n \"warning\", \"error\", \"fatal\" or \"disable\".\n"]
    pub log_severity: cef_log_severity_t,
    #[doc = "\n The log items prepended to each log line. If not set the default log items\n will be used. Also configurable using the \"log-items\" command-line switch\n with a value of \"none\" for no log items, or a comma-delimited list of\n values \"pid\", \"tid\", \"timestamp\" or \"tickcount\" for custom log items.\n"]
    pub log_items: cef_log_items_t,
    #[doc = "\n Custom flags that will be used when initializing the V8 JavaScript engine.\n The consequences of using custom flags may not be well tested. Also\n configurable using the \"js-flags\" command-line switch.\n"]
    pub javascript_flags: cef_string_t,
    #[doc = "\n The fully qualified path for the resources directory. If this value is\n empty the *.pak files must be located in the module directory on\n Windows/Linux or the app bundle Resources directory on MacOS. If this\n value is non-empty then it must be an absolute path. Also configurable\n using the \"resources-dir-path\" command-line switch.\n"]
    pub resources_dir_path: cef_string_t,
    #[doc = "\n The fully qualified path for the locales directory. If this value is empty\n the locales directory must be located in the module directory. If this\n value is non-empty then it must be an absolute path. This value is ignored\n on MacOS where pack files are always loaded from the app bundle Resources\n directory. Also configurable using the \"locales-dir-path\" command-line\n switch.\n"]
    pub locales_dir_path: cef_string_t,
    #[doc = "\n Set to a value between 1024 and 65535 to enable remote debugging on the\n specified port. Also configurable using the \"remote-debugging-port\"\n command-line switch. Specifying 0 via the command-line switch will result\n in the selection of an ephemeral port and the port number will be printed\n as part of the WebSocket endpoint URL to stderr. If a cache directory path\n is provided the port will also be written to the\n <cache-dir>/DevToolsActivePort file. Remote debugging can be accessed by\n loading the chrome://inspect page in Google Chrome. Port numbers 9222 and\n 9229 are discoverable by default. Other port numbers may need to be\n configured via \"Discover network targets\" on the Devices tab.\n"]
    pub remote_debugging_port: ::std::os::raw::c_int,
    #[doc = "\n The number of stack trace frames to capture for uncaught exceptions.\n Specify a positive value to enable the\n CefRenderProcessHandler::OnUncaughtException() callback. Specify 0\n (default value) and OnUncaughtException() will not be called. Also\n configurable using the \"uncaught-exception-stack-size\" command-line\n switch.\n"]
    pub uncaught_exception_stack_size: ::std::os::raw::c_int,
    #[doc = "\n Background color used for the browser before a document is loaded and when\n no document color is specified. The alpha component must be either fully\n opaque (0xFF) or fully transparent (0x00). If the alpha component is fully\n opaque then the RGB components will be used as the background color. If\n the alpha component is fully transparent for a windowed browser then the\n default value of opaque white be used. If the alpha component is fully\n transparent for a windowless (off-screen) browser then transparent\n painting will be enabled.\n"]
    pub background_color: cef_color_t,
    #[doc = "\n Comma delimited ordered list of language codes without any whitespace that\n will be used in the \"Accept-Language\" HTTP request header and\n \"navigator.language\" JS attribute. Can be overridden for individual\n CefRequestContext instances via the\n CefRequestContextSettings.accept_language_list value.\n"]
    pub accept_language_list: cef_string_t,
    #[doc = "\n Comma delimited list of schemes supported by the associated\n CefCookieManager. If |cookieable_schemes_exclude_defaults| is false (0)\n the default schemes (\"http\", \"https\", \"ws\" and \"wss\") will also be\n supported. Not specifying a |cookieable_schemes_list| value and setting\n |cookieable_schemes_exclude_defaults| to true (1) will disable all loading\n and saving of cookies. These settings will only impact the global\n CefRequestContext. Individual CefRequestContext instances can be\n configured via the CefRequestContextSettings.cookieable_schemes_list and\n CefRequestContextSettings.cookieable_schemes_exclude_defaults values.\n"]
    pub cookieable_schemes_list: cef_string_t,
    pub cookieable_schemes_exclude_defaults: ::std::os::raw::c_int,
    #[doc = "\n Specify an ID to enable Chrome policy management via Platform and OS-user\n policies. On Windows, this is a registry key like\n \"SOFTWARE\\\\Policies\\\\Google\\\\Chrome\". On MacOS, this is a bundle ID like\n \"com.google.Chrome\". On Linux, this is an absolute directory path like\n \"/etc/opt/chrome/policies\". Only supported with Chrome style. See\n https://support.google.com/chrome/a/answer/9037717 for details.\n\n Chrome Browser Cloud Management integration, when enabled via the\n \"enable-chrome-browser-cloud-management\" command-line flag, will also use\n the specified ID. See https://support.google.com/chrome/a/answer/9116814\n for details.\n"]
    pub chrome_policy_id: cef_string_t,
    #[doc = "\n Specify an ID for an ICON resource that can be loaded from the main\n executable and used when creating default Chrome windows such as DevTools\n and Task Manager. If unspecified the default Chromium ICON (IDR_MAINFRAME\n [101]) will be loaded from libcef.dll. Only supported with Chrome style on\n Windows.\n"]
    pub chrome_app_icon_id: ::std::os::raw::c_int,
    #[doc = "\n Specify whether signal handlers must be disabled on POSIX systems.\n"]
    pub disable_signal_handlers: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_settings_t"][::std::mem::size_of::<_cef_settings_t>() - 440usize];
    ["Alignment of _cef_settings_t"][::std::mem::align_of::<_cef_settings_t>() - 8usize];
    ["Offset of field: _cef_settings_t::size"]
        [::std::mem::offset_of!(_cef_settings_t, size) - 0usize];
    ["Offset of field: _cef_settings_t::no_sandbox"]
        [::std::mem::offset_of!(_cef_settings_t, no_sandbox) - 8usize];
    ["Offset of field: _cef_settings_t::browser_subprocess_path"]
        [::std::mem::offset_of!(_cef_settings_t, browser_subprocess_path) - 16usize];
    ["Offset of field: _cef_settings_t::framework_dir_path"]
        [::std::mem::offset_of!(_cef_settings_t, framework_dir_path) - 40usize];
    ["Offset of field: _cef_settings_t::main_bundle_path"]
        [::std::mem::offset_of!(_cef_settings_t, main_bundle_path) - 64usize];
    ["Offset of field: _cef_settings_t::multi_threaded_message_loop"]
        [::std::mem::offset_of!(_cef_settings_t, multi_threaded_message_loop) - 88usize];
    ["Offset of field: _cef_settings_t::external_message_pump"]
        [::std::mem::offset_of!(_cef_settings_t, external_message_pump) - 92usize];
    ["Offset of field: _cef_settings_t::windowless_rendering_enabled"]
        [::std::mem::offset_of!(_cef_settings_t, windowless_rendering_enabled) - 96usize];
    ["Offset of field: _cef_settings_t::command_line_args_disabled"]
        [::std::mem::offset_of!(_cef_settings_t, command_line_args_disabled) - 100usize];
    ["Offset of field: _cef_settings_t::cache_path"]
        [::std::mem::offset_of!(_cef_settings_t, cache_path) - 104usize];
    ["Offset of field: _cef_settings_t::root_cache_path"]
        [::std::mem::offset_of!(_cef_settings_t, root_cache_path) - 128usize];
    ["Offset of field: _cef_settings_t::persist_session_cookies"]
        [::std::mem::offset_of!(_cef_settings_t, persist_session_cookies) - 152usize];
    ["Offset of field: _cef_settings_t::user_agent"]
        [::std::mem::offset_of!(_cef_settings_t, user_agent) - 160usize];
    ["Offset of field: _cef_settings_t::user_agent_product"]
        [::std::mem::offset_of!(_cef_settings_t, user_agent_product) - 184usize];
    ["Offset of field: _cef_settings_t::locale"]
        [::std::mem::offset_of!(_cef_settings_t, locale) - 208usize];
    ["Offset of field: _cef_settings_t::log_file"]
        [::std::mem::offset_of!(_cef_settings_t, log_file) - 232usize];
    ["Offset of field: _cef_settings_t::log_severity"]
        [::std::mem::offset_of!(_cef_settings_t, log_severity) - 256usize];
    ["Offset of field: _cef_settings_t::log_items"]
        [::std::mem::offset_of!(_cef_settings_t, log_items) - 260usize];
    ["Offset of field: _cef_settings_t::javascript_flags"]
        [::std::mem::offset_of!(_cef_settings_t, javascript_flags) - 264usize];
    ["Offset of field: _cef_settings_t::resources_dir_path"]
        [::std::mem::offset_of!(_cef_settings_t, resources_dir_path) - 288usize];
    ["Offset of field: _cef_settings_t::locales_dir_path"]
        [::std::mem::offset_of!(_cef_settings_t, locales_dir_path) - 312usize];
    ["Offset of field: _cef_settings_t::remote_debugging_port"]
        [::std::mem::offset_of!(_cef_settings_t, remote_debugging_port) - 336usize];
    ["Offset of field: _cef_settings_t::uncaught_exception_stack_size"]
        [::std::mem::offset_of!(_cef_settings_t, uncaught_exception_stack_size) - 340usize];
    ["Offset of field: _cef_settings_t::background_color"]
        [::std::mem::offset_of!(_cef_settings_t, background_color) - 344usize];
    ["Offset of field: _cef_settings_t::accept_language_list"]
        [::std::mem::offset_of!(_cef_settings_t, accept_language_list) - 352usize];
    ["Offset of field: _cef_settings_t::cookieable_schemes_list"]
        [::std::mem::offset_of!(_cef_settings_t, cookieable_schemes_list) - 376usize];
    ["Offset of field: _cef_settings_t::cookieable_schemes_exclude_defaults"]
        [::std::mem::offset_of!(_cef_settings_t, cookieable_schemes_exclude_defaults) - 400usize];
    ["Offset of field: _cef_settings_t::chrome_policy_id"]
        [::std::mem::offset_of!(_cef_settings_t, chrome_policy_id) - 408usize];
    ["Offset of field: _cef_settings_t::chrome_app_icon_id"]
        [::std::mem::offset_of!(_cef_settings_t, chrome_app_icon_id) - 432usize];
    ["Offset of field: _cef_settings_t::disable_signal_handlers"]
        [::std::mem::offset_of!(_cef_settings_t, disable_signal_handlers) - 436usize];
};
#[doc = "\n Initialization settings. Specify NULL or 0 to get the recommended default\n values. Many of these and other settings can also configured using command-\n line switches.\n"]
pub type cef_settings_t = _cef_settings_t;
#[doc = "\n Request context initialization settings. Specify NULL or 0 to get the\n recommended default values.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_request_context_settings_t {
    #[doc = "\n Size of this structure.\n"]
    pub size: usize,
    #[doc = "\n The directory where cache data for this request context will be stored on\n disk. If this value is non-empty then it must be an absolute path that is\n either equal to or a child directory of CefSettings.root_cache_path. If\n this value is empty then browsers will be created in \"incognito mode\"\n where in-memory caches are used for storage and no profile-specific data\n is persisted to disk (installation-specific data will still be persisted\n in root_cache_path). HTML5 databases such as localStorage will only\n persist across sessions if a cache path is specified. To share the global\n browser cache and related configuration set this value to match the\n CefSettings.cache_path value.\n"]
    pub cache_path: cef_string_t,
    #[doc = "\n To persist session cookies (cookies without an expiry date or validity\n interval) by default when using the global cookie manager set this value\n to true (1). Session cookies are generally intended to be transient and\n most Web browsers do not persist them. Can be set globally using the\n CefSettings.persist_session_cookies value. This value will be ignored if\n |cache_path| is empty or if it matches the CefSettings.cache_path value.\n"]
    pub persist_session_cookies: ::std::os::raw::c_int,
    #[doc = "\n Comma delimited ordered list of language codes without any whitespace that\n will be used in the \"Accept-Language\" HTTP request header and\n \"navigator.language\" JS attribute. Can be set globally using the\n CefSettings.accept_language_list value. If all values are empty then\n \"en-US,en\" will be used. This value will be ignored if |cache_path|\n matches the CefSettings.cache_path value.\n"]
    pub accept_language_list: cef_string_t,
    #[doc = "\n Comma delimited list of schemes supported by the associated\n CefCookieManager. If |cookieable_schemes_exclude_defaults| is false (0)\n the default schemes (\"http\", \"https\", \"ws\" and \"wss\") will also be\n supported. Not specifying a |cookieable_schemes_list| value and setting\n |cookieable_schemes_exclude_defaults| to true (1) will disable all loading\n and saving of cookies. These values will be ignored if |cache_path|\n matches the CefSettings.cache_path value.\n"]
    pub cookieable_schemes_list: cef_string_t,
    pub cookieable_schemes_exclude_defaults: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_request_context_settings_t"]
        [::std::mem::size_of::<_cef_request_context_settings_t>() - 96usize];
    ["Alignment of _cef_request_context_settings_t"]
        [::std::mem::align_of::<_cef_request_context_settings_t>() - 8usize];
    ["Offset of field: _cef_request_context_settings_t::size"]
        [::std::mem::offset_of!(_cef_request_context_settings_t, size) - 0usize];
    ["Offset of field: _cef_request_context_settings_t::cache_path"]
        [::std::mem::offset_of!(_cef_request_context_settings_t, cache_path) - 8usize];
    ["Offset of field: _cef_request_context_settings_t::persist_session_cookies"][::std::mem::offset_of!(
        _cef_request_context_settings_t,
        persist_session_cookies
    ) - 32usize];
    ["Offset of field: _cef_request_context_settings_t::accept_language_list"]
        [::std::mem::offset_of!(_cef_request_context_settings_t, accept_language_list) - 40usize];
    ["Offset of field: _cef_request_context_settings_t::cookieable_schemes_list"][::std::mem::offset_of!(
        _cef_request_context_settings_t,
        cookieable_schemes_list
    ) - 64usize];
    ["Offset of field: _cef_request_context_settings_t::cookieable_schemes_exclude_defaults"][::std::mem::offset_of!(
        _cef_request_context_settings_t,
        cookieable_schemes_exclude_defaults
    )
        - 88usize];
};
#[doc = "\n Request context initialization settings. Specify NULL or 0 to get the\n recommended default values.\n"]
pub type cef_request_context_settings_t = _cef_request_context_settings_t;
#[doc = "\n Browser initialization settings. Specify NULL or 0 to get the recommended\n default values. The consequences of using custom values may not be well\n tested. Many of these and other settings can also configured using command-\n line switches.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_browser_settings_t {
    #[doc = "\n Size of this structure.\n"]
    pub size: usize,
    #[doc = "\n The maximum rate in frames per second (fps) that CefRenderHandler::OnPaint\n will be called for a windowless browser. The actual fps may be lower if\n the browser cannot generate frames at the requested rate. The minimum\n value is 1 and the maximum value is 60 (default 30). This value can also\n be changed dynamically via CefBrowserHost::SetWindowlessFrameRate.\n"]
    pub windowless_frame_rate: ::std::os::raw::c_int,
    #[doc = "\n Font settings.\n"]
    pub standard_font_family: cef_string_t,
    pub fixed_font_family: cef_string_t,
    pub serif_font_family: cef_string_t,
    pub sans_serif_font_family: cef_string_t,
    pub cursive_font_family: cef_string_t,
    pub fantasy_font_family: cef_string_t,
    pub default_font_size: ::std::os::raw::c_int,
    pub default_fixed_font_size: ::std::os::raw::c_int,
    pub minimum_font_size: ::std::os::raw::c_int,
    pub minimum_logical_font_size: ::std::os::raw::c_int,
    #[doc = "\n Default encoding for Web content. If empty \"ISO-8859-1\" will be used. Also\n configurable using the \"default-encoding\" command-line switch.\n"]
    pub default_encoding: cef_string_t,
    #[doc = "\n Controls the loading of fonts from remote sources. Also configurable using\n the \"disable-remote-fonts\" command-line switch.\n"]
    pub remote_fonts: cef_state_t,
    #[doc = "\n Controls whether JavaScript can be executed. Also configurable using the\n \"disable-javascript\" command-line switch.\n"]
    pub javascript: cef_state_t,
    #[doc = "\n Controls whether JavaScript can be used to close windows that were not\n opened via JavaScript. JavaScript can still be used to close windows that\n were opened via JavaScript or that have no back/forward history. Also\n configurable using the \"disable-javascript-close-windows\" command-line\n switch.\n"]
    pub javascript_close_windows: cef_state_t,
    #[doc = "\n Controls whether JavaScript can access the clipboard. Also configurable\n using the \"disable-javascript-access-clipboard\" command-line switch.\n"]
    pub javascript_access_clipboard: cef_state_t,
    #[doc = "\n Controls whether DOM pasting is supported in the editor via\n execCommand(\"paste\"). The |javascript_access_clipboard| setting must also\n be enabled. Also configurable using the \"disable-javascript-dom-paste\"\n command-line switch.\n"]
    pub javascript_dom_paste: cef_state_t,
    #[doc = "\n Controls whether image URLs will be loaded from the network. A cached\n image will still be rendered if requested. Also configurable using the\n \"disable-image-loading\" command-line switch.\n"]
    pub image_loading: cef_state_t,
    #[doc = "\n Controls whether standalone images will be shrunk to fit the page. Also\n configurable using the \"image-shrink-standalone-to-fit\" command-line\n switch.\n"]
    pub image_shrink_standalone_to_fit: cef_state_t,
    #[doc = "\n Controls whether text areas can be resized. Also configurable using the\n \"disable-text-area-resize\" command-line switch.\n"]
    pub text_area_resize: cef_state_t,
    #[doc = "\n Controls whether the tab key can advance focus to links. Also configurable\n using the \"disable-tab-to-links\" command-line switch.\n"]
    pub tab_to_links: cef_state_t,
    #[doc = "\n Controls whether local storage can be used. Also configurable using the\n \"disable-local-storage\" command-line switch.\n"]
    pub local_storage: cef_state_t,
    #[doc = "\n Controls whether databases can be used. Also configurable using the\n \"disable-databases\" command-line switch.\n"]
    pub databases: cef_state_t,
    #[doc = "\n Controls whether WebGL can be used. Note that WebGL requires hardware\n support and may not work on all systems even when enabled. Also\n configurable using the \"disable-webgl\" command-line switch.\n"]
    pub webgl: cef_state_t,
    #[doc = "\n Background color used for the browser before a document is loaded and when\n no document color is specified. The alpha component must be either fully\n opaque (0xFF) or fully transparent (0x00). If the alpha component is fully\n opaque then the RGB components will be used as the background color. If\n the alpha component is fully transparent for a windowed browser then the\n CefSettings.background_color value will be used. If the alpha component is\n fully transparent for a windowless (off-screen) browser then transparent\n painting will be enabled.\n"]
    pub background_color: cef_color_t,
    #[doc = "\n Controls whether the Chrome status bubble will be used. Only supported\n with Chrome style. For details about the status bubble see\n https://www.chromium.org/user-experience/status-bubble/\n"]
    pub chrome_status_bubble: cef_state_t,
    #[doc = "\n Controls whether the Chrome zoom bubble will be shown when zooming. Only\n supported with Chrome style.\n"]
    pub chrome_zoom_bubble: cef_state_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_browser_settings_t"]
        [::std::mem::size_of::<_cef_browser_settings_t>() - 264usize];
    ["Alignment of _cef_browser_settings_t"]
        [::std::mem::align_of::<_cef_browser_settings_t>() - 8usize];
    ["Offset of field: _cef_browser_settings_t::size"]
        [::std::mem::offset_of!(_cef_browser_settings_t, size) - 0usize];
    ["Offset of field: _cef_browser_settings_t::windowless_frame_rate"]
        [::std::mem::offset_of!(_cef_browser_settings_t, windowless_frame_rate) - 8usize];
    ["Offset of field: _cef_browser_settings_t::standard_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, standard_font_family) - 16usize];
    ["Offset of field: _cef_browser_settings_t::fixed_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, fixed_font_family) - 40usize];
    ["Offset of field: _cef_browser_settings_t::serif_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, serif_font_family) - 64usize];
    ["Offset of field: _cef_browser_settings_t::sans_serif_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, sans_serif_font_family) - 88usize];
    ["Offset of field: _cef_browser_settings_t::cursive_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, cursive_font_family) - 112usize];
    ["Offset of field: _cef_browser_settings_t::fantasy_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, fantasy_font_family) - 136usize];
    ["Offset of field: _cef_browser_settings_t::default_font_size"]
        [::std::mem::offset_of!(_cef_browser_settings_t, default_font_size) - 160usize];
    ["Offset of field: _cef_browser_settings_t::default_fixed_font_size"]
        [::std::mem::offset_of!(_cef_browser_settings_t, default_fixed_font_size) - 164usize];
    ["Offset of field: _cef_browser_settings_t::minimum_font_size"]
        [::std::mem::offset_of!(_cef_browser_settings_t, minimum_font_size) - 168usize];
    ["Offset of field: _cef_browser_settings_t::minimum_logical_font_size"]
        [::std::mem::offset_of!(_cef_browser_settings_t, minimum_logical_font_size) - 172usize];
    ["Offset of field: _cef_browser_settings_t::default_encoding"]
        [::std::mem::offset_of!(_cef_browser_settings_t, default_encoding) - 176usize];
    ["Offset of field: _cef_browser_settings_t::remote_fonts"]
        [::std::mem::offset_of!(_cef_browser_settings_t, remote_fonts) - 200usize];
    ["Offset of field: _cef_browser_settings_t::javascript"]
        [::std::mem::offset_of!(_cef_browser_settings_t, javascript) - 204usize];
    ["Offset of field: _cef_browser_settings_t::javascript_close_windows"]
        [::std::mem::offset_of!(_cef_browser_settings_t, javascript_close_windows) - 208usize];
    ["Offset of field: _cef_browser_settings_t::javascript_access_clipboard"]
        [::std::mem::offset_of!(_cef_browser_settings_t, javascript_access_clipboard) - 212usize];
    ["Offset of field: _cef_browser_settings_t::javascript_dom_paste"]
        [::std::mem::offset_of!(_cef_browser_settings_t, javascript_dom_paste) - 216usize];
    ["Offset of field: _cef_browser_settings_t::image_loading"]
        [::std::mem::offset_of!(_cef_browser_settings_t, image_loading) - 220usize];
    ["Offset of field: _cef_browser_settings_t::image_shrink_standalone_to_fit"][::std::mem::offset_of!(
        _cef_browser_settings_t,
        image_shrink_standalone_to_fit
    ) - 224usize];
    ["Offset of field: _cef_browser_settings_t::text_area_resize"]
        [::std::mem::offset_of!(_cef_browser_settings_t, text_area_resize) - 228usize];
    ["Offset of field: _cef_browser_settings_t::tab_to_links"]
        [::std::mem::offset_of!(_cef_browser_settings_t, tab_to_links) - 232usize];
    ["Offset of field: _cef_browser_settings_t::local_storage"]
        [::std::mem::offset_of!(_cef_browser_settings_t, local_storage) - 236usize];
    ["Offset of field: _cef_browser_settings_t::databases"]
        [::std::mem::offset_of!(_cef_browser_settings_t, databases) - 240usize];
    ["Offset of field: _cef_browser_settings_t::webgl"]
        [::std::mem::offset_of!(_cef_browser_settings_t, webgl) - 244usize];
    ["Offset of field: _cef_browser_settings_t::background_color"]
        [::std::mem::offset_of!(_cef_browser_settings_t, background_color) - 248usize];
    ["Offset of field: _cef_browser_settings_t::chrome_status_bubble"]
        [::std::mem::offset_of!(_cef_browser_settings_t, chrome_status_bubble) - 252usize];
    ["Offset of field: _cef_browser_settings_t::chrome_zoom_bubble"]
        [::std::mem::offset_of!(_cef_browser_settings_t, chrome_zoom_bubble) - 256usize];
};
#[doc = "\n Browser initialization settings. Specify NULL or 0 to get the recommended\n default values. The consequences of using custom values may not be well\n tested. Many of these and other settings can also configured using command-\n line switches.\n"]
pub type cef_browser_settings_t = _cef_browser_settings_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Return value types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_return_value_t {
    #[doc = "\n Cancel immediately.\n"]
    RV_CANCEL = 0,
    #[doc = "\n Continue immediately.\n"]
    RV_CONTINUE = 1,
    #[doc = "\n Continue asynchronously (usually via a callback).\n"]
    RV_CONTINUE_ASYNC = 2,
}
#[doc = "\n URL component parts.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_urlparts_t {
    #[doc = "\n The complete URL specification.\n"]
    pub spec: cef_string_t,
    #[doc = "\n Scheme component not including the colon (e.g., \"http\").\n"]
    pub scheme: cef_string_t,
    #[doc = "\n User name component.\n"]
    pub username: cef_string_t,
    #[doc = "\n Password component.\n"]
    pub password: cef_string_t,
    #[doc = "\n Host component. This may be a hostname, an IPv4 address or an IPv6 literal\n surrounded by square brackets (e.g., \"[2001:db8::1]\").\n"]
    pub host: cef_string_t,
    #[doc = "\n Port number component.\n"]
    pub port: cef_string_t,
    #[doc = "\n Origin contains just the scheme, host, and port from a URL. Equivalent to\n clearing any username and password, replacing the path with a slash, and\n clearing everything after that. This value will be empty for non-standard\n URLs.\n"]
    pub origin: cef_string_t,
    #[doc = "\n Path component including the first slash following the host.\n"]
    pub path: cef_string_t,
    #[doc = "\n Query string component (i.e., everything following the '?').\n"]
    pub query: cef_string_t,
    #[doc = "\n Fragment (hash) identifier component (i.e., the string following the '#').\n"]
    pub fragment: cef_string_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_urlparts_t"][::std::mem::size_of::<_cef_urlparts_t>() - 240usize];
    ["Alignment of _cef_urlparts_t"][::std::mem::align_of::<_cef_urlparts_t>() - 8usize];
    ["Offset of field: _cef_urlparts_t::spec"]
        [::std::mem::offset_of!(_cef_urlparts_t, spec) - 0usize];
    ["Offset of field: _cef_urlparts_t::scheme"]
        [::std::mem::offset_of!(_cef_urlparts_t, scheme) - 24usize];
    ["Offset of field: _cef_urlparts_t::username"]
        [::std::mem::offset_of!(_cef_urlparts_t, username) - 48usize];
    ["Offset of field: _cef_urlparts_t::password"]
        [::std::mem::offset_of!(_cef_urlparts_t, password) - 72usize];
    ["Offset of field: _cef_urlparts_t::host"]
        [::std::mem::offset_of!(_cef_urlparts_t, host) - 96usize];
    ["Offset of field: _cef_urlparts_t::port"]
        [::std::mem::offset_of!(_cef_urlparts_t, port) - 120usize];
    ["Offset of field: _cef_urlparts_t::origin"]
        [::std::mem::offset_of!(_cef_urlparts_t, origin) - 144usize];
    ["Offset of field: _cef_urlparts_t::path"]
        [::std::mem::offset_of!(_cef_urlparts_t, path) - 168usize];
    ["Offset of field: _cef_urlparts_t::query"]
        [::std::mem::offset_of!(_cef_urlparts_t, query) - 192usize];
    ["Offset of field: _cef_urlparts_t::fragment"]
        [::std::mem::offset_of!(_cef_urlparts_t, fragment) - 216usize];
};
#[doc = "\n URL component parts.\n"]
pub type cef_urlparts_t = _cef_urlparts_t;
#[repr(i32)]
#[non_exhaustive]
#[doc = "\n Cookie priority values.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_cookie_priority_t {
    CEF_COOKIE_PRIORITY_LOW = -1,
    CEF_COOKIE_PRIORITY_MEDIUM = 0,
    CEF_COOKIE_PRIORITY_HIGH = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Cookie same site values.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_cookie_same_site_t {
    CEF_COOKIE_SAME_SITE_UNSPECIFIED = 0,
    CEF_COOKIE_SAME_SITE_NO_RESTRICTION = 1,
    CEF_COOKIE_SAME_SITE_LAX_MODE = 2,
    CEF_COOKIE_SAME_SITE_STRICT_MODE = 3,
}
#[doc = "\n Cookie information.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_cookie_t {
    #[doc = "\n The cookie name.\n"]
    pub name: cef_string_t,
    #[doc = "\n The cookie value.\n"]
    pub value: cef_string_t,
    #[doc = "\n If |domain| is empty a host cookie will be created instead of a domain\n cookie. Domain cookies are stored with a leading \".\" and are visible to\n sub-domains whereas host cookies are not.\n"]
    pub domain: cef_string_t,
    #[doc = "\n If |path| is non-empty only URLs at or below the path will get the cookie\n value.\n"]
    pub path: cef_string_t,
    #[doc = "\n If |secure| is true the cookie will only be sent for HTTPS requests.\n"]
    pub secure: ::std::os::raw::c_int,
    #[doc = "\n If |httponly| is true the cookie will only be sent for HTTP requests.\n"]
    pub httponly: ::std::os::raw::c_int,
    #[doc = "\n The cookie creation date. This is automatically populated by the system on\n cookie creation.\n"]
    pub creation: cef_basetime_t,
    #[doc = "\n The cookie last access date. This is automatically populated by the system\n on access.\n"]
    pub last_access: cef_basetime_t,
    #[doc = "\n The cookie expiration date is only valid if |has_expires| is true.\n"]
    pub has_expires: ::std::os::raw::c_int,
    pub expires: cef_basetime_t,
    #[doc = "\n Same site.\n"]
    pub same_site: cef_cookie_same_site_t,
    #[doc = "\n Priority.\n"]
    pub priority: cef_cookie_priority_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_cookie_t"][::std::mem::size_of::<_cef_cookie_t>() - 144usize];
    ["Alignment of _cef_cookie_t"][::std::mem::align_of::<_cef_cookie_t>() - 8usize];
    ["Offset of field: _cef_cookie_t::name"][::std::mem::offset_of!(_cef_cookie_t, name) - 0usize];
    ["Offset of field: _cef_cookie_t::value"]
        [::std::mem::offset_of!(_cef_cookie_t, value) - 24usize];
    ["Offset of field: _cef_cookie_t::domain"]
        [::std::mem::offset_of!(_cef_cookie_t, domain) - 48usize];
    ["Offset of field: _cef_cookie_t::path"][::std::mem::offset_of!(_cef_cookie_t, path) - 72usize];
    ["Offset of field: _cef_cookie_t::secure"]
        [::std::mem::offset_of!(_cef_cookie_t, secure) - 96usize];
    ["Offset of field: _cef_cookie_t::httponly"]
        [::std::mem::offset_of!(_cef_cookie_t, httponly) - 100usize];
    ["Offset of field: _cef_cookie_t::creation"]
        [::std::mem::offset_of!(_cef_cookie_t, creation) - 104usize];
    ["Offset of field: _cef_cookie_t::last_access"]
        [::std::mem::offset_of!(_cef_cookie_t, last_access) - 112usize];
    ["Offset of field: _cef_cookie_t::has_expires"]
        [::std::mem::offset_of!(_cef_cookie_t, has_expires) - 120usize];
    ["Offset of field: _cef_cookie_t::expires"]
        [::std::mem::offset_of!(_cef_cookie_t, expires) - 128usize];
    ["Offset of field: _cef_cookie_t::same_site"]
        [::std::mem::offset_of!(_cef_cookie_t, same_site) - 136usize];
    ["Offset of field: _cef_cookie_t::priority"]
        [::std::mem::offset_of!(_cef_cookie_t, priority) - 140usize];
};
#[doc = "\n Cookie information.\n"]
pub type cef_cookie_t = _cef_cookie_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Process termination status values.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_termination_status_t {
    #[doc = "\n Non-zero exit status.\n"]
    TS_ABNORMAL_TERMINATION = 0,
    #[doc = "\n SIGKILL or task manager kill.\n"]
    TS_PROCESS_WAS_KILLED = 1,
    #[doc = "\n Segmentation fault.\n"]
    TS_PROCESS_CRASHED = 2,
    #[doc = "\n Out of memory. Some platforms may use TS_PROCESS_CRASHED instead.\n"]
    TS_PROCESS_OOM = 3,
    #[doc = "\n Child process never launched.\n"]
    TS_LAUNCH_FAILED = 4,
    #[doc = "\n On Windows, the OS terminated the process due to code integrity failure.\n"]
    TS_INTEGRITY_FAILURE = 5,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Path key values.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_path_key_t {
    #[doc = "\n Current directory.\n"]
    PK_DIR_CURRENT = 0,
    #[doc = "\n Directory containing PK_FILE_EXE.\n"]
    PK_DIR_EXE = 1,
    #[doc = "\n Directory containing PK_FILE_MODULE.\n"]
    PK_DIR_MODULE = 2,
    #[doc = "\n Temporary directory.\n"]
    PK_DIR_TEMP = 3,
    #[doc = "\n Path and filename of the current executable.\n"]
    PK_FILE_EXE = 4,
    #[doc = "\n Path and filename of the module containing the CEF code (usually the\n libcef module).\n"]
    PK_FILE_MODULE = 5,
    #[doc = "\n \"Local Settings\\Application Data\" directory under the user profile\n directory on Windows.\n"]
    PK_LOCAL_APP_DATA = 6,
    #[doc = "\n \"Application Data\" directory under the user profile directory on Windows\n and \"~/Library/Application Support\" directory on MacOS.\n"]
    PK_USER_DATA = 7,
    #[doc = "\n Directory containing application resources. Can be configured via\n CefSettings.resources_dir_path.\n"]
    PK_DIR_RESOURCES = 8,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Storage types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_storage_type_t {
    ST_LOCALSTORAGE = 0,
    ST_SESSIONSTORAGE = 1,
}
#[repr(i32)]
#[non_exhaustive]
#[doc = "\n Supported error code values. For the complete list of error values see\n \"include/base/internal/cef_net_error_list.h\".\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_errorcode_t {
    ERR_NONE = 0,
    ERR_IO_PENDING = -1,
    ERR_FAILED = -2,
    ERR_ABORTED = -3,
    ERR_INVALID_ARGUMENT = -4,
    ERR_INVALID_HANDLE = -5,
    ERR_FILE_NOT_FOUND = -6,
    ERR_TIMED_OUT = -7,
    ERR_FILE_TOO_BIG = -8,
    ERR_UNEXPECTED = -9,
    ERR_ACCESS_DENIED = -10,
    ERR_NOT_IMPLEMENTED = -11,
    ERR_INSUFFICIENT_RESOURCES = -12,
    ERR_OUT_OF_MEMORY = -13,
    ERR_UPLOAD_FILE_CHANGED = -14,
    ERR_SOCKET_NOT_CONNECTED = -15,
    ERR_FILE_EXISTS = -16,
    ERR_FILE_PATH_TOO_LONG = -17,
    ERR_FILE_NO_SPACE = -18,
    ERR_FILE_VIRUS_INFECTED = -19,
    ERR_BLOCKED_BY_CLIENT = -20,
    ERR_NETWORK_CHANGED = -21,
    ERR_BLOCKED_BY_ADMINISTRATOR = -22,
    ERR_SOCKET_IS_CONNECTED = -23,
    ERR_UPLOAD_STREAM_REWIND_NOT_SUPPORTED = -25,
    ERR_CONTEXT_SHUT_DOWN = -26,
    ERR_BLOCKED_BY_RESPONSE = -27,
    ERR_CLEARTEXT_NOT_PERMITTED = -29,
    ERR_BLOCKED_BY_CSP = -30,
    ERR_H2_OR_QUIC_REQUIRED = -31,
    ERR_BLOCKED_BY_ORB = -32,
    ERR_NETWORK_ACCESS_REVOKED = -33,
    ERR_CONNECTION_CLOSED = -100,
    ERR_CONNECTION_RESET = -101,
    ERR_CONNECTION_REFUSED = -102,
    ERR_CONNECTION_ABORTED = -103,
    ERR_CONNECTION_FAILED = -104,
    ERR_NAME_NOT_RESOLVED = -105,
    ERR_INTERNET_DISCONNECTED = -106,
    ERR_SSL_PROTOCOL_ERROR = -107,
    ERR_ADDRESS_INVALID = -108,
    ERR_ADDRESS_UNREACHABLE = -109,
    ERR_SSL_CLIENT_AUTH_CERT_NEEDED = -110,
    ERR_TUNNEL_CONNECTION_FAILED = -111,
    ERR_NO_SSL_VERSIONS_ENABLED = -112,
    ERR_SSL_VERSION_OR_CIPHER_MISMATCH = -113,
    ERR_SSL_RENEGOTIATION_REQUESTED = -114,
    ERR_PROXY_AUTH_UNSUPPORTED = -115,
    ERR_BAD_SSL_CLIENT_AUTH_CERT = -117,
    ERR_CONNECTION_TIMED_OUT = -118,
    ERR_HOST_RESOLVER_QUEUE_TOO_LARGE = -119,
    ERR_SOCKS_CONNECTION_FAILED = -120,
    ERR_SOCKS_CONNECTION_HOST_UNREACHABLE = -121,
    ERR_ALPN_NEGOTIATION_FAILED = -122,
    ERR_SSL_NO_RENEGOTIATION = -123,
    ERR_WINSOCK_UNEXPECTED_WRITTEN_BYTES = -124,
    ERR_SSL_DECOMPRESSION_FAILURE_ALERT = -125,
    ERR_SSL_BAD_RECORD_MAC_ALERT = -126,
    ERR_PROXY_AUTH_REQUESTED = -127,
    ERR_PROXY_CONNECTION_FAILED = -130,
    ERR_MANDATORY_PROXY_CONFIGURATION_FAILED = -131,
    ERR_PRECONNECT_MAX_SOCKET_LIMIT = -133,
    ERR_SSL_CLIENT_AUTH_PRIVATE_KEY_ACCESS_DENIED = -134,
    ERR_SSL_CLIENT_AUTH_CERT_NO_PRIVATE_KEY = -135,
    ERR_PROXY_CERTIFICATE_INVALID = -136,
    ERR_NAME_RESOLUTION_FAILED = -137,
    ERR_NETWORK_ACCESS_DENIED = -138,
    ERR_TEMPORARILY_THROTTLED = -139,
    ERR_HTTPS_PROXY_TUNNEL_RESPONSE_REDIRECT = -140,
    ERR_SSL_CLIENT_AUTH_SIGNATURE_FAILED = -141,
    ERR_MSG_TOO_BIG = -142,
    ERR_WS_PROTOCOL_ERROR = -145,
    ERR_ADDRESS_IN_USE = -147,
    ERR_SSL_HANDSHAKE_NOT_COMPLETED = -148,
    ERR_SSL_BAD_PEER_PUBLIC_KEY = -149,
    ERR_SSL_PINNED_KEY_NOT_IN_CERT_CHAIN = -150,
    ERR_CLIENT_AUTH_CERT_TYPE_UNSUPPORTED = -151,
    ERR_SSL_DECRYPT_ERROR_ALERT = -153,
    ERR_WS_THROTTLE_QUEUE_TOO_LARGE = -154,
    ERR_SSL_SERVER_CERT_CHANGED = -156,
    ERR_SSL_UNRECOGNIZED_NAME_ALERT = -159,
    ERR_SOCKET_SET_RECEIVE_BUFFER_SIZE_ERROR = -160,
    ERR_SOCKET_SET_SEND_BUFFER_SIZE_ERROR = -161,
    ERR_SOCKET_RECEIVE_BUFFER_SIZE_UNCHANGEABLE = -162,
    ERR_SOCKET_SEND_BUFFER_SIZE_UNCHANGEABLE = -163,
    ERR_SSL_CLIENT_AUTH_CERT_BAD_FORMAT = -164,
    ERR_ICANN_NAME_COLLISION = -166,
    ERR_SSL_SERVER_CERT_BAD_FORMAT = -167,
    ERR_CT_STH_PARSING_FAILED = -168,
    ERR_CT_STH_INCOMPLETE = -169,
    ERR_UNABLE_TO_REUSE_CONNECTION_FOR_PROXY_AUTH = -170,
    ERR_CT_CONSISTENCY_PROOF_PARSING_FAILED = -171,
    ERR_SSL_OBSOLETE_CIPHER = -172,
    ERR_WS_UPGRADE = -173,
    ERR_READ_IF_READY_NOT_IMPLEMENTED = -174,
    ERR_NO_BUFFER_SPACE = -176,
    ERR_SSL_CLIENT_AUTH_NO_COMMON_ALGORITHMS = -177,
    ERR_EARLY_DATA_REJECTED = -178,
    ERR_WRONG_VERSION_ON_EARLY_DATA = -179,
    ERR_TLS13_DOWNGRADE_DETECTED = -180,
    ERR_SSL_KEY_USAGE_INCOMPATIBLE = -181,
    ERR_INVALID_ECH_CONFIG_LIST = -182,
    ERR_ECH_NOT_NEGOTIATED = -183,
    ERR_ECH_FALLBACK_CERTIFICATE_INVALID = -184,
    ERR_CERT_COMMON_NAME_INVALID = -200,
    ERR_CERT_DATE_INVALID = -201,
    ERR_CERT_AUTHORITY_INVALID = -202,
    ERR_CERT_CONTAINS_ERRORS = -203,
    ERR_CERT_NO_REVOCATION_MECHANISM = -204,
    ERR_CERT_UNABLE_TO_CHECK_REVOCATION = -205,
    ERR_CERT_REVOKED = -206,
    ERR_CERT_INVALID = -207,
    ERR_CERT_WEAK_SIGNATURE_ALGORITHM = -208,
    ERR_CERT_NON_UNIQUE_NAME = -210,
    ERR_CERT_WEAK_KEY = -211,
    ERR_CERT_NAME_CONSTRAINT_VIOLATION = -212,
    ERR_CERT_VALIDITY_TOO_LONG = -213,
    ERR_CERTIFICATE_TRANSPARENCY_REQUIRED = -214,
    ERR_CERT_SYMANTEC_LEGACY = -215,
    ERR_CERT_KNOWN_INTERCEPTION_BLOCKED = -217,
    ERR_CERT_END = -219,
    ERR_INVALID_URL = -300,
    ERR_DISALLOWED_URL_SCHEME = -301,
    ERR_UNKNOWN_URL_SCHEME = -302,
    ERR_INVALID_REDIRECT = -303,
    ERR_TOO_MANY_REDIRECTS = -310,
    ERR_UNSAFE_REDIRECT = -311,
    ERR_UNSAFE_PORT = -312,
    ERR_INVALID_RESPONSE = -320,
    ERR_INVALID_CHUNKED_ENCODING = -321,
    ERR_METHOD_NOT_SUPPORTED = -322,
    ERR_UNEXPECTED_PROXY_AUTH = -323,
    ERR_EMPTY_RESPONSE = -324,
    ERR_RESPONSE_HEADERS_TOO_BIG = -325,
    ERR_PAC_SCRIPT_FAILED = -327,
    ERR_REQUEST_RANGE_NOT_SATISFIABLE = -328,
    ERR_MALFORMED_IDENTITY = -329,
    ERR_CONTENT_DECODING_FAILED = -330,
    ERR_NETWORK_IO_SUSPENDED = -331,
    ERR_SYN_REPLY_NOT_RECEIVED = -332,
    ERR_ENCODING_CONVERSION_FAILED = -333,
    ERR_UNRECOGNIZED_FTP_DIRECTORY_LISTING_FORMAT = -334,
    ERR_NO_SUPPORTED_PROXIES = -336,
    ERR_HTTP2_PROTOCOL_ERROR = -337,
    ERR_INVALID_AUTH_CREDENTIALS = -338,
    ERR_UNSUPPORTED_AUTH_SCHEME = -339,
    ERR_ENCODING_DETECTION_FAILED = -340,
    ERR_MISSING_AUTH_CREDENTIALS = -341,
    ERR_UNEXPECTED_SECURITY_LIBRARY_STATUS = -342,
    ERR_MISCONFIGURED_AUTH_ENVIRONMENT = -343,
    ERR_UNDOCUMENTED_SECURITY_LIBRARY_STATUS = -344,
    ERR_RESPONSE_BODY_TOO_BIG_TO_DRAIN = -345,
    ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_LENGTH = -346,
    ERR_INCOMPLETE_HTTP2_HEADERS = -347,
    ERR_PAC_NOT_IN_DHCP = -348,
    ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_DISPOSITION = -349,
    ERR_RESPONSE_HEADERS_MULTIPLE_LOCATION = -350,
    ERR_HTTP2_SERVER_REFUSED_STREAM = -351,
    ERR_HTTP2_PING_FAILED = -352,
    ERR_CONTENT_LENGTH_MISMATCH = -354,
    ERR_INCOMPLETE_CHUNKED_ENCODING = -355,
    ERR_QUIC_PROTOCOL_ERROR = -356,
    ERR_RESPONSE_HEADERS_TRUNCATED = -357,
    ERR_QUIC_HANDSHAKE_FAILED = -358,
    ERR_HTTP2_INADEQUATE_TRANSPORT_SECURITY = -360,
    ERR_HTTP2_FLOW_CONTROL_ERROR = -361,
    ERR_HTTP2_FRAME_SIZE_ERROR = -362,
    ERR_HTTP2_COMPRESSION_ERROR = -363,
    ERR_PROXY_AUTH_REQUESTED_WITH_NO_CONNECTION = -364,
    ERR_HTTP_1_1_REQUIRED = -365,
    ERR_PROXY_HTTP_1_1_REQUIRED = -366,
    ERR_PAC_SCRIPT_TERMINATED = -367,
    ERR_INVALID_HTTP_RESPONSE = -370,
    ERR_CONTENT_DECODING_INIT_FAILED = -371,
    ERR_HTTP2_RST_STREAM_NO_ERROR_RECEIVED = -372,
    ERR_TOO_MANY_RETRIES = -375,
    ERR_HTTP2_STREAM_CLOSED = -376,
    ERR_HTTP_RESPONSE_CODE_FAILURE = -379,
    ERR_QUIC_CERT_ROOT_NOT_KNOWN = -380,
    ERR_QUIC_GOAWAY_REQUEST_CAN_BE_RETRIED = -381,
    ERR_TOO_MANY_ACCEPT_CH_RESTARTS = -382,
    ERR_INCONSISTENT_IP_ADDRESS_SPACE = -383,
    ERR_CACHED_IP_ADDRESS_SPACE_BLOCKED_BY_PRIVATE_NETWORK_ACCESS_POLICY = -384,
    ERR_BLOCKED_BY_PRIVATE_NETWORK_ACCESS_CHECKS = -385,
    ERR_ZSTD_WINDOW_SIZE_TOO_BIG = -386,
    ERR_DICTIONARY_LOAD_FAILED = -387,
    ERR_UNEXPECTED_CONTENT_DICTIONARY_HEADER = -388,
    ERR_CACHE_MISS = -400,
    ERR_CACHE_READ_FAILURE = -401,
    ERR_CACHE_WRITE_FAILURE = -402,
    ERR_CACHE_OPERATION_NOT_SUPPORTED = -403,
    ERR_CACHE_OPEN_FAILURE = -404,
    ERR_CACHE_CREATE_FAILURE = -405,
    ERR_CACHE_RACE = -406,
    ERR_CACHE_CHECKSUM_READ_FAILURE = -407,
    ERR_CACHE_CHECKSUM_MISMATCH = -408,
    ERR_CACHE_LOCK_TIMEOUT = -409,
    ERR_CACHE_AUTH_FAILURE_AFTER_READ = -410,
    ERR_CACHE_ENTRY_NOT_SUITABLE = -411,
    ERR_CACHE_DOOM_FAILURE = -412,
    ERR_CACHE_OPEN_OR_CREATE_FAILURE = -413,
    ERR_INSECURE_RESPONSE = -501,
    ERR_NO_PRIVATE_KEY_FOR_CERT = -502,
    ERR_ADD_USER_CERT_FAILED = -503,
    ERR_INVALID_SIGNED_EXCHANGE = -504,
    ERR_INVALID_WEB_BUNDLE = -505,
    ERR_TRUST_TOKEN_OPERATION_FAILED = -506,
    ERR_TRUST_TOKEN_OPERATION_SUCCESS_WITHOUT_SENDING_REQUEST = -507,
    ERR_PKCS12_IMPORT_BAD_PASSWORD = -701,
    ERR_PKCS12_IMPORT_FAILED = -702,
    ERR_IMPORT_CA_CERT_NOT_CA = -703,
    ERR_IMPORT_CERT_ALREADY_EXISTS = -704,
    ERR_IMPORT_CA_CERT_FAILED = -705,
    ERR_IMPORT_SERVER_CERT_FAILED = -706,
    ERR_PKCS12_IMPORT_INVALID_MAC = -707,
    ERR_PKCS12_IMPORT_INVALID_FILE = -708,
    ERR_PKCS12_IMPORT_UNSUPPORTED = -709,
    ERR_KEY_GENERATION_FAILED = -710,
    ERR_PRIVATE_KEY_EXPORT_FAILED = -712,
    ERR_SELF_SIGNED_CERT_GENERATION_FAILED = -713,
    ERR_CERT_DATABASE_CHANGED = -714,
    ERR_CERT_VERIFIER_CHANGED = -716,
    ERR_DNS_MALFORMED_RESPONSE = -800,
    ERR_DNS_SERVER_REQUIRES_TCP = -801,
    ERR_DNS_SERVER_FAILED = -802,
    ERR_DNS_TIMED_OUT = -803,
    ERR_DNS_CACHE_MISS = -804,
    ERR_DNS_SEARCH_EMPTY = -805,
    ERR_DNS_SORT_ERROR = -806,
    ERR_DNS_SECURE_RESOLVER_HOSTNAME_RESOLUTION_FAILED = -808,
    ERR_DNS_NAME_HTTPS_ONLY = -809,
    ERR_DNS_REQUEST_CANCELLED = -810,
    ERR_DNS_NO_MATCHING_SUPPORTED_ALPN = -811,
    ERR_DNS_SECURE_PROBE_RECORD_INVALID = -814,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported certificate status code values. See net\\cert\\cert_status_flags.h\n for more information. CERT_STATUS_NONE is new in CEF because we use an\n enum while cert_status_flags.h uses a typedef and static const variables.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_cert_status_t {
    CERT_STATUS_NONE = 0,
    CERT_STATUS_COMMON_NAME_INVALID = 1,
    CERT_STATUS_DATE_INVALID = 2,
    CERT_STATUS_AUTHORITY_INVALID = 4,
    CERT_STATUS_NO_REVOCATION_MECHANISM = 16,
    CERT_STATUS_UNABLE_TO_CHECK_REVOCATION = 32,
    CERT_STATUS_REVOKED = 64,
    CERT_STATUS_INVALID = 128,
    CERT_STATUS_WEAK_SIGNATURE_ALGORITHM = 256,
    CERT_STATUS_NON_UNIQUE_NAME = 1024,
    CERT_STATUS_WEAK_KEY = 2048,
    CERT_STATUS_PINNED_KEY_MISSING = 8192,
    CERT_STATUS_NAME_CONSTRAINT_VIOLATION = 16384,
    CERT_STATUS_VALIDITY_TOO_LONG = 32768,
    CERT_STATUS_IS_EV = 65536,
    CERT_STATUS_REV_CHECKING_ENABLED = 131072,
    CERT_STATUS_SHA1_SIGNATURE_PRESENT = 524288,
    CERT_STATUS_CT_COMPLIANCE_FAILED = 1048576,
}
impl cef_resultcode_t {
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_INTEGRITY: cef_resultcode_t =
        cef_resultcode_t::CEF_RESULT_CODE_SANDBOX_FATAL_FIRST;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Process result codes. This is not a comprehensive list, as result codes\n might also include platform-specific crash values (Posix signal or Windows\n hardware exception), or internal-only implementation values.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_resultcode_t {
    CEF_RESULT_CODE_NORMAL_EXIT = 0,
    #[doc = " Process was killed by user or system."]
    CEF_RESULT_CODE_KILLED = 1,
    #[doc = " Process hung."]
    CEF_RESULT_CODE_HUNG = 2,
    #[doc = " A bad message caused the process termination."]
    CEF_RESULT_CODE_KILLED_BAD_MESSAGE = 3,
    #[doc = " The GPU process exited because initialization failed."]
    CEF_RESULT_CODE_GPU_DEAD_ON_ARRIVAL = 4,
    #[doc = " The GPU process exited because initialization failed."]
    CEF_RESULT_CODE_CHROME_FIRST = 5,
    #[doc = " A critical chrome file is missing."]
    CEF_RESULT_CODE_MISSING_DATA = 7,
    #[doc = " Command line parameter is not supported."]
    CEF_RESULT_CODE_UNSUPPORTED_PARAM = 13,
    #[doc = " The profile was in use on another host."]
    CEF_RESULT_CODE_PROFILE_IN_USE = 21,
    #[doc = " Failed to pack an extension via the command line."]
    CEF_RESULT_CODE_PACK_EXTENSION_ERROR = 22,
    #[doc = " The browser process exited early by passing the command line to another\n running browser."]
    CEF_RESULT_CODE_NORMAL_EXIT_PROCESS_NOTIFIED = 24,
    #[doc = " A browser process was sandboxed. This should never happen."]
    CEF_RESULT_CODE_INVALID_SANDBOX_STATE = 31,
    #[doc = " Cloud policy enrollment failed or was given up by user."]
    CEF_RESULT_CODE_CLOUD_POLICY_ENROLLMENT_FAILED = 32,
    #[doc = " The GPU process was terminated due to context lost."]
    CEF_RESULT_CODE_GPU_EXIT_ON_CONTEXT_LOST = 34,
    #[doc = " An early startup command was executed and the browser must exit."]
    CEF_RESULT_CODE_NORMAL_EXIT_PACK_EXTENSION_SUCCESS = 36,
    #[doc = " The browser process exited because system resources are exhausted. The\n system state can't be recovered and will be unstable."]
    CEF_RESULT_CODE_SYSTEM_RESOURCE_EXHAUSTED = 37,
    #[doc = " The browser process exited because system resources are exhausted. The\n system state can't be recovered and will be unstable."]
    CEF_RESULT_CODE_CHROME_LAST = 38,
    #[doc = " The browser process exited because system resources are exhausted. The\n system state can't be recovered and will be unstable."]
    CEF_RESULT_CODE_SANDBOX_FATAL_FIRST = 7006,
    #[doc = " Windows sandbox could not lower the token."]
    CEF_RESULT_CODE_SANDBOX_FATAL_DROPTOKEN = 7007,
    #[doc = " Windows sandbox failed to flush registry handles."]
    CEF_RESULT_CODE_SANDBOX_FATAL_FLUSHANDLES = 7008,
    #[doc = " Windows sandbox failed to forbid HCKU caching."]
    CEF_RESULT_CODE_SANDBOX_FATAL_CACHEDISABLE = 7009,
    #[doc = " Windows sandbox failed to close pending handles."]
    CEF_RESULT_CODE_SANDBOX_FATAL_CLOSEHANDLES = 7010,
    #[doc = " Windows sandbox could not set the mitigation policy."]
    CEF_RESULT_CODE_SANDBOX_FATAL_MITIGATION = 7011,
    #[doc = " Windows sandbox exceeded the job memory limit."]
    CEF_RESULT_CODE_SANDBOX_FATAL_MEMORY_EXCEEDED = 7012,
    #[doc = " Windows sandbox failed to warmup."]
    CEF_RESULT_CODE_SANDBOX_FATAL_WARMUP = 7013,
    #[doc = " Windows sandbox failed to warmup."]
    CEF_RESULT_CODE_SANDBOX_FATAL_BROKER_SHUTDOWN_HUNG = 7014,
    #[doc = " Windows sandbox failed to warmup."]
    CEF_RESULT_CODE_SANDBOX_FATAL_LAST = 7015,
}
impl cef_window_open_disposition_t {
    pub const CEF_WOD_MAX_VALUE: cef_window_open_disposition_t =
        cef_window_open_disposition_t::CEF_WOD_NEW_PICTURE_IN_PICTURE;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n The manner in which a link click should be opened. These constants match\n their equivalents in Chromium's window_open_disposition.h and should not be\n renumbered.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_window_open_disposition_t {
    CEF_WOD_UNKNOWN = 0,
    #[doc = "\n Current tab. This is the default in most cases.\n"]
    CEF_WOD_CURRENT_TAB = 1,
    #[doc = "\n Indicates that only one tab with the url should exist in the same window.\n"]
    CEF_WOD_SINGLETON_TAB = 2,
    #[doc = "\n Shift key + Middle mouse button or meta/ctrl key while clicking.\n"]
    CEF_WOD_NEW_FOREGROUND_TAB = 3,
    #[doc = "\n Middle mouse button or meta/ctrl key while clicking.\n"]
    CEF_WOD_NEW_BACKGROUND_TAB = 4,
    #[doc = "\n New popup window.\n"]
    CEF_WOD_NEW_POPUP = 5,
    #[doc = "\n Shift key while clicking.\n"]
    CEF_WOD_NEW_WINDOW = 6,
    #[doc = "\n Alt key while clicking.\n"]
    CEF_WOD_SAVE_TO_DISK = 7,
    #[doc = "\n New off-the-record (incognito) window.\n"]
    CEF_WOD_OFF_THE_RECORD = 8,
    #[doc = "\n Special case error condition from the renderer.\n"]
    CEF_WOD_IGNORE_ACTION = 9,
    #[doc = "\n Activates an existing tab containing the url, rather than navigating.\n This is similar to SINGLETON_TAB, but searches across all windows from\n the current profile and anonymity (instead of just the current one);\n closes the current tab on switching if the current tab was the NTP with\n no session history; and behaves like CURRENT_TAB instead of\n NEW_FOREGROUND_TAB when no existing tab is found.\n"]
    CEF_WOD_SWITCH_TO_TAB = 10,
    #[doc = "\n Creates a new document picture-in-picture window showing a child WebView.\n"]
    CEF_WOD_NEW_PICTURE_IN_PICTURE = 11,
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_NONE: cef_drag_operations_mask_t = cef_drag_operations_mask_t(0);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_COPY: cef_drag_operations_mask_t = cef_drag_operations_mask_t(1);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_LINK: cef_drag_operations_mask_t = cef_drag_operations_mask_t(2);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_GENERIC: cef_drag_operations_mask_t = cef_drag_operations_mask_t(4);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_PRIVATE: cef_drag_operations_mask_t = cef_drag_operations_mask_t(8);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_MOVE: cef_drag_operations_mask_t = cef_drag_operations_mask_t(16);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_DELETE: cef_drag_operations_mask_t = cef_drag_operations_mask_t(32);
}
impl cef_drag_operations_mask_t {
    pub const DRAG_OPERATION_EVERY: cef_drag_operations_mask_t =
        cef_drag_operations_mask_t(4294967295);
}
impl ::std::ops::BitOr<cef_drag_operations_mask_t> for cef_drag_operations_mask_t {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        cef_drag_operations_mask_t(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for cef_drag_operations_mask_t {
    #[inline]
    fn bitor_assign(&mut self, rhs: cef_drag_operations_mask_t) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<cef_drag_operations_mask_t> for cef_drag_operations_mask_t {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        cef_drag_operations_mask_t(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for cef_drag_operations_mask_t {
    #[inline]
    fn bitand_assign(&mut self, rhs: cef_drag_operations_mask_t) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[doc = "\n \"Verb\" of a drag-and-drop operation as negotiated between the source and\n destination. These constants match their equivalents in WebCore's\n DragActions.h and should not be renumbered.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct cef_drag_operations_mask_t(pub ::std::os::raw::c_uint);
impl cef_text_input_mode_t {
    pub const CEF_TEXT_INPUT_MODE_MAX: cef_text_input_mode_t =
        cef_text_input_mode_t::CEF_TEXT_INPUT_MODE_SEARCH;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Input mode of a virtual keyboard. These constants match their equivalents\n in Chromium's text_input_mode.h and should not be renumbered.\n See https://html.spec.whatwg.org/#input-modalities:-the-inputmode-attribute\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_text_input_mode_t {
    CEF_TEXT_INPUT_MODE_DEFAULT = 0,
    CEF_TEXT_INPUT_MODE_NONE = 1,
    CEF_TEXT_INPUT_MODE_TEXT = 2,
    CEF_TEXT_INPUT_MODE_TEL = 3,
    CEF_TEXT_INPUT_MODE_URL = 4,
    CEF_TEXT_INPUT_MODE_EMAIL = 5,
    CEF_TEXT_INPUT_MODE_NUMERIC = 6,
    CEF_TEXT_INPUT_MODE_DECIMAL = 7,
    CEF_TEXT_INPUT_MODE_SEARCH = 8,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n V8 property attribute values.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_v8_propertyattribute_t {
    #[doc = "\n Writeable, Enumerable, Configurable\n"]
    V8_PROPERTY_ATTRIBUTE_NONE = 0,
    #[doc = "\n Not writeable\n"]
    V8_PROPERTY_ATTRIBUTE_READONLY = 1,
    #[doc = "\n Not enumerable\n"]
    V8_PROPERTY_ATTRIBUTE_DONTENUM = 2,
    #[doc = "\n Not configurable\n"]
    V8_PROPERTY_ATTRIBUTE_DONTDELETE = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Post data elements may represent either bytes or files.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_postdataelement_type_t {
    PDE_TYPE_EMPTY = 0,
    PDE_TYPE_BYTES = 1,
    PDE_TYPE_FILE = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Resource type for a request. These constants match their equivalents in\n Chromium's ResourceType and should not be renumbered.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_resource_type_t {
    #[doc = "\n Top level page.\n"]
    RT_MAIN_FRAME = 0,
    #[doc = "\n Frame or iframe.\n"]
    RT_SUB_FRAME = 1,
    #[doc = "\n CSS stylesheet.\n"]
    RT_STYLESHEET = 2,
    #[doc = "\n External script.\n"]
    RT_SCRIPT = 3,
    #[doc = "\n Image (jpg/gif/png/etc).\n"]
    RT_IMAGE = 4,
    #[doc = "\n Font.\n"]
    RT_FONT_RESOURCE = 5,
    #[doc = "\n Some other subresource. This is the default type if the actual type is\n unknown.\n"]
    RT_SUB_RESOURCE = 6,
    #[doc = "\n Object (or embed) tag for a plugin, or a resource that a plugin requested.\n"]
    RT_OBJECT = 7,
    #[doc = "\n Media resource.\n"]
    RT_MEDIA = 8,
    #[doc = "\n Main resource of a dedicated worker.\n"]
    RT_WORKER = 9,
    #[doc = "\n Main resource of a shared worker.\n"]
    RT_SHARED_WORKER = 10,
    #[doc = "\n Explicitly requested prefetch.\n"]
    RT_PREFETCH = 11,
    #[doc = "\n Favicon.\n"]
    RT_FAVICON = 12,
    #[doc = "\n XMLHttpRequest.\n"]
    RT_XHR = 13,
    #[doc = "\n A request for a \"<ping>\".\n"]
    RT_PING = 14,
    #[doc = "\n Main resource of a service worker.\n"]
    RT_SERVICE_WORKER = 15,
    #[doc = "\n A report of Content Security Policy violations.\n"]
    RT_CSP_REPORT = 16,
    #[doc = "\n A resource that a plugin requested.\n"]
    RT_PLUGIN_RESOURCE = 17,
    #[doc = "\n A main-frame service worker navigation preload request.\n"]
    RT_NAVIGATION_PRELOAD_MAIN_FRAME = 19,
    #[doc = "\n A sub-frame service worker navigation preload request.\n"]
    RT_NAVIGATION_PRELOAD_SUB_FRAME = 20,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Transition type for a request. Made up of one source value and 0 or more\n qualifiers.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_transition_type_t {
    #[doc = "\n Source is a link click or the JavaScript window.open function. This is\n also the default value for requests like sub-resource loads that are not\n navigations.\n"]
    TT_LINK = 0,
    #[doc = "\n Source is some other \"explicit\" navigation. This is the default value for\n navigations where the actual type is unknown. See also\n TT_DIRECT_LOAD_FLAG.\n"]
    TT_EXPLICIT = 1,
    #[doc = "\n User got to this page through a suggestion in the UI (for example, via the\n destinations page). Chrome style only.\n"]
    TT_AUTO_BOOKMARK = 2,
    #[doc = "\n Source is a subframe navigation. This is any content that is automatically\n loaded in a non-toplevel frame. For example, if a page consists of several\n frames containing ads, those ad URLs will have this transition type.\n The user may not even realize the content in these pages is a separate\n frame, so may not care about the URL.\n"]
    TT_AUTO_SUBFRAME = 3,
    #[doc = "\n Source is a subframe navigation explicitly requested by the user that will\n generate new navigation entries in the back/forward list. These are\n probably more important than frames that were automatically loaded in\n the background because the user probably cares about the fact that this\n link was loaded.\n"]
    TT_MANUAL_SUBFRAME = 4,
    #[doc = "\n User got to this page by typing in the URL bar and selecting an entry\n that did not look like a URL.  For example, a match might have the URL\n of a Google search result page, but appear like \"Search Google for ...\".\n These are not quite the same as EXPLICIT navigations because the user\n didn't type or see the destination URL. Chrome style only.\n See also TT_KEYWORD.\n"]
    TT_GENERATED = 5,
    #[doc = "\n This is a toplevel navigation. This is any content that is automatically\n loaded in a toplevel frame.  For example, opening a tab to show the ASH\n screen saver, opening the devtools window, opening the NTP after the safe\n browsing warning, opening web-based dialog boxes are examples of\n AUTO_TOPLEVEL navigations. Chrome style only.\n"]
    TT_AUTO_TOPLEVEL = 6,
    #[doc = "\n Source is a form submission by the user. NOTE: In some situations\n submitting a form does not result in this transition type. This can happen\n if the form uses a script to submit the contents.\n"]
    TT_FORM_SUBMIT = 7,
    #[doc = "\n Source is a \"reload\" of the page via the Reload function or by re-visiting\n the same URL. NOTE: This is distinct from the concept of whether a\n particular load uses \"reload semantics\" (i.e. bypasses cached data).\n"]
    TT_RELOAD = 8,
    #[doc = "\n The url was generated from a replaceable keyword other than the default\n search provider. If the user types a keyword (which also applies to\n tab-to-search) in the omnibox this qualifier is applied to the transition\n type of the generated url. TemplateURLModel then may generate an\n additional visit with a transition type of TT_KEYWORD_GENERATED against\n the url 'http://' + keyword. For example, if you do a tab-to-search\n against wikipedia the generated url has a transition qualifer of\n TT_KEYWORD, and TemplateURLModel generates a visit for 'wikipedia.org'\n with a transition type of TT_KEYWORD_GENERATED. Chrome style only.\n"]
    TT_KEYWORD = 9,
    #[doc = "\n Corresponds to a visit generated for a keyword. See description of\n TT_KEYWORD for more details. Chrome style only.\n"]
    TT_KEYWORD_GENERATED = 10,
    #[doc = "\n General mask defining the bits used for the source values.\n"]
    TT_SOURCE_MASK = 255,
    #[doc = "\n Attempted to visit a URL but was blocked.\n"]
    TT_BLOCKED_FLAG = 8388608,
    #[doc = "\n Used the Forward or Back function to navigate among browsing history.\n Will be ORed to the transition type for the original load.\n"]
    TT_FORWARD_BACK_FLAG = 16777216,
    #[doc = "\n Loaded a URL directly via CreateBrowser, LoadURL or LoadRequest.\n"]
    TT_DIRECT_LOAD_FLAG = 33554432,
    #[doc = "\n User is navigating to the home page. Chrome style only.\n"]
    TT_HOME_PAGE_FLAG = 67108864,
    #[doc = "\n The transition originated from an external application; the exact\n definition of this is embedder dependent. Chrome style only.\n"]
    TT_FROM_API_FLAG = 134217728,
    #[doc = "\n The beginning of a navigation chain.\n"]
    TT_CHAIN_START_FLAG = 268435456,
    #[doc = "\n The last transition in a redirect chain.\n"]
    TT_CHAIN_END_FLAG = 536870912,
    #[doc = "\n Redirects caused by JavaScript or a meta refresh tag on the page.\n"]
    TT_CLIENT_REDIRECT_FLAG = 1073741824,
    #[doc = "\n Redirects sent from the server by HTTP headers.\n"]
    TT_SERVER_REDIRECT_FLAG = 2147483648,
    #[doc = "\n Used to test whether a transition involves a redirect.\n"]
    TT_IS_REDIRECT_MASK = 3221225472,
    #[doc = "\n General mask defining the bits used for the qualifiers.\n"]
    TT_QUALIFIER_MASK = 4294967040,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Flags used to customize the behavior of CefURLRequest.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_urlrequest_flags_t {
    #[doc = "\n Default behavior.\n"]
    UR_FLAG_NONE = 0,
    #[doc = "\n If set the cache will be skipped when handling the request. Setting this\n value is equivalent to specifying the \"Cache-Control: no-cache\" request\n header. Setting this value in combination with UR_FLAG_ONLY_FROM_CACHE\n will cause the request to fail.\n"]
    UR_FLAG_SKIP_CACHE = 1,
    #[doc = "\n If set the request will fail if it cannot be served from the cache (or\n some equivalent local store). Setting this value is equivalent to\n specifying the \"Cache-Control: only-if-cached\" request header. Setting\n this value in combination with UR_FLAG_SKIP_CACHE or UR_FLAG_DISABLE_CACHE\n will cause the request to fail.\n"]
    UR_FLAG_ONLY_FROM_CACHE = 2,
    #[doc = "\n If set the cache will not be used at all. Setting this value is equivalent\n to specifying the \"Cache-Control: no-store\" request header. Setting this\n value in combination with UR_FLAG_ONLY_FROM_CACHE will cause the request\n to fail.\n"]
    UR_FLAG_DISABLE_CACHE = 4,
    #[doc = "\n If set user name, password, and cookies may be sent with the request, and\n cookies may be saved from the response.\n"]
    UR_FLAG_ALLOW_STORED_CREDENTIALS = 8,
    #[doc = "\n If set upload progress events will be generated when a request has a body.\n"]
    UR_FLAG_REPORT_UPLOAD_PROGRESS = 16,
    #[doc = "\n If set the CefURLRequestClient::OnDownloadData method will not be called.\n"]
    UR_FLAG_NO_DOWNLOAD_DATA = 32,
    #[doc = "\n If set 5XX redirect errors will be propagated to the observer instead of\n automatically re-tried. This currently only applies for requests\n originated in the browser process.\n"]
    UR_FLAG_NO_RETRY_ON_5XX = 64,
    #[doc = "\n If set 3XX responses will cause the fetch to halt immediately rather than\n continue through the redirect.\n"]
    UR_FLAG_STOP_ON_REDIRECT = 128,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Flags that represent CefURLRequest status.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_urlrequest_status_t {
    #[doc = "\n Unknown status.\n"]
    UR_UNKNOWN = 0,
    #[doc = "\n Request succeeded.\n"]
    UR_SUCCESS = 1,
    #[doc = "\n An IO request is pending, and the caller will be informed when it is\n completed.\n"]
    UR_IO_PENDING = 2,
    #[doc = "\n Request was canceled programatically.\n"]
    UR_CANCELED = 3,
    #[doc = "\n Request failed for some reason.\n"]
    UR_FAILED = 4,
}
#[doc = " Structure representing a draggable region.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_draggable_region_t {
    #[doc = "\n Bounds of the region.\n"]
    pub bounds: cef_rect_t,
    #[doc = "\n True (1) this this region is draggable and false (0) otherwise.\n"]
    pub draggable: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_draggable_region_t"][::std::mem::size_of::<_cef_draggable_region_t>() - 20usize];
    ["Alignment of _cef_draggable_region_t"]
        [::std::mem::align_of::<_cef_draggable_region_t>() - 4usize];
    ["Offset of field: _cef_draggable_region_t::bounds"]
        [::std::mem::offset_of!(_cef_draggable_region_t, bounds) - 0usize];
    ["Offset of field: _cef_draggable_region_t::draggable"]
        [::std::mem::offset_of!(_cef_draggable_region_t, draggable) - 16usize];
};
#[doc = " Structure representing a draggable region.\n"]
pub type cef_draggable_region_t = _cef_draggable_region_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Existing process IDs.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_process_id_t {
    #[doc = "\n Browser process.\n"]
    PID_BROWSER = 0,
    #[doc = "\n Renderer process.\n"]
    PID_RENDERER = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Existing thread IDs.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_thread_id_t {
    #[doc = "\n The main thread in the browser. This will be the same as the main\n application thread if CefInitialize() is called with a\n CefSettings.multi_threaded_message_loop value of false. Do not perform\n blocking tasks on this thread. All tasks posted after\n CefBrowserProcessHandler::OnContextInitialized() and before CefShutdown()\n are guaranteed to run. This thread will outlive all other CEF threads.\n"]
    TID_UI = 0,
    #[doc = "\n Used for blocking tasks like file system access where the user won't\n notice if the task takes an arbitrarily long time to complete. All tasks\n posted after CefBrowserProcessHandler::OnContextInitialized() and before\n CefShutdown() are guaranteed to run.\n"]
    TID_FILE_BACKGROUND = 1,
    #[doc = "\n Used for blocking tasks like file system access that affect UI or\n responsiveness of future user interactions. Do not use if an immediate\n response to a user interaction is expected. All tasks posted after\n CefBrowserProcessHandler::OnContextInitialized() and before CefShutdown()\n are guaranteed to run.\n Examples:\n - Updating the UI to reflect progress on a long task.\n - Loading data that might be shown in the UI after a future user\n   interaction.\n"]
    TID_FILE_USER_VISIBLE = 2,
    #[doc = "\n Used for blocking tasks like file system access that affect UI\n immediately after a user interaction. All tasks posted after\n CefBrowserProcessHandler::OnContextInitialized() and before CefShutdown()\n are guaranteed to run.\n Example: Generating data shown in the UI immediately after a click.\n"]
    TID_FILE_USER_BLOCKING = 3,
    #[doc = "\n Used to launch and terminate browser processes.\n"]
    TID_PROCESS_LAUNCHER = 4,
    #[doc = "\n Used to process IPC and network messages. Do not perform blocking tasks on\n this thread. All tasks posted after\n CefBrowserProcessHandler::OnContextInitialized() and before CefShutdown()\n are guaranteed to run.\n"]
    TID_IO = 5,
    #[doc = "\n The main thread in the renderer. Used for all WebKit and V8 interaction.\n Tasks may be posted to this thread after\n CefRenderProcessHandler::OnWebKitInitialized but are not guaranteed to\n run before sub-process termination (sub-processes may be killed at any\n time without warning).\n"]
    TID_RENDERER = 6,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Thread priority values listed in increasing order of importance.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_thread_priority_t {
    #[doc = "\n Suitable for threads that shouldn't disrupt high priority work.\n"]
    TP_BACKGROUND = 0,
    #[doc = "\n Default priority level.\n"]
    TP_NORMAL = 1,
    #[doc = "\n Suitable for threads which generate data for the display (at ~60Hz).\n"]
    TP_DISPLAY = 2,
    #[doc = "\n Suitable for low-latency, glitch-resistant audio.\n"]
    TP_REALTIME_AUDIO = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Message loop types. Indicates the set of asynchronous events that a message\n loop can process.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_message_loop_type_t {
    #[doc = "\n Supports tasks and timers.\n"]
    ML_TYPE_DEFAULT = 0,
    #[doc = "\n Supports tasks, timers and native UI events (e.g. Windows messages).\n"]
    ML_TYPE_UI = 1,
    #[doc = "\n Supports tasks, timers and asynchronous IO events.\n"]
    ML_TYPE_IO = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Windows COM initialization mode. Specifies how COM will be initialized for a\n new thread.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_com_init_mode_t {
    #[doc = "\n No COM initialization.\n"]
    COM_INIT_MODE_NONE = 0,
    #[doc = "\n Initialize COM using single-threaded apartments.\n"]
    COM_INIT_MODE_STA = 1,
    #[doc = "\n Initialize COM using multi-threaded apartments.\n"]
    COM_INIT_MODE_MTA = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported value types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_value_type_t {
    VTYPE_INVALID = 0,
    VTYPE_NULL = 1,
    VTYPE_BOOL = 2,
    VTYPE_INT = 3,
    VTYPE_DOUBLE = 4,
    VTYPE_STRING = 5,
    VTYPE_BINARY = 6,
    VTYPE_DICTIONARY = 7,
    VTYPE_LIST = 8,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported JavaScript dialog types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_jsdialog_type_t {
    JSDIALOGTYPE_ALERT = 0,
    JSDIALOGTYPE_CONFIRM = 1,
    JSDIALOGTYPE_PROMPT = 2,
}
#[doc = "\n Screen information used when window rendering is disabled. This structure is\n passed as a parameter to CefRenderHandler::GetScreenInfo and should be\n filled in by the client.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_screen_info_t {
    #[doc = "\n Device scale factor. Specifies the ratio between physical and logical\n pixels.\n"]
    pub device_scale_factor: f32,
    #[doc = "\n The screen depth in bits per pixel.\n"]
    pub depth: ::std::os::raw::c_int,
    #[doc = "\n The bits per color component. This assumes that the colors are balanced\n equally.\n"]
    pub depth_per_component: ::std::os::raw::c_int,
    #[doc = "\n This can be true for black and white printers.\n"]
    pub is_monochrome: ::std::os::raw::c_int,
    #[doc = " The |rect| and |available_rect| properties are used to determine the\n available surface for rendering popup views.\n"]
    pub rect: cef_rect_t,
    #[doc = " The |rect| and |available_rect| properties are used to determine the\n available surface for rendering popup views.\n"]
    pub available_rect: cef_rect_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_screen_info_t"][::std::mem::size_of::<_cef_screen_info_t>() - 48usize];
    ["Alignment of _cef_screen_info_t"][::std::mem::align_of::<_cef_screen_info_t>() - 4usize];
    ["Offset of field: _cef_screen_info_t::device_scale_factor"]
        [::std::mem::offset_of!(_cef_screen_info_t, device_scale_factor) - 0usize];
    ["Offset of field: _cef_screen_info_t::depth"]
        [::std::mem::offset_of!(_cef_screen_info_t, depth) - 4usize];
    ["Offset of field: _cef_screen_info_t::depth_per_component"]
        [::std::mem::offset_of!(_cef_screen_info_t, depth_per_component) - 8usize];
    ["Offset of field: _cef_screen_info_t::is_monochrome"]
        [::std::mem::offset_of!(_cef_screen_info_t, is_monochrome) - 12usize];
    ["Offset of field: _cef_screen_info_t::rect"]
        [::std::mem::offset_of!(_cef_screen_info_t, rect) - 16usize];
    ["Offset of field: _cef_screen_info_t::available_rect"]
        [::std::mem::offset_of!(_cef_screen_info_t, available_rect) - 32usize];
};
#[doc = "\n Screen information used when window rendering is disabled. This structure is\n passed as a parameter to CefRenderHandler::GetScreenInfo and should be\n filled in by the client.\n"]
pub type cef_screen_info_t = _cef_screen_info_t;
#[doc = "\n Linux window properties, such as X11's WM_CLASS or Wayland's app_id.\n Those are passed to CefWindowDelegate, so the client can set them\n for the CefWindow's top-level. Thus, allowing window managers to correctly\n display the application's information (e.g., icons).\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_linux_window_properties_t {
    #[doc = "\n Main window's Wayland's app_id\n"]
    pub wayland_app_id: cef_string_t,
    #[doc = "\n Main window's WM_CLASS_CLASS in X11\n"]
    pub wm_class_class: cef_string_t,
    #[doc = "\n Main window's WM_CLASS_NAME in X11\n"]
    pub wm_class_name: cef_string_t,
    #[doc = "\n Main window's WM_WINDOW_ROLE in X11\n"]
    pub wm_role_name: cef_string_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_linux_window_properties_t"]
        [::std::mem::size_of::<_cef_linux_window_properties_t>() - 96usize];
    ["Alignment of _cef_linux_window_properties_t"]
        [::std::mem::align_of::<_cef_linux_window_properties_t>() - 8usize];
    ["Offset of field: _cef_linux_window_properties_t::wayland_app_id"]
        [::std::mem::offset_of!(_cef_linux_window_properties_t, wayland_app_id) - 0usize];
    ["Offset of field: _cef_linux_window_properties_t::wm_class_class"]
        [::std::mem::offset_of!(_cef_linux_window_properties_t, wm_class_class) - 24usize];
    ["Offset of field: _cef_linux_window_properties_t::wm_class_name"]
        [::std::mem::offset_of!(_cef_linux_window_properties_t, wm_class_name) - 48usize];
    ["Offset of field: _cef_linux_window_properties_t::wm_role_name"]
        [::std::mem::offset_of!(_cef_linux_window_properties_t, wm_role_name) - 72usize];
};
#[doc = "\n Linux window properties, such as X11's WM_CLASS or Wayland's app_id.\n Those are passed to CefWindowDelegate, so the client can set them\n for the CefWindow's top-level. Thus, allowing window managers to correctly\n display the application's information (e.g., icons).\n"]
pub type cef_linux_window_properties_t = _cef_linux_window_properties_t;
impl cef_menu_id_t {
    pub const MENU_ID_SPELLCHECK_SUGGESTION_LAST: cef_menu_id_t =
        cef_menu_id_t::MENU_ID_SPELLCHECK_SUGGESTION_4;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported menu IDs. Non-English translations can be provided for the\n IDS_MENU_* strings in CefResourceBundleHandler::GetLocalizedString().\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_menu_id_t {
    MENU_ID_BACK = 100,
    MENU_ID_FORWARD = 101,
    MENU_ID_RELOAD = 102,
    MENU_ID_RELOAD_NOCACHE = 103,
    MENU_ID_STOPLOAD = 104,
    MENU_ID_UNDO = 110,
    MENU_ID_REDO = 111,
    MENU_ID_CUT = 112,
    MENU_ID_COPY = 113,
    MENU_ID_PASTE = 114,
    MENU_ID_PASTE_MATCH_STYLE = 115,
    MENU_ID_DELETE = 116,
    MENU_ID_SELECT_ALL = 117,
    MENU_ID_FIND = 130,
    MENU_ID_PRINT = 131,
    MENU_ID_VIEW_SOURCE = 132,
    MENU_ID_SPELLCHECK_SUGGESTION_0 = 200,
    MENU_ID_SPELLCHECK_SUGGESTION_1 = 201,
    MENU_ID_SPELLCHECK_SUGGESTION_2 = 202,
    MENU_ID_SPELLCHECK_SUGGESTION_3 = 203,
    MENU_ID_SPELLCHECK_SUGGESTION_4 = 204,
    MENU_ID_NO_SPELLING_SUGGESTIONS = 205,
    MENU_ID_ADD_TO_DICTIONARY = 206,
    MENU_ID_CUSTOM_FIRST = 220,
    MENU_ID_CUSTOM_LAST = 250,
    MENU_ID_USER_FIRST = 26500,
    MENU_ID_USER_LAST = 28500,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Mouse button types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_mouse_button_type_t {
    MBT_LEFT = 0,
    MBT_MIDDLE = 1,
    MBT_RIGHT = 2,
}
#[doc = "\n Structure representing mouse event information.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_mouse_event_t {
    #[doc = "\n X coordinate relative to the left side of the view.\n"]
    pub x: ::std::os::raw::c_int,
    #[doc = "\n Y coordinate relative to the top side of the view.\n"]
    pub y: ::std::os::raw::c_int,
    #[doc = "\n Bit flags describing any pressed modifier keys. See\n cef_event_flags_t for values.\n"]
    pub modifiers: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_mouse_event_t"][::std::mem::size_of::<_cef_mouse_event_t>() - 12usize];
    ["Alignment of _cef_mouse_event_t"][::std::mem::align_of::<_cef_mouse_event_t>() - 4usize];
    ["Offset of field: _cef_mouse_event_t::x"]
        [::std::mem::offset_of!(_cef_mouse_event_t, x) - 0usize];
    ["Offset of field: _cef_mouse_event_t::y"]
        [::std::mem::offset_of!(_cef_mouse_event_t, y) - 4usize];
    ["Offset of field: _cef_mouse_event_t::modifiers"]
        [::std::mem::offset_of!(_cef_mouse_event_t, modifiers) - 8usize];
};
#[doc = "\n Structure representing mouse event information.\n"]
pub type cef_mouse_event_t = _cef_mouse_event_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Touch points states types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_touch_event_type_t {
    CEF_TET_RELEASED = 0,
    CEF_TET_PRESSED = 1,
    CEF_TET_MOVED = 2,
    CEF_TET_CANCELLED = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n The device type that caused the event.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_pointer_type_t {
    CEF_POINTER_TYPE_TOUCH = 0,
    CEF_POINTER_TYPE_MOUSE = 1,
    CEF_POINTER_TYPE_PEN = 2,
    CEF_POINTER_TYPE_ERASER = 3,
    CEF_POINTER_TYPE_UNKNOWN = 4,
}
#[doc = "\n Structure representing touch event information.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_touch_event_t {
    #[doc = "\n Id of a touch point. Must be unique per touch, can be any number except\n -1. Note that a maximum of 16 concurrent touches will be tracked; touches\n beyond that will be ignored.\n"]
    pub id: ::std::os::raw::c_int,
    #[doc = "\n X coordinate relative to the left side of the view.\n"]
    pub x: f32,
    #[doc = "\n Y coordinate relative to the top side of the view.\n"]
    pub y: f32,
    #[doc = "\n X radius in pixels. Set to 0 if not applicable.\n"]
    pub radius_x: f32,
    #[doc = "\n Y radius in pixels. Set to 0 if not applicable.\n"]
    pub radius_y: f32,
    #[doc = "\n Rotation angle in radians. Set to 0 if not applicable.\n"]
    pub rotation_angle: f32,
    #[doc = "\n The normalized pressure of the pointer input in the range of [0,1].\n Set to 0 if not applicable.\n"]
    pub pressure: f32,
    #[doc = "\n The state of the touch point. Touches begin with one CEF_TET_PRESSED event\n followed by zero or more CEF_TET_MOVED events and finally one\n CEF_TET_RELEASED or CEF_TET_CANCELLED event. Events not respecting this\n order will be ignored.\n"]
    pub type_: cef_touch_event_type_t,
    #[doc = "\n Bit flags describing any pressed modifier keys. See\n cef_event_flags_t for values.\n"]
    pub modifiers: u32,
    #[doc = "\n The device type that caused the event.\n"]
    pub pointer_type: cef_pointer_type_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_touch_event_t"][::std::mem::size_of::<_cef_touch_event_t>() - 40usize];
    ["Alignment of _cef_touch_event_t"][::std::mem::align_of::<_cef_touch_event_t>() - 4usize];
    ["Offset of field: _cef_touch_event_t::id"]
        [::std::mem::offset_of!(_cef_touch_event_t, id) - 0usize];
    ["Offset of field: _cef_touch_event_t::x"]
        [::std::mem::offset_of!(_cef_touch_event_t, x) - 4usize];
    ["Offset of field: _cef_touch_event_t::y"]
        [::std::mem::offset_of!(_cef_touch_event_t, y) - 8usize];
    ["Offset of field: _cef_touch_event_t::radius_x"]
        [::std::mem::offset_of!(_cef_touch_event_t, radius_x) - 12usize];
    ["Offset of field: _cef_touch_event_t::radius_y"]
        [::std::mem::offset_of!(_cef_touch_event_t, radius_y) - 16usize];
    ["Offset of field: _cef_touch_event_t::rotation_angle"]
        [::std::mem::offset_of!(_cef_touch_event_t, rotation_angle) - 20usize];
    ["Offset of field: _cef_touch_event_t::pressure"]
        [::std::mem::offset_of!(_cef_touch_event_t, pressure) - 24usize];
    ["Offset of field: _cef_touch_event_t::type_"]
        [::std::mem::offset_of!(_cef_touch_event_t, type_) - 28usize];
    ["Offset of field: _cef_touch_event_t::modifiers"]
        [::std::mem::offset_of!(_cef_touch_event_t, modifiers) - 32usize];
    ["Offset of field: _cef_touch_event_t::pointer_type"]
        [::std::mem::offset_of!(_cef_touch_event_t, pointer_type) - 36usize];
};
#[doc = "\n Structure representing touch event information.\n"]
pub type cef_touch_event_t = _cef_touch_event_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Paint element types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_paint_element_type_t {
    PET_VIEW = 0,
    PET_POPUP = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported event bit flags.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_event_flags_t {
    EVENTFLAG_NONE = 0,
    EVENTFLAG_CAPS_LOCK_ON = 1,
    EVENTFLAG_SHIFT_DOWN = 2,
    EVENTFLAG_CONTROL_DOWN = 4,
    EVENTFLAG_ALT_DOWN = 8,
    EVENTFLAG_LEFT_MOUSE_BUTTON = 16,
    EVENTFLAG_MIDDLE_MOUSE_BUTTON = 32,
    EVENTFLAG_RIGHT_MOUSE_BUTTON = 64,
    #[doc = " Mac OS-X command key."]
    EVENTFLAG_COMMAND_DOWN = 128,
    #[doc = " Mac OS-X command key."]
    EVENTFLAG_NUM_LOCK_ON = 256,
    #[doc = " Mac OS-X command key."]
    EVENTFLAG_IS_KEY_PAD = 512,
    #[doc = " Mac OS-X command key."]
    EVENTFLAG_IS_LEFT = 1024,
    #[doc = " Mac OS-X command key."]
    EVENTFLAG_IS_RIGHT = 2048,
    #[doc = " Mac OS-X command key."]
    EVENTFLAG_ALTGR_DOWN = 4096,
    #[doc = " Mac OS-X command key."]
    EVENTFLAG_IS_REPEAT = 8192,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported menu item types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_menu_item_type_t {
    MENUITEMTYPE_NONE = 0,
    MENUITEMTYPE_COMMAND = 1,
    MENUITEMTYPE_CHECK = 2,
    MENUITEMTYPE_RADIO = 3,
    MENUITEMTYPE_SEPARATOR = 4,
    MENUITEMTYPE_SUBMENU = 5,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported context menu type flags.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_context_menu_type_flags_t {
    #[doc = "\n No node is selected.\n"]
    CM_TYPEFLAG_NONE = 0,
    #[doc = "\n The top page is selected.\n"]
    CM_TYPEFLAG_PAGE = 1,
    #[doc = "\n A subframe page is selected.\n"]
    CM_TYPEFLAG_FRAME = 2,
    #[doc = "\n A link is selected.\n"]
    CM_TYPEFLAG_LINK = 4,
    #[doc = "\n A media node is selected.\n"]
    CM_TYPEFLAG_MEDIA = 8,
    #[doc = "\n There is a textual or mixed selection that is selected.\n"]
    CM_TYPEFLAG_SELECTION = 16,
    #[doc = "\n An editable element is selected.\n"]
    CM_TYPEFLAG_EDITABLE = 32,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported context menu media types. These constants match their equivalents\n in Chromium's ContextMenuDataMediaType and should not be renumbered.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_context_menu_media_type_t {
    #[doc = "\n No special node is in context.\n"]
    CM_MEDIATYPE_NONE = 0,
    #[doc = "\n An image node is selected.\n"]
    CM_MEDIATYPE_IMAGE = 1,
    #[doc = "\n A video node is selected.\n"]
    CM_MEDIATYPE_VIDEO = 2,
    #[doc = "\n An audio node is selected.\n"]
    CM_MEDIATYPE_AUDIO = 3,
    #[doc = "\n An canvas node is selected.\n"]
    CM_MEDIATYPE_CANVAS = 4,
    #[doc = "\n A file node is selected.\n"]
    CM_MEDIATYPE_FILE = 5,
    #[doc = "\n A plugin node is selected.\n"]
    CM_MEDIATYPE_PLUGIN = 6,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported context menu media state bit flags. These constants match their\n equivalents in Chromium's ContextMenuData::MediaFlags and should not be\n renumbered.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_context_menu_media_state_flags_t {
    CM_MEDIAFLAG_NONE = 0,
    CM_MEDIAFLAG_IN_ERROR = 1,
    CM_MEDIAFLAG_PAUSED = 2,
    CM_MEDIAFLAG_MUTED = 4,
    CM_MEDIAFLAG_LOOP = 8,
    CM_MEDIAFLAG_CAN_SAVE = 16,
    CM_MEDIAFLAG_HAS_AUDIO = 32,
    CM_MEDIAFLAG_CAN_TOGGLE_CONTROLS = 64,
    CM_MEDIAFLAG_CONTROLS = 128,
    CM_MEDIAFLAG_CAN_PRINT = 256,
    CM_MEDIAFLAG_CAN_ROTATE = 512,
    CM_MEDIAFLAG_CAN_PICTURE_IN_PICTURE = 1024,
    CM_MEDIAFLAG_PICTURE_IN_PICTURE = 2048,
    CM_MEDIAFLAG_CAN_LOOP = 4096,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported context menu edit state bit flags. These constants match their\n equivalents in Chromium's ContextMenuDataEditFlags and should not be\n renumbered.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_context_menu_edit_state_flags_t {
    CM_EDITFLAG_NONE = 0,
    CM_EDITFLAG_CAN_UNDO = 1,
    CM_EDITFLAG_CAN_REDO = 2,
    CM_EDITFLAG_CAN_CUT = 4,
    CM_EDITFLAG_CAN_COPY = 8,
    CM_EDITFLAG_CAN_PASTE = 16,
    CM_EDITFLAG_CAN_DELETE = 32,
    CM_EDITFLAG_CAN_SELECT_ALL = 64,
    CM_EDITFLAG_CAN_TRANSLATE = 128,
    CM_EDITFLAG_CAN_EDIT_RICHLY = 256,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported quick menu state bit flags.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_quick_menu_edit_state_flags_t {
    QM_EDITFLAG_NONE = 0,
    QM_EDITFLAG_CAN_ELLIPSIS = 1,
    QM_EDITFLAG_CAN_CUT = 2,
    QM_EDITFLAG_CAN_COPY = 4,
    QM_EDITFLAG_CAN_PASTE = 8,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Key event types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_key_event_type_t {
    #[doc = "\n Notification that a key transitioned from \"up\" to \"down\".\n"]
    KEYEVENT_RAWKEYDOWN = 0,
    #[doc = "\n Notification that a key was pressed. This does not necessarily correspond\n to a character depending on the key and language. Use KEYEVENT_CHAR for\n character input.\n"]
    KEYEVENT_KEYDOWN = 1,
    #[doc = "\n Notification that a key was released.\n"]
    KEYEVENT_KEYUP = 2,
    #[doc = "\n Notification that a character was typed. Use this for text input. Key\n down events may generate 0, 1, or more than one character event depending\n on the key, locale, and operating system.\n"]
    KEYEVENT_CHAR = 3,
}
#[doc = "\n Structure representing keyboard event information.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_key_event_t {
    #[doc = "\n The type of keyboard event.\n"]
    pub type_: cef_key_event_type_t,
    #[doc = "\n Bit flags describing any pressed modifier keys. See\n cef_event_flags_t for values.\n"]
    pub modifiers: u32,
    #[doc = "\n The Windows key code for the key event. This value is used by the DOM\n specification. Sometimes it comes directly from the event (i.e. on\n Windows) and sometimes it's determined using a mapping function. See\n WebCore/platform/chromium/KeyboardCodes.h for the list of values.\n"]
    pub windows_key_code: ::std::os::raw::c_int,
    #[doc = "\n The actual key code genenerated by the platform.\n"]
    pub native_key_code: ::std::os::raw::c_int,
    #[doc = "\n Indicates whether the event is considered a \"system key\" event (see\n http://msdn.microsoft.com/en-us/library/ms646286(VS.85).aspx for details).\n This value will always be false on non-Windows platforms.\n"]
    pub is_system_key: ::std::os::raw::c_int,
    #[doc = "\n The character generated by the keystroke.\n"]
    pub character: char16_t,
    #[doc = "\n Same as |character| but unmodified by any concurrently-held modifiers\n (except shift). This is useful for working out shortcut keys.\n"]
    pub unmodified_character: char16_t,
    #[doc = "\n True if the focus is currently on an editable field on the page. This is\n useful for determining if standard key events should be intercepted.\n"]
    pub focus_on_editable_field: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_key_event_t"][::std::mem::size_of::<_cef_key_event_t>() - 28usize];
    ["Alignment of _cef_key_event_t"][::std::mem::align_of::<_cef_key_event_t>() - 4usize];
    ["Offset of field: _cef_key_event_t::type_"]
        [::std::mem::offset_of!(_cef_key_event_t, type_) - 0usize];
    ["Offset of field: _cef_key_event_t::modifiers"]
        [::std::mem::offset_of!(_cef_key_event_t, modifiers) - 4usize];
    ["Offset of field: _cef_key_event_t::windows_key_code"]
        [::std::mem::offset_of!(_cef_key_event_t, windows_key_code) - 8usize];
    ["Offset of field: _cef_key_event_t::native_key_code"]
        [::std::mem::offset_of!(_cef_key_event_t, native_key_code) - 12usize];
    ["Offset of field: _cef_key_event_t::is_system_key"]
        [::std::mem::offset_of!(_cef_key_event_t, is_system_key) - 16usize];
    ["Offset of field: _cef_key_event_t::character"]
        [::std::mem::offset_of!(_cef_key_event_t, character) - 20usize];
    ["Offset of field: _cef_key_event_t::unmodified_character"]
        [::std::mem::offset_of!(_cef_key_event_t, unmodified_character) - 22usize];
    ["Offset of field: _cef_key_event_t::focus_on_editable_field"]
        [::std::mem::offset_of!(_cef_key_event_t, focus_on_editable_field) - 24usize];
};
#[doc = "\n Structure representing keyboard event information.\n"]
pub type cef_key_event_t = _cef_key_event_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Focus sources.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_focus_source_t {
    #[doc = "\n The source is explicit navigation via the API (LoadURL(), etc).\n"]
    FOCUS_SOURCE_NAVIGATION = 0,
    #[doc = "\n The source is a system-generated focus event.\n"]
    FOCUS_SOURCE_SYSTEM = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Navigation types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_navigation_type_t {
    NAVIGATION_LINK_CLICKED = 0,
    NAVIGATION_FORM_SUBMITTED = 1,
    NAVIGATION_BACK_FORWARD = 2,
    NAVIGATION_RELOAD = 3,
    NAVIGATION_FORM_RESUBMITTED = 4,
    NAVIGATION_OTHER = 5,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported XML encoding types. The parser supports ASCII, ISO-8859-1, and\n UTF16 (LE and BE) by default. All other types must be translated to UTF8\n before being passed to the parser. If a BOM is detected and the correct\n decoder is available then that decoder will be used automatically.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_xml_encoding_type_t {
    XML_ENCODING_NONE = 0,
    XML_ENCODING_UTF8 = 1,
    XML_ENCODING_UTF16LE = 2,
    XML_ENCODING_UTF16BE = 3,
    XML_ENCODING_ASCII = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n XML node types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_xml_node_type_t {
    XML_NODE_UNSUPPORTED = 0,
    XML_NODE_PROCESSING_INSTRUCTION = 1,
    XML_NODE_DOCUMENT_TYPE = 2,
    XML_NODE_ELEMENT_START = 3,
    XML_NODE_ELEMENT_END = 4,
    XML_NODE_ATTRIBUTE = 5,
    XML_NODE_TEXT = 6,
    XML_NODE_CDATA = 7,
    XML_NODE_ENTITY_REFERENCE = 8,
    XML_NODE_WHITESPACE = 9,
    XML_NODE_COMMENT = 10,
}
#[doc = "\n Popup window features.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_popup_features_t {
    pub x: ::std::os::raw::c_int,
    pub xSet: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub ySet: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub widthSet: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub heightSet: ::std::os::raw::c_int,
    #[doc = " True (1) if browser interface elements should be hidden."]
    pub isPopup: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_popup_features_t"][::std::mem::size_of::<_cef_popup_features_t>() - 36usize];
    ["Alignment of _cef_popup_features_t"]
        [::std::mem::align_of::<_cef_popup_features_t>() - 4usize];
    ["Offset of field: _cef_popup_features_t::x"]
        [::std::mem::offset_of!(_cef_popup_features_t, x) - 0usize];
    ["Offset of field: _cef_popup_features_t::xSet"]
        [::std::mem::offset_of!(_cef_popup_features_t, xSet) - 4usize];
    ["Offset of field: _cef_popup_features_t::y"]
        [::std::mem::offset_of!(_cef_popup_features_t, y) - 8usize];
    ["Offset of field: _cef_popup_features_t::ySet"]
        [::std::mem::offset_of!(_cef_popup_features_t, ySet) - 12usize];
    ["Offset of field: _cef_popup_features_t::width"]
        [::std::mem::offset_of!(_cef_popup_features_t, width) - 16usize];
    ["Offset of field: _cef_popup_features_t::widthSet"]
        [::std::mem::offset_of!(_cef_popup_features_t, widthSet) - 20usize];
    ["Offset of field: _cef_popup_features_t::height"]
        [::std::mem::offset_of!(_cef_popup_features_t, height) - 24usize];
    ["Offset of field: _cef_popup_features_t::heightSet"]
        [::std::mem::offset_of!(_cef_popup_features_t, heightSet) - 28usize];
    ["Offset of field: _cef_popup_features_t::isPopup"]
        [::std::mem::offset_of!(_cef_popup_features_t, isPopup) - 32usize];
};
#[doc = "\n Popup window features.\n"]
pub type cef_popup_features_t = _cef_popup_features_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n DOM document types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_dom_document_type_t {
    DOM_DOCUMENT_TYPE_UNKNOWN = 0,
    DOM_DOCUMENT_TYPE_HTML = 1,
    DOM_DOCUMENT_TYPE_XHTML = 2,
    DOM_DOCUMENT_TYPE_PLUGIN = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n DOM event category flags.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_dom_event_category_t {
    DOM_EVENT_CATEGORY_UNKNOWN = 0,
    DOM_EVENT_CATEGORY_UI = 1,
    DOM_EVENT_CATEGORY_MOUSE = 2,
    DOM_EVENT_CATEGORY_MUTATION = 4,
    DOM_EVENT_CATEGORY_KEYBOARD = 8,
    DOM_EVENT_CATEGORY_TEXT = 16,
    DOM_EVENT_CATEGORY_COMPOSITION = 32,
    DOM_EVENT_CATEGORY_DRAG = 64,
    DOM_EVENT_CATEGORY_CLIPBOARD = 128,
    DOM_EVENT_CATEGORY_MESSAGE = 256,
    DOM_EVENT_CATEGORY_WHEEL = 512,
    DOM_EVENT_CATEGORY_BEFORE_TEXT_INSERTED = 1024,
    DOM_EVENT_CATEGORY_OVERFLOW = 2048,
    DOM_EVENT_CATEGORY_PAGE_TRANSITION = 4096,
    DOM_EVENT_CATEGORY_POPSTATE = 8192,
    DOM_EVENT_CATEGORY_PROGRESS = 16384,
    DOM_EVENT_CATEGORY_XMLHTTPREQUEST_PROGRESS = 32768,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n DOM event processing phases.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_dom_event_phase_t {
    DOM_EVENT_PHASE_UNKNOWN = 0,
    DOM_EVENT_PHASE_CAPTURING = 1,
    DOM_EVENT_PHASE_AT_TARGET = 2,
    DOM_EVENT_PHASE_BUBBLING = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n DOM node types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_dom_node_type_t {
    DOM_NODE_TYPE_UNSUPPORTED = 0,
    DOM_NODE_TYPE_ELEMENT = 1,
    DOM_NODE_TYPE_ATTRIBUTE = 2,
    DOM_NODE_TYPE_TEXT = 3,
    DOM_NODE_TYPE_CDATA_SECTION = 4,
    DOM_NODE_TYPE_PROCESSING_INSTRUCTIONS = 5,
    DOM_NODE_TYPE_COMMENT = 6,
    DOM_NODE_TYPE_DOCUMENT = 7,
    DOM_NODE_TYPE_DOCUMENT_TYPE = 8,
    DOM_NODE_TYPE_DOCUMENT_FRAGMENT = 9,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n DOM form control types. Should be kept in sync with Chromium's\n blink::mojom::FormControlType type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_dom_form_control_type_t {
    DOM_FORM_CONTROL_TYPE_UNSUPPORTED = 0,
    DOM_FORM_CONTROL_TYPE_BUTTON_BUTTON = 1,
    DOM_FORM_CONTROL_TYPE_BUTTON_SUBMIT = 2,
    DOM_FORM_CONTROL_TYPE_BUTTON_RESET = 3,
    DOM_FORM_CONTROL_TYPE_BUTTON_POPOVER = 4,
    DOM_FORM_CONTROL_TYPE_FIELDSET = 5,
    DOM_FORM_CONTROL_TYPE_INPUT_BUTTON = 6,
    DOM_FORM_CONTROL_TYPE_INPUT_CHECKBOX = 7,
    DOM_FORM_CONTROL_TYPE_INPUT_COLOR = 8,
    DOM_FORM_CONTROL_TYPE_INPUT_DATE = 9,
    DOM_FORM_CONTROL_TYPE_INPUT_DATETIME_LOCAL = 10,
    DOM_FORM_CONTROL_TYPE_INPUT_EMAIL = 11,
    DOM_FORM_CONTROL_TYPE_INPUT_FILE = 12,
    DOM_FORM_CONTROL_TYPE_INPUT_HIDDEN = 13,
    DOM_FORM_CONTROL_TYPE_INPUT_IMAGE = 14,
    DOM_FORM_CONTROL_TYPE_INPUT_MONTH = 15,
    DOM_FORM_CONTROL_TYPE_INPUT_NUMBER = 16,
    DOM_FORM_CONTROL_TYPE_INPUT_PASSWORD = 17,
    DOM_FORM_CONTROL_TYPE_INPUT_RADIO = 18,
    DOM_FORM_CONTROL_TYPE_INPUT_RANGE = 19,
    DOM_FORM_CONTROL_TYPE_INPUT_RESET = 20,
    DOM_FORM_CONTROL_TYPE_INPUT_SEARCH = 21,
    DOM_FORM_CONTROL_TYPE_INPUT_SUBMIT = 22,
    DOM_FORM_CONTROL_TYPE_INPUT_TELEPHONE = 23,
    DOM_FORM_CONTROL_TYPE_INPUT_TEXT = 24,
    DOM_FORM_CONTROL_TYPE_INPUT_TIME = 25,
    DOM_FORM_CONTROL_TYPE_INPUT_URL = 26,
    DOM_FORM_CONTROL_TYPE_INPUT_WEEK = 27,
    DOM_FORM_CONTROL_TYPE_OUTPUT = 28,
    DOM_FORM_CONTROL_TYPE_SELECT_ONE = 29,
    DOM_FORM_CONTROL_TYPE_SELECT_MULTIPLE = 30,
    DOM_FORM_CONTROL_TYPE_TEXT_AREA = 31,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported file dialog modes.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_file_dialog_mode_t {
    #[doc = "\n Requires that the file exists before allowing the user to pick it.\n"]
    FILE_DIALOG_OPEN = 0,
    #[doc = "\n Like Open, but allows picking multiple files to open.\n"]
    FILE_DIALOG_OPEN_MULTIPLE = 1,
    #[doc = "\n Like Open, but selects a folder to open.\n"]
    FILE_DIALOG_OPEN_FOLDER = 2,
    #[doc = "\n Allows picking a nonexistent file, and prompts to overwrite if the file\n already exists.\n"]
    FILE_DIALOG_SAVE = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Print job color mode values.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_color_model_t {
    COLOR_MODEL_UNKNOWN = 0,
    COLOR_MODEL_GRAY = 1,
    COLOR_MODEL_COLOR = 2,
    COLOR_MODEL_CMYK = 3,
    COLOR_MODEL_CMY = 4,
    COLOR_MODEL_KCMY = 5,
    COLOR_MODEL_CMY_K = 6,
    COLOR_MODEL_BLACK = 7,
    COLOR_MODEL_GRAYSCALE = 8,
    COLOR_MODEL_RGB = 9,
    COLOR_MODEL_RGB16 = 10,
    COLOR_MODEL_RGBA = 11,
    COLOR_MODEL_COLORMODE_COLOR = 12,
    COLOR_MODEL_COLORMODE_MONOCHROME = 13,
    COLOR_MODEL_HP_COLOR_COLOR = 14,
    COLOR_MODEL_HP_COLOR_BLACK = 15,
    COLOR_MODEL_PRINTOUTMODE_NORMAL = 16,
    COLOR_MODEL_PRINTOUTMODE_NORMAL_GRAY = 17,
    COLOR_MODEL_PROCESSCOLORMODEL_CMYK = 18,
    COLOR_MODEL_PROCESSCOLORMODEL_GREYSCALE = 19,
    COLOR_MODEL_PROCESSCOLORMODEL_RGB = 20,
}
#[repr(i32)]
#[non_exhaustive]
#[doc = "\n Print job duplex mode values.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_duplex_mode_t {
    DUPLEX_MODE_UNKNOWN = -1,
    DUPLEX_MODE_SIMPLEX = 0,
    DUPLEX_MODE_LONG_EDGE = 1,
    DUPLEX_MODE_SHORT_EDGE = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Cursor type values.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_cursor_type_t {
    CT_POINTER = 0,
    CT_CROSS = 1,
    CT_HAND = 2,
    CT_IBEAM = 3,
    CT_WAIT = 4,
    CT_HELP = 5,
    CT_EASTRESIZE = 6,
    CT_NORTHRESIZE = 7,
    CT_NORTHEASTRESIZE = 8,
    CT_NORTHWESTRESIZE = 9,
    CT_SOUTHRESIZE = 10,
    CT_SOUTHEASTRESIZE = 11,
    CT_SOUTHWESTRESIZE = 12,
    CT_WESTRESIZE = 13,
    CT_NORTHSOUTHRESIZE = 14,
    CT_EASTWESTRESIZE = 15,
    CT_NORTHEASTSOUTHWESTRESIZE = 16,
    CT_NORTHWESTSOUTHEASTRESIZE = 17,
    CT_COLUMNRESIZE = 18,
    CT_ROWRESIZE = 19,
    CT_MIDDLEPANNING = 20,
    CT_EASTPANNING = 21,
    CT_NORTHPANNING = 22,
    CT_NORTHEASTPANNING = 23,
    CT_NORTHWESTPANNING = 24,
    CT_SOUTHPANNING = 25,
    CT_SOUTHEASTPANNING = 26,
    CT_SOUTHWESTPANNING = 27,
    CT_WESTPANNING = 28,
    CT_MOVE = 29,
    CT_VERTICALTEXT = 30,
    CT_CELL = 31,
    CT_CONTEXTMENU = 32,
    CT_ALIAS = 33,
    CT_PROGRESS = 34,
    CT_NODROP = 35,
    CT_COPY = 36,
    CT_NONE = 37,
    CT_NOTALLOWED = 38,
    CT_ZOOMIN = 39,
    CT_ZOOMOUT = 40,
    CT_GRAB = 41,
    CT_GRABBING = 42,
    CT_MIDDLE_PANNING_VERTICAL = 43,
    CT_MIDDLE_PANNING_HORIZONTAL = 44,
    CT_CUSTOM = 45,
    CT_DND_NONE = 46,
    CT_DND_MOVE = 47,
    CT_DND_COPY = 48,
    CT_DND_LINK = 49,
}
#[doc = "\n Structure representing cursor information. |buffer| will be\n |size.width|*|size.height|*4 bytes in size and represents a BGRA image with\n an upper-left origin.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_cursor_info_t {
    pub hotspot: cef_point_t,
    pub image_scale_factor: f32,
    pub buffer: *mut ::std::os::raw::c_void,
    pub size: cef_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_cursor_info_t"][::std::mem::size_of::<_cef_cursor_info_t>() - 32usize];
    ["Alignment of _cef_cursor_info_t"][::std::mem::align_of::<_cef_cursor_info_t>() - 8usize];
    ["Offset of field: _cef_cursor_info_t::hotspot"]
        [::std::mem::offset_of!(_cef_cursor_info_t, hotspot) - 0usize];
    ["Offset of field: _cef_cursor_info_t::image_scale_factor"]
        [::std::mem::offset_of!(_cef_cursor_info_t, image_scale_factor) - 8usize];
    ["Offset of field: _cef_cursor_info_t::buffer"]
        [::std::mem::offset_of!(_cef_cursor_info_t, buffer) - 16usize];
    ["Offset of field: _cef_cursor_info_t::size"]
        [::std::mem::offset_of!(_cef_cursor_info_t, size) - 24usize];
};
#[doc = "\n Structure representing cursor information. |buffer| will be\n |size.width|*|size.height|*4 bytes in size and represents a BGRA image with\n an upper-left origin.\n"]
pub type cef_cursor_info_t = _cef_cursor_info_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n URI unescape rules passed to CefURIDecode().\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_uri_unescape_rule_t {
    #[doc = "\n Don't unescape anything at all.\n"]
    UU_NONE = 0,
    #[doc = "\n Don't unescape anything special, but all normal unescaping will happen.\n This is a placeholder and can't be combined with other flags (since it's\n just the absence of them). All other unescape rules imply \"normal\" in\n addition to their special meaning. Things like escaped letters, digits,\n and most symbols will get unescaped with this mode.\n"]
    UU_NORMAL = 1,
    #[doc = "\n Convert %20 to spaces. In some places where we're showing URLs, we may\n want this. In places where the URL may be copied and pasted out, then\n you wouldn't want this since it might not be interpreted in one piece\n by other applications.\n"]
    UU_SPACES = 2,
    #[doc = "\n Unescapes '/' and '\\\\'. If these characters were unescaped, the resulting\n URL won't be the same as the source one. Moreover, they are dangerous to\n unescape in strings that will be used as file paths or names. This value\n should only be used when slashes don't have special meaning, like data\n URLs.\n"]
    UU_PATH_SEPARATORS = 4,
    #[doc = "\n Unescapes various characters that will change the meaning of URLs,\n including '%', '+', '&', '#'. Does not unescape path separators.\n If these characters were unescaped, the resulting URL won't be the same\n as the source one. This flag is used when generating final output like\n filenames for URLs where we won't be interpreting as a URL and want to do\n as much unescaping as possible.\n"]
    UU_URL_SPECIAL_CHARS_EXCEPT_PATH_SEPARATORS = 8,
    #[doc = "\n URL queries use \"+\" for space. This flag controls that replacement.\n"]
    UU_REPLACE_PLUS_WITH_SPACE = 16,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Options that can be passed to CefParseJSON.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_json_parser_options_t {
    #[doc = "\n Parses the input strictly according to RFC 4627. See comments in\n Chromium's base/json/json_reader.h file for known limitations/\n deviations from the RFC.\n"]
    JSON_PARSER_RFC = 0,
    #[doc = "\n Allows commas to exist after the last element in structures.\n"]
    JSON_PARSER_ALLOW_TRAILING_COMMAS = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Options that can be passed to CefWriteJSON.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_json_writer_options_t {
    #[doc = "\n Default behavior.\n"]
    JSON_WRITER_DEFAULT = 0,
    #[doc = "\n This option instructs the writer that if a Binary value is encountered,\n the value (and key if within a dictionary) will be omitted from the\n output, and success will be returned. Otherwise, if a binary value is\n encountered, failure will be returned.\n"]
    JSON_WRITER_OMIT_BINARY_VALUES = 1,
    #[doc = "\n This option instructs the writer to write doubles that have no fractional\n part as a normal integer (i.e., without using exponential notation\n or appending a '.0') as long as the value is within the range of a\n 64-bit int.\n"]
    JSON_WRITER_OMIT_DOUBLE_TYPE_PRESERVATION = 2,
    #[doc = "\n Return a slightly nicer formatted json string (pads with whitespace to\n help with readability).\n"]
    JSON_WRITER_PRETTY_PRINT = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Margin type for PDF printing.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_pdf_print_margin_type_t {
    #[doc = "\n Default margins of 1cm (~0.4 inches).\n"]
    PDF_PRINT_MARGIN_DEFAULT = 0,
    #[doc = "\n No margins.\n"]
    PDF_PRINT_MARGIN_NONE = 1,
    #[doc = "\n Custom margins using the |margin_*| values from cef_pdf_print_settings_t.\n"]
    PDF_PRINT_MARGIN_CUSTOM = 2,
}
#[doc = "\n Structure representing PDF print settings. These values match the parameters\n supported by the DevTools Page.printToPDF function. See\n https://chromedevtools.github.io/devtools-protocol/tot/Page/#method-printToPDF\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_pdf_print_settings_t {
    #[doc = "\n Set to true (1) for landscape mode or false (0) for portrait mode.\n"]
    pub landscape: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to print background graphics.\n"]
    pub print_background: ::std::os::raw::c_int,
    #[doc = "\n The percentage to scale the PDF by before printing (e.g. .5 is 50%).\n If this value is less than or equal to zero the default value of 1.0\n will be used.\n"]
    pub scale: f64,
    #[doc = "\n Output paper size in inches. If either of these values is less than or\n equal to zero then the default paper size (letter, 8.5 x 11 inches) will\n be used.\n"]
    pub paper_width: f64,
    pub paper_height: f64,
    #[doc = "\n Set to true (1) to prefer page size as defined by css. Defaults to false\n (0), in which case the content will be scaled to fit the paper size.\n"]
    pub prefer_css_page_size: ::std::os::raw::c_int,
    #[doc = "\n Margin type.\n"]
    pub margin_type: cef_pdf_print_margin_type_t,
    #[doc = "\n Margins in inches. Only used if |margin_type| is set to\n PDF_PRINT_MARGIN_CUSTOM.\n"]
    pub margin_top: f64,
    pub margin_right: f64,
    pub margin_bottom: f64,
    pub margin_left: f64,
    #[doc = "\n Paper ranges to print, one based, e.g., '1-5, 8, 11-13'. Pages are printed\n in the document order, not in the order specified, and no more than once.\n Defaults to empty string, which implies the entire document is printed.\n The page numbers are quietly capped to actual page count of the document,\n and ranges beyond the end of the document are ignored. If this results in\n no pages to print, an error is reported. It is an error to specify a range\n with start greater than end.\n"]
    pub page_ranges: cef_string_t,
    #[doc = "\n Set to true (1) to display the header and/or footer. Modify\n |header_template| and/or |footer_template| to customize the display.\n"]
    pub display_header_footer: ::std::os::raw::c_int,
    #[doc = "\n HTML template for the print header. Only displayed if\n |display_header_footer| is true (1). Should be valid HTML markup with\n the following classes used to inject printing values into them:\n\n - date: formatted print date\n - title: document title\n - url: document location\n - pageNumber: current page number\n - totalPages: total pages in the document\n\n For example, \"<span class=title></span>\" would generate a span containing\n the title.\n"]
    pub header_template: cef_string_t,
    #[doc = "\n HTML template for the print footer. Only displayed if\n |display_header_footer| is true (1). Uses the same format as\n |header_template|.\n"]
    pub footer_template: cef_string_t,
    #[doc = "\n Set to true (1) to generate tagged (accessible) PDF.\n"]
    pub generate_tagged_pdf: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to generate a document outline.\n"]
    pub generate_document_outline: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_pdf_print_settings_t"]
        [::std::mem::size_of::<_cef_pdf_print_settings_t>() - 160usize];
    ["Alignment of _cef_pdf_print_settings_t"]
        [::std::mem::align_of::<_cef_pdf_print_settings_t>() - 8usize];
    ["Offset of field: _cef_pdf_print_settings_t::landscape"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, landscape) - 0usize];
    ["Offset of field: _cef_pdf_print_settings_t::print_background"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, print_background) - 4usize];
    ["Offset of field: _cef_pdf_print_settings_t::scale"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, scale) - 8usize];
    ["Offset of field: _cef_pdf_print_settings_t::paper_width"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, paper_width) - 16usize];
    ["Offset of field: _cef_pdf_print_settings_t::paper_height"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, paper_height) - 24usize];
    ["Offset of field: _cef_pdf_print_settings_t::prefer_css_page_size"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, prefer_css_page_size) - 32usize];
    ["Offset of field: _cef_pdf_print_settings_t::margin_type"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, margin_type) - 36usize];
    ["Offset of field: _cef_pdf_print_settings_t::margin_top"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, margin_top) - 40usize];
    ["Offset of field: _cef_pdf_print_settings_t::margin_right"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, margin_right) - 48usize];
    ["Offset of field: _cef_pdf_print_settings_t::margin_bottom"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, margin_bottom) - 56usize];
    ["Offset of field: _cef_pdf_print_settings_t::margin_left"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, margin_left) - 64usize];
    ["Offset of field: _cef_pdf_print_settings_t::page_ranges"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, page_ranges) - 72usize];
    ["Offset of field: _cef_pdf_print_settings_t::display_header_footer"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, display_header_footer) - 96usize];
    ["Offset of field: _cef_pdf_print_settings_t::header_template"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, header_template) - 104usize];
    ["Offset of field: _cef_pdf_print_settings_t::footer_template"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, footer_template) - 128usize];
    ["Offset of field: _cef_pdf_print_settings_t::generate_tagged_pdf"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, generate_tagged_pdf) - 152usize];
    ["Offset of field: _cef_pdf_print_settings_t::generate_document_outline"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, generate_document_outline) - 156usize];
};
#[doc = "\n Structure representing PDF print settings. These values match the parameters\n supported by the DevTools Page.printToPDF function. See\n https://chromedevtools.github.io/devtools-protocol/tot/Page/#method-printToPDF\n"]
pub type cef_pdf_print_settings_t = _cef_pdf_print_settings_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported UI scale factors for the platform. SCALE_FACTOR_NONE is used for\n density independent resources such as string, html/js files or an image that\n can be used for any scale factors (such as wallpapers).\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_scale_factor_t {
    SCALE_FACTOR_NONE = 0,
    SCALE_FACTOR_100P = 1,
    SCALE_FACTOR_125P = 2,
    SCALE_FACTOR_133P = 3,
    SCALE_FACTOR_140P = 4,
    SCALE_FACTOR_150P = 5,
    SCALE_FACTOR_180P = 6,
    SCALE_FACTOR_200P = 7,
    SCALE_FACTOR_250P = 8,
    SCALE_FACTOR_300P = 9,
}
impl cef_referrer_policy_t {
    pub const REFERRER_POLICY_DEFAULT: cef_referrer_policy_t =
        cef_referrer_policy_t::REFERRER_POLICY_CLEAR_REFERRER_ON_TRANSITION_FROM_SECURE_TO_INSECURE;
}
impl cef_referrer_policy_t {
    pub const REFERRER_POLICY_LAST_VALUE: cef_referrer_policy_t =
        cef_referrer_policy_t::REFERRER_POLICY_NO_REFERRER;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Policy for how the Referrer HTTP header value will be sent during\n navigation. If the `--no-referrers` command-line flag is specified then the\n policy value will be ignored and the Referrer value will never be sent. Must\n be kept synchronized with net::URLRequest::ReferrerPolicy from Chromium.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_referrer_policy_t {
    #[doc = "\n Clear the referrer header if the header value is HTTPS but the request\n destination is HTTP. This is the default behavior.\n"]
    REFERRER_POLICY_CLEAR_REFERRER_ON_TRANSITION_FROM_SECURE_TO_INSECURE = 0,
    #[doc = "\n A slight variant on CLEAR_REFERRER_ON_TRANSITION_FROM_SECURE_TO_INSECURE:\n If the request destination is HTTP, an HTTPS referrer will be cleared. If\n the request's destination is cross-origin with the referrer (but does not\n downgrade), the referrer's granularity will be stripped down to an origin\n rather than a full URL. Same-origin requests will send the full referrer.\n"]
    REFERRER_POLICY_REDUCE_REFERRER_GRANULARITY_ON_TRANSITION_CROSS_ORIGIN = 1,
    #[doc = "\n Strip the referrer down to an origin when the origin of the referrer is\n different from the destination's origin.\n"]
    REFERRER_POLICY_ORIGIN_ONLY_ON_TRANSITION_CROSS_ORIGIN = 2,
    #[doc = "\n Never change the referrer.\n"]
    REFERRER_POLICY_NEVER_CLEAR_REFERRER = 3,
    #[doc = "\n Strip the referrer down to the origin regardless of the redirect location.\n"]
    REFERRER_POLICY_ORIGIN = 4,
    #[doc = "\n Clear the referrer when the request's referrer is cross-origin with the\n request's destination.\n"]
    REFERRER_POLICY_CLEAR_REFERRER_ON_TRANSITION_CROSS_ORIGIN = 5,
    #[doc = "\n Strip the referrer down to the origin, but clear it entirely if the\n referrer value is HTTPS and the destination is HTTP.\n"]
    REFERRER_POLICY_ORIGIN_CLEAR_ON_TRANSITION_FROM_SECURE_TO_INSECURE = 6,
    #[doc = "\n Always clear the referrer regardless of the request destination.\n"]
    REFERRER_POLICY_NO_REFERRER = 7,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Return values for CefResponseFilter::Filter().\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_response_filter_status_t {
    #[doc = "\n Some or all of the pre-filter data was read successfully but more data is\n needed in order to continue filtering (filtered output is pending).\n"]
    RESPONSE_FILTER_NEED_MORE_DATA = 0,
    #[doc = "\n Some or all of the pre-filter data was read successfully and all available\n filtered output has been written.\n"]
    RESPONSE_FILTER_DONE = 1,
    #[doc = "\n An error occurred during filtering.\n"]
    RESPONSE_FILTER_ERROR = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Describes how to interpret the alpha component of a pixel.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_alpha_type_t {
    #[doc = "\n No transparency. The alpha component is ignored.\n"]
    CEF_ALPHA_TYPE_OPAQUE = 0,
    #[doc = "\n Transparency with pre-multiplied alpha component.\n"]
    CEF_ALPHA_TYPE_PREMULTIPLIED = 1,
    #[doc = "\n Transparency with post-multiplied alpha component.\n"]
    CEF_ALPHA_TYPE_POSTMULTIPLIED = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Text style types. Should be kepy in sync with gfx::TextStyle.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_text_style_t {
    CEF_TEXT_STYLE_BOLD = 0,
    CEF_TEXT_STYLE_ITALIC = 1,
    CEF_TEXT_STYLE_STRIKE = 2,
    CEF_TEXT_STYLE_DIAGONAL_STRIKE = 3,
    CEF_TEXT_STYLE_UNDERLINE = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Specifies where along the axis the CefBoxLayout child views should be laid\n out. Should be kept in sync with Chromium's views::LayoutAlignment type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_axis_alignment_t {
    #[doc = " Child views will be left/top-aligned."]
    CEF_AXIS_ALIGNMENT_START = 0,
    #[doc = " Child views will be center-aligned."]
    CEF_AXIS_ALIGNMENT_CENTER = 1,
    #[doc = " Child views will be right/bottom-aligned."]
    CEF_AXIS_ALIGNMENT_END = 2,
    #[doc = " Child views will be stretched to fit."]
    CEF_AXIS_ALIGNMENT_STRETCH = 3,
}
#[doc = "\n Settings used when initializing a CefBoxLayout.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_box_layout_settings_t {
    #[doc = "\n If true (1) the layout will be horizontal, otherwise the layout will be\n vertical.\n"]
    pub horizontal: ::std::os::raw::c_int,
    #[doc = "\n Adds additional horizontal space between the child view area and the host\n view border.\n"]
    pub inside_border_horizontal_spacing: ::std::os::raw::c_int,
    #[doc = "\n Adds additional vertical space between the child view area and the host\n view border.\n"]
    pub inside_border_vertical_spacing: ::std::os::raw::c_int,
    #[doc = "\n Adds additional space around the child view area.\n"]
    pub inside_border_insets: cef_insets_t,
    #[doc = "\n Adds additional space between child views.\n"]
    pub between_child_spacing: ::std::os::raw::c_int,
    #[doc = "\n Specifies where along the main axis the child views should be laid out.\n"]
    pub main_axis_alignment: cef_axis_alignment_t,
    #[doc = "\n Specifies where along the cross axis the child views should be laid out.\n"]
    pub cross_axis_alignment: cef_axis_alignment_t,
    #[doc = "\n Minimum cross axis size.\n"]
    pub minimum_cross_axis_size: ::std::os::raw::c_int,
    #[doc = "\n Default flex for views when none is specified via CefBoxLayout methods.\n Using the preferred size as the basis, free space along the main axis is\n distributed to views in the ratio of their flex weights. Similarly, if the\n views will overflow the parent, space is subtracted in these ratios. A\n flex of 0 means this view is not resized. Flex values must not be\n negative.\n"]
    pub default_flex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_box_layout_settings_t"]
        [::std::mem::size_of::<_cef_box_layout_settings_t>() - 48usize];
    ["Alignment of _cef_box_layout_settings_t"]
        [::std::mem::align_of::<_cef_box_layout_settings_t>() - 4usize];
    ["Offset of field: _cef_box_layout_settings_t::horizontal"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, horizontal) - 0usize];
    ["Offset of field: _cef_box_layout_settings_t::inside_border_horizontal_spacing"][::std::mem::offset_of!(
        _cef_box_layout_settings_t,
        inside_border_horizontal_spacing
    ) - 4usize];
    ["Offset of field: _cef_box_layout_settings_t::inside_border_vertical_spacing"][::std::mem::offset_of!(
        _cef_box_layout_settings_t,
        inside_border_vertical_spacing
    ) - 8usize];
    ["Offset of field: _cef_box_layout_settings_t::inside_border_insets"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, inside_border_insets) - 12usize];
    ["Offset of field: _cef_box_layout_settings_t::between_child_spacing"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, between_child_spacing) - 28usize];
    ["Offset of field: _cef_box_layout_settings_t::main_axis_alignment"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, main_axis_alignment) - 32usize];
    ["Offset of field: _cef_box_layout_settings_t::cross_axis_alignment"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, cross_axis_alignment) - 36usize];
    ["Offset of field: _cef_box_layout_settings_t::minimum_cross_axis_size"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, minimum_cross_axis_size) - 40usize];
    ["Offset of field: _cef_box_layout_settings_t::default_flex"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, default_flex) - 44usize];
};
#[doc = "\n Settings used when initializing a CefBoxLayout.\n"]
pub type cef_box_layout_settings_t = _cef_box_layout_settings_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Specifies the button display state.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_button_state_t {
    CEF_BUTTON_STATE_NORMAL = 0,
    CEF_BUTTON_STATE_HOVERED = 1,
    CEF_BUTTON_STATE_PRESSED = 2,
    CEF_BUTTON_STATE_DISABLED = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Specifies the horizontal text alignment mode.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_horizontal_alignment_t {
    #[doc = "\n Align the text's left edge with that of its display area.\n"]
    CEF_HORIZONTAL_ALIGNMENT_LEFT = 0,
    #[doc = "\n Align the text's center with that of its display area.\n"]
    CEF_HORIZONTAL_ALIGNMENT_CENTER = 1,
    #[doc = "\n Align the text's right edge with that of its display area.\n"]
    CEF_HORIZONTAL_ALIGNMENT_RIGHT = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Specifies how a menu will be anchored for non-RTL languages. The opposite\n position will be used for RTL languages.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_menu_anchor_position_t {
    CEF_MENU_ANCHOR_TOPLEFT = 0,
    CEF_MENU_ANCHOR_TOPRIGHT = 1,
    CEF_MENU_ANCHOR_BOTTOMCENTER = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Supported color types for menu items.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_menu_color_type_t {
    CEF_MENU_COLOR_TEXT = 0,
    CEF_MENU_COLOR_TEXT_HOVERED = 1,
    CEF_MENU_COLOR_TEXT_ACCELERATOR = 2,
    CEF_MENU_COLOR_TEXT_ACCELERATOR_HOVERED = 3,
    CEF_MENU_COLOR_BACKGROUND = 4,
    CEF_MENU_COLOR_BACKGROUND_HOVERED = 5,
    CEF_MENU_COLOR_COUNT = 6,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Supported SSL version values. See net/ssl/ssl_connection_status_flags.h\n for more information."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_ssl_version_t {
    SSL_CONNECTION_VERSION_UNKNOWN = 0,
    SSL_CONNECTION_VERSION_SSL2 = 1,
    SSL_CONNECTION_VERSION_SSL3 = 2,
    SSL_CONNECTION_VERSION_TLS1 = 3,
    SSL_CONNECTION_VERSION_TLS1_1 = 4,
    SSL_CONNECTION_VERSION_TLS1_2 = 5,
    SSL_CONNECTION_VERSION_TLS1_3 = 6,
    SSL_CONNECTION_VERSION_QUIC = 7,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Supported SSL content status flags. See content/public/common/ssl_status.h\n for more information."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_ssl_content_status_t {
    SSL_CONTENT_NORMAL_CONTENT = 0,
    SSL_CONTENT_DISPLAYED_INSECURE_CONTENT = 1,
    SSL_CONTENT_RAN_INSECURE_CONTENT = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Configuration options for registering a custom scheme.\n These values are used when calling AddCustomScheme."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_scheme_options_t {
    CEF_SCHEME_OPTION_NONE = 0,
    #[doc = " For non-standard scheme URLs only the \"scheme:\" component is parsed and\n canonicalized. The remainder of the URL will be passed to the handler as-\n is. For example, \"scheme:///some%20text\" will remain the same.\n Non-standard scheme URLs cannot be used as a target for form submission.\n"]
    CEF_SCHEME_OPTION_STANDARD = 1,
    #[doc = "\n If CEF_SCHEME_OPTION_LOCAL is set the scheme will be treated with the same\n security rules as those applied to \"file\" URLs. Normal pages cannot link\n to or access local URLs. Also, by default, local URLs can only perform\n XMLHttpRequest calls to the same URL (origin + path) that originated the\n request. To allow XMLHttpRequest calls from a local URL to other URLs with\n the same origin set the CefSettings.file_access_from_file_urls_allowed\n value to true (1). To allow XMLHttpRequest calls from a local URL to all\n origins set the CefSettings.universal_access_from_file_urls_allowed value\n to true (1).\n"]
    CEF_SCHEME_OPTION_LOCAL = 2,
    #[doc = "\n If CEF_SCHEME_OPTION_DISPLAY_ISOLATED is set the scheme can only be\n displayed from other content hosted with the same scheme. For example,\n pages in other origins cannot create iframes or hyperlinks to URLs with\n the scheme. For schemes that must be accessible from other schemes don't\n set this, set CEF_SCHEME_OPTION_CORS_ENABLED, and use CORS\n \"Access-Control-Allow-Origin\" headers to further restrict access.\n"]
    CEF_SCHEME_OPTION_DISPLAY_ISOLATED = 4,
    #[doc = "\n If CEF_SCHEME_OPTION_SECURE is set the scheme will be treated with the\n same security rules as those applied to \"https\" URLs. For example, loading\n this scheme from other secure schemes will not trigger mixed content\n warnings.\n"]
    CEF_SCHEME_OPTION_SECURE = 8,
    #[doc = "\n If CEF_SCHEME_OPTION_CORS_ENABLED is set the scheme can be sent CORS\n requests. This value should be set in most cases where\n CEF_SCHEME_OPTION_STANDARD is set.\n"]
    CEF_SCHEME_OPTION_CORS_ENABLED = 16,
    #[doc = "\n If CEF_SCHEME_OPTION_CSP_BYPASSING is set the scheme can bypass Content-\n Security-Policy (CSP) checks. This value should not be set in most cases\n where CEF_SCHEME_OPTION_STANDARD is set.\n"]
    CEF_SCHEME_OPTION_CSP_BYPASSING = 32,
    #[doc = "\n If CEF_SCHEME_OPTION_FETCH_ENABLED is set the scheme can perform Fetch API\n requests.\n"]
    CEF_SCHEME_OPTION_FETCH_ENABLED = 64,
}
#[doc = "\n Structure representing a range.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_range_t {
    pub from: u32,
    pub to: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_range_t"][::std::mem::size_of::<_cef_range_t>() - 8usize];
    ["Alignment of _cef_range_t"][::std::mem::align_of::<_cef_range_t>() - 4usize];
    ["Offset of field: _cef_range_t::from"][::std::mem::offset_of!(_cef_range_t, from) - 0usize];
    ["Offset of field: _cef_range_t::to"][::std::mem::offset_of!(_cef_range_t, to) - 4usize];
};
#[doc = "\n Structure representing a range.\n"]
pub type cef_range_t = _cef_range_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Composition underline style.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_composition_underline_style_t {
    CEF_CUS_SOLID = 0,
    CEF_CUS_DOT = 1,
    CEF_CUS_DASH = 2,
    CEF_CUS_NONE = 3,
}
#[doc = "\n Structure representing IME composition underline information. This is a thin\n wrapper around Blink's WebCompositionUnderline class and should be kept in\n sync with that.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_composition_underline_t {
    #[doc = "\n Underline character range.\n"]
    pub range: cef_range_t,
    #[doc = "\n Text color.\n"]
    pub color: cef_color_t,
    #[doc = "\n Background color.\n"]
    pub background_color: cef_color_t,
    #[doc = "\n Set to true (1) for thick underline.\n"]
    pub thick: ::std::os::raw::c_int,
    #[doc = "\n Style.\n"]
    pub style: cef_composition_underline_style_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_composition_underline_t"]
        [::std::mem::size_of::<_cef_composition_underline_t>() - 24usize];
    ["Alignment of _cef_composition_underline_t"]
        [::std::mem::align_of::<_cef_composition_underline_t>() - 4usize];
    ["Offset of field: _cef_composition_underline_t::range"]
        [::std::mem::offset_of!(_cef_composition_underline_t, range) - 0usize];
    ["Offset of field: _cef_composition_underline_t::color"]
        [::std::mem::offset_of!(_cef_composition_underline_t, color) - 8usize];
    ["Offset of field: _cef_composition_underline_t::background_color"]
        [::std::mem::offset_of!(_cef_composition_underline_t, background_color) - 12usize];
    ["Offset of field: _cef_composition_underline_t::thick"]
        [::std::mem::offset_of!(_cef_composition_underline_t, thick) - 16usize];
    ["Offset of field: _cef_composition_underline_t::style"]
        [::std::mem::offset_of!(_cef_composition_underline_t, style) - 20usize];
};
#[doc = "\n Structure representing IME composition underline information. This is a thin\n wrapper around Blink's WebCompositionUnderline class and should be kept in\n sync with that.\n"]
pub type cef_composition_underline_t = _cef_composition_underline_t;
impl cef_channel_layout_t {
    pub const CEF_CHANNEL_LAYOUT_MAX: cef_channel_layout_t =
        cef_channel_layout_t::CEF_CHANNEL_LAYOUT_3_1_BACK;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Enumerates the various representations of the ordering of audio channels.\n Must be kept synchronized with media::ChannelLayout from Chromium.\n See media\\base\\channel_layout.h\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_channel_layout_t {
    CEF_CHANNEL_LAYOUT_NONE = 0,
    CEF_CHANNEL_LAYOUT_UNSUPPORTED = 1,
    #[doc = " Front C"]
    CEF_CHANNEL_LAYOUT_MONO = 2,
    #[doc = " Front L, Front R"]
    CEF_CHANNEL_LAYOUT_STEREO = 3,
    #[doc = " Front L, Front R, Back C"]
    CEF_CHANNEL_LAYOUT_2_1 = 4,
    #[doc = " Front L, Front R, Front C"]
    CEF_CHANNEL_LAYOUT_SURROUND = 5,
    #[doc = " Front L, Front R, Front C, Back C"]
    CEF_CHANNEL_LAYOUT_4_0 = 6,
    #[doc = " Front L, Front R, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_2_2 = 7,
    #[doc = " Front L, Front R, Back L, Back R"]
    CEF_CHANNEL_LAYOUT_QUAD = 8,
    #[doc = " Front L, Front R, Front C, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_5_0 = 9,
    #[doc = " Front L, Front R, Front C, LFE, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_5_1 = 10,
    #[doc = " Front L, Front R, Front C, Back L, Back R"]
    CEF_CHANNEL_LAYOUT_5_0_BACK = 11,
    #[doc = " Front L, Front R, Front C, LFE, Back L, Back R"]
    CEF_CHANNEL_LAYOUT_5_1_BACK = 12,
    #[doc = " Front L, Front R, Front C, Back L, Back R, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_7_0 = 13,
    #[doc = " Front L, Front R, Front C, LFE, Back L, Back R, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_7_1 = 14,
    #[doc = " Front L, Front R, Front C, LFE, Front LofC, Front RofC, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_7_1_WIDE = 15,
    #[doc = " Front L, Front R"]
    CEF_CHANNEL_LAYOUT_STEREO_DOWNMIX = 16,
    #[doc = " Front L, Front R, LFE"]
    CEF_CHANNEL_LAYOUT_2POINT1 = 17,
    #[doc = " Front L, Front R, Front C, LFE"]
    CEF_CHANNEL_LAYOUT_3_1 = 18,
    #[doc = " Front L, Front R, Front C, LFE, Back C"]
    CEF_CHANNEL_LAYOUT_4_1 = 19,
    #[doc = " Front L, Front R, Front C, Back C, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_6_0 = 20,
    #[doc = " Front L, Front R, Front LofC, Front RofC, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_6_0_FRONT = 21,
    #[doc = " Front L, Front R, Front C, Back L, Back R, Back C"]
    CEF_CHANNEL_LAYOUT_HEXAGONAL = 22,
    #[doc = " Front L, Front R, Front C, LFE, Back C, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_6_1 = 23,
    #[doc = " Front L, Front R, Front C, LFE, Back L, Back R, Back C"]
    CEF_CHANNEL_LAYOUT_6_1_BACK = 24,
    #[doc = " Front L, Front R, LFE, Front LofC, Front RofC, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_6_1_FRONT = 25,
    #[doc = " Front L, Front R, Front C, Front LofC, Front RofC, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_7_0_FRONT = 26,
    #[doc = " Front L, Front R, Front C, LFE, Back L, Back R, Front LofC, Front RofC"]
    CEF_CHANNEL_LAYOUT_7_1_WIDE_BACK = 27,
    #[doc = " Front L, Front R, Front C, Back L, Back R, Back C, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_OCTAGONAL = 28,
    #[doc = " Channels are not explicitly mapped to speakers."]
    CEF_CHANNEL_LAYOUT_DISCRETE = 29,
    #[doc = " Deprecated, but keeping the enum value for UMA consistency.\n Front L, Front R, Front C. Front C contains the keyboard mic audio. This\n layout is only intended for input for WebRTC. The Front C channel\n is stripped away in the WebRTC audio input pipeline and never seen outside\n of that."]
    CEF_CHANNEL_LAYOUT_STEREO_AND_KEYBOARD_MIC = 30,
    #[doc = " Front L, Front R, LFE, Side L, Side R"]
    CEF_CHANNEL_LAYOUT_4_1_QUAD_SIDE = 31,
    #[doc = " Actual channel layout is specified in the bitstream and the actual channel\n count is unknown at Chromium media pipeline level (useful for audio\n pass-through mode)."]
    CEF_CHANNEL_LAYOUT_BITSTREAM = 32,
    #[doc = " Front L, Front R, Front C, LFE, Side L, Side R,\n Front Height L, Front Height R, Rear Height L, Rear Height R\n Will be represented as six channels (5.1) due to eight channel limit\n kMaxConcurrentChannels"]
    CEF_CHANNEL_LAYOUT_5_1_4_DOWNMIX = 33,
    #[doc = " Front C, LFE"]
    CEF_CHANNEL_LAYOUT_1_1 = 34,
    #[doc = " Front L, Front R, LFE, Back C"]
    CEF_CHANNEL_LAYOUT_3_1_BACK = 35,
}
#[doc = "\n Structure representing the audio parameters for setting up the audio\n handler.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_audio_parameters_t {
    #[doc = "\n Layout of the audio channels\n"]
    pub channel_layout: cef_channel_layout_t,
    #[doc = "\n Sample rate"]
    pub sample_rate: ::std::os::raw::c_int,
    #[doc = "\n Number of frames per buffer\n"]
    pub frames_per_buffer: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_audio_parameters_t"][::std::mem::size_of::<_cef_audio_parameters_t>() - 12usize];
    ["Alignment of _cef_audio_parameters_t"]
        [::std::mem::align_of::<_cef_audio_parameters_t>() - 4usize];
    ["Offset of field: _cef_audio_parameters_t::channel_layout"]
        [::std::mem::offset_of!(_cef_audio_parameters_t, channel_layout) - 0usize];
    ["Offset of field: _cef_audio_parameters_t::sample_rate"]
        [::std::mem::offset_of!(_cef_audio_parameters_t, sample_rate) - 4usize];
    ["Offset of field: _cef_audio_parameters_t::frames_per_buffer"]
        [::std::mem::offset_of!(_cef_audio_parameters_t, frames_per_buffer) - 8usize];
};
#[doc = "\n Structure representing the audio parameters for setting up the audio\n handler.\n"]
pub type cef_audio_parameters_t = _cef_audio_parameters_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Result codes for CefMediaRouter::CreateRoute. Should be kept in sync with\n Chromium's media_router::mojom::RouteRequestResultCode type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_media_route_create_result_t {
    CEF_MRCR_UNKNOWN_ERROR = 0,
    CEF_MRCR_OK = 1,
    CEF_MRCR_TIMED_OUT = 2,
    CEF_MRCR_ROUTE_NOT_FOUND = 3,
    CEF_MRCR_SINK_NOT_FOUND = 4,
    CEF_MRCR_INVALID_ORIGIN = 5,
    CEF_MRCR_NO_SUPPORTED_PROVIDER = 7,
    CEF_MRCR_CANCELLED = 8,
    CEF_MRCR_ROUTE_ALREADY_EXISTS = 9,
    CEF_MRCR_ROUTE_ALREADY_TERMINATED = 11,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Connection state for a MediaRoute object.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_media_route_connection_state_t {
    CEF_MRCS_UNKNOWN = 0,
    CEF_MRCS_CONNECTING = 1,
    CEF_MRCS_CONNECTED = 2,
    CEF_MRCS_CLOSED = 3,
    CEF_MRCS_TERMINATED = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Icon types for a MediaSink object. Should be kept in sync with Chromium's\n media_router::SinkIconType type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_media_sink_icon_type_t {
    CEF_MSIT_CAST = 0,
    CEF_MSIT_CAST_AUDIO_GROUP = 1,
    CEF_MSIT_CAST_AUDIO = 2,
    CEF_MSIT_MEETING = 3,
    CEF_MSIT_HANGOUT = 4,
    CEF_MSIT_EDUCATION = 5,
    CEF_MSIT_WIRED_DISPLAY = 6,
    CEF_MSIT_GENERIC = 7,
    CEF_MSIT_TOTAL_COUNT = 8,
}
#[doc = "\n Device information for a MediaSink object.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_media_sink_device_info_t {
    pub ip_address: cef_string_t,
    pub port: ::std::os::raw::c_int,
    pub model_name: cef_string_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_media_sink_device_info_t"]
        [::std::mem::size_of::<_cef_media_sink_device_info_t>() - 56usize];
    ["Alignment of _cef_media_sink_device_info_t"]
        [::std::mem::align_of::<_cef_media_sink_device_info_t>() - 8usize];
    ["Offset of field: _cef_media_sink_device_info_t::ip_address"]
        [::std::mem::offset_of!(_cef_media_sink_device_info_t, ip_address) - 0usize];
    ["Offset of field: _cef_media_sink_device_info_t::port"]
        [::std::mem::offset_of!(_cef_media_sink_device_info_t, port) - 24usize];
    ["Offset of field: _cef_media_sink_device_info_t::model_name"]
        [::std::mem::offset_of!(_cef_media_sink_device_info_t, model_name) - 32usize];
};
#[doc = "\n Device information for a MediaSink object.\n"]
pub type cef_media_sink_device_info_t = _cef_media_sink_device_info_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Represents commands available to TextField.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_text_field_commands_t {
    CEF_TFC_CUT = 1,
    CEF_TFC_COPY = 2,
    CEF_TFC_PASTE = 3,
    CEF_TFC_UNDO = 4,
    CEF_TFC_DELETE = 5,
    CEF_TFC_SELECT_ALL = 6,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Chrome toolbar types.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_chrome_toolbar_type_t {
    CEF_CTT_NONE = 1,
    CEF_CTT_NORMAL = 2,
    CEF_CTT_LOCATION = 3,
}
impl cef_chrome_page_action_icon_type_t {
    pub const CEF_CPAIT_MAX_VALUE: cef_chrome_page_action_icon_type_t =
        cef_chrome_page_action_icon_type_t::CEF_CPAIT_DISCOUNTS;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Chrome page action icon types. Should be kept in sync with Chromium's\n PageActionIconType type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_chrome_page_action_icon_type_t {
    CEF_CPAIT_BOOKMARK_STAR = 0,
    CEF_CPAIT_CLICK_TO_CALL = 1,
    CEF_CPAIT_COOKIE_CONTROLS = 2,
    CEF_CPAIT_FILE_SYSTEM_ACCESS = 3,
    CEF_CPAIT_FIND = 4,
    CEF_CPAIT_MEMORY_SAVER = 5,
    CEF_CPAIT_INTENT_PICKER = 6,
    CEF_CPAIT_LOCAL_CARD_MIGRATION = 7,
    CEF_CPAIT_MANAGE_PASSWORDS = 8,
    CEF_CPAIT_PAYMENTS_OFFER_NOTIFICATION = 9,
    CEF_CPAIT_PRICE_TRACKING = 10,
    CEF_CPAIT_PWA_INSTALL = 11,
    CEF_CPAIT_QR_CODE_GENERATOR_DEPRECATED = 12,
    CEF_CPAIT_READER_MODE_DEPRECATED = 13,
    CEF_CPAIT_SAVE_AUTOFILL_ADDRESS = 14,
    CEF_CPAIT_SAVE_CARD = 15,
    CEF_CPAIT_SEND_TAB_TO_SELF_DEPRECATED = 16,
    CEF_CPAIT_SHARING_HUB = 17,
    CEF_CPAIT_SIDE_SEARCH = 18,
    CEF_CPAIT_SMS_REMOTE_FETCHER = 19,
    CEF_CPAIT_TRANSLATE = 20,
    CEF_CPAIT_VIRTUAL_CARD_ENROLL = 21,
    CEF_CPAIT_VIRTUAL_CARD_MANUAL_FALLBACK = 22,
    CEF_CPAIT_ZOOM = 23,
    CEF_CPAIT_SAVE_IBAN = 24,
    CEF_CPAIT_MANDATORY_REAUTH = 25,
    CEF_CPAIT_PRICE_INSIGHTS = 26,
    CEF_CPAIT_PRICE_READ_ANYTHING = 27,
    CEF_CPAIT_PRODUCT_SPECIFICATIONS = 28,
    CEF_CPAIT_LENS_OVERLAY = 29,
    CEF_CPAIT_DISCOUNTS = 30,
}
impl cef_chrome_toolbar_button_type_t {
    pub const CEF_CTBT_MAX_VALUE: cef_chrome_toolbar_button_type_t =
        cef_chrome_toolbar_button_type_t::CEF_CTBT_SIDE_PANEL;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Chrome toolbar button types. Should be kept in sync with CEF's internal\n ToolbarButtonType type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_chrome_toolbar_button_type_t {
    CEF_CTBT_CAST = 0,
    CEF_CTBT_DOWNLOAD = 1,
    CEF_CTBT_SEND_TAB_TO_SELF = 2,
    CEF_CTBT_SIDE_PANEL = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Docking modes supported by CefWindow::AddOverlay.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_docking_mode_t {
    CEF_DOCKING_MODE_TOP_LEFT = 1,
    CEF_DOCKING_MODE_TOP_RIGHT = 2,
    CEF_DOCKING_MODE_BOTTOM_LEFT = 3,
    CEF_DOCKING_MODE_BOTTOM_RIGHT = 4,
    CEF_DOCKING_MODE_CUSTOM = 5,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Show states supported by CefWindowDelegate::GetInitialShowState.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_show_state_t {
    CEF_SHOW_STATE_NORMAL = 1,
    CEF_SHOW_STATE_MINIMIZED = 2,
    CEF_SHOW_STATE_MAXIMIZED = 3,
    CEF_SHOW_STATE_FULLSCREEN = 4,
    CEF_SHOW_STATE_HIDDEN = 5,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Values indicating what state of the touch handle is set.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_touch_handle_state_flags_t {
    CEF_THS_FLAG_NONE = 0,
    CEF_THS_FLAG_ENABLED = 1,
    CEF_THS_FLAG_ORIENTATION = 2,
    CEF_THS_FLAG_ORIGIN = 4,
    CEF_THS_FLAG_ALPHA = 8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_touch_handle_state_t {
    #[doc = "\n Touch handle id. Increments for each new touch handle.\n"]
    pub touch_handle_id: ::std::os::raw::c_int,
    #[doc = "\n Combination of cef_touch_handle_state_flags_t values indicating what state\n is set.\n"]
    pub flags: u32,
    #[doc = "\n Enabled state. Only set if |flags| contains CEF_THS_FLAG_ENABLED.\n"]
    pub enabled: ::std::os::raw::c_int,
    #[doc = "\n Orientation state. Only set if |flags| contains CEF_THS_FLAG_ORIENTATION.\n"]
    pub orientation: cef_horizontal_alignment_t,
    pub mirror_vertical: ::std::os::raw::c_int,
    pub mirror_horizontal: ::std::os::raw::c_int,
    #[doc = "\n Origin state. Only set if |flags| contains CEF_THS_FLAG_ORIGIN.\n"]
    pub origin: cef_point_t,
    #[doc = "\n Alpha state. Only set if |flags| contains CEF_THS_FLAG_ALPHA.\n"]
    pub alpha: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_touch_handle_state_t"]
        [::std::mem::size_of::<_cef_touch_handle_state_t>() - 36usize];
    ["Alignment of _cef_touch_handle_state_t"]
        [::std::mem::align_of::<_cef_touch_handle_state_t>() - 4usize];
    ["Offset of field: _cef_touch_handle_state_t::touch_handle_id"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, touch_handle_id) - 0usize];
    ["Offset of field: _cef_touch_handle_state_t::flags"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, flags) - 4usize];
    ["Offset of field: _cef_touch_handle_state_t::enabled"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, enabled) - 8usize];
    ["Offset of field: _cef_touch_handle_state_t::orientation"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, orientation) - 12usize];
    ["Offset of field: _cef_touch_handle_state_t::mirror_vertical"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, mirror_vertical) - 16usize];
    ["Offset of field: _cef_touch_handle_state_t::mirror_horizontal"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, mirror_horizontal) - 20usize];
    ["Offset of field: _cef_touch_handle_state_t::origin"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, origin) - 24usize];
    ["Offset of field: _cef_touch_handle_state_t::alpha"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, alpha) - 32usize];
};
pub type cef_touch_handle_state_t = _cef_touch_handle_state_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Media access permissions used by OnRequestMediaAccessPermission.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_media_access_permission_types_t {
    #[doc = "\n No permission.\n"]
    CEF_MEDIA_PERMISSION_NONE = 0,
    #[doc = "\n Device audio capture permission.\n"]
    CEF_MEDIA_PERMISSION_DEVICE_AUDIO_CAPTURE = 1,
    #[doc = "\n Device video capture permission.\n"]
    CEF_MEDIA_PERMISSION_DEVICE_VIDEO_CAPTURE = 2,
    #[doc = "\n Desktop audio capture permission.\n"]
    CEF_MEDIA_PERMISSION_DESKTOP_AUDIO_CAPTURE = 4,
    #[doc = "\n Desktop video capture permission.\n"]
    CEF_MEDIA_PERMISSION_DESKTOP_VIDEO_CAPTURE = 8,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Permission types used with OnShowPermissionPrompt. Some types are\n platform-specific or only supported with Chrome style. Should be kept\n in sync with Chromium's permissions::RequestType type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_permission_request_types_t {
    CEF_PERMISSION_TYPE_NONE = 0,
    CEF_PERMISSION_TYPE_AR_SESSION = 1,
    CEF_PERMISSION_TYPE_CAMERA_PAN_TILT_ZOOM = 2,
    CEF_PERMISSION_TYPE_CAMERA_STREAM = 4,
    CEF_PERMISSION_TYPE_CAPTURED_SURFACE_CONTROL = 8,
    CEF_PERMISSION_TYPE_CLIPBOARD = 16,
    CEF_PERMISSION_TYPE_TOP_LEVEL_STORAGE_ACCESS = 32,
    CEF_PERMISSION_TYPE_DISK_QUOTA = 64,
    CEF_PERMISSION_TYPE_LOCAL_FONTS = 128,
    CEF_PERMISSION_TYPE_GEOLOCATION = 256,
    CEF_PERMISSION_TYPE_HAND_TRACKING = 512,
    CEF_PERMISSION_TYPE_IDENTITY_PROVIDER = 1024,
    CEF_PERMISSION_TYPE_IDLE_DETECTION = 2048,
    CEF_PERMISSION_TYPE_MIC_STREAM = 4096,
    CEF_PERMISSION_TYPE_MIDI_SYSEX = 8192,
    CEF_PERMISSION_TYPE_MULTIPLE_DOWNLOADS = 16384,
    CEF_PERMISSION_TYPE_NOTIFICATIONS = 32768,
    CEF_PERMISSION_TYPE_KEYBOARD_LOCK = 65536,
    CEF_PERMISSION_TYPE_POINTER_LOCK = 131072,
    CEF_PERMISSION_TYPE_PROTECTED_MEDIA_IDENTIFIER = 262144,
    CEF_PERMISSION_TYPE_REGISTER_PROTOCOL_HANDLER = 524288,
    CEF_PERMISSION_TYPE_STORAGE_ACCESS = 1048576,
    CEF_PERMISSION_TYPE_VR_SESSION = 2097152,
    CEF_PERMISSION_TYPE_WEB_APP_INSTALLATION = 4194304,
    CEF_PERMISSION_TYPE_WINDOW_MANAGEMENT = 8388608,
    CEF_PERMISSION_TYPE_FILE_SYSTEM_ACCESS = 16777216,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Permission request results.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_permission_request_result_t {
    #[doc = "\n Accept the permission request as an explicit user action.\n"]
    CEF_PERMISSION_RESULT_ACCEPT = 0,
    #[doc = "\n Deny the permission request as an explicit user action.\n"]
    CEF_PERMISSION_RESULT_DENY = 1,
    #[doc = "\n Dismiss the permission request as an explicit user action.\n"]
    CEF_PERMISSION_RESULT_DISMISS = 2,
    #[doc = "\n Ignore the permission request. If the prompt remains unhandled (e.g.\n OnShowPermissionPrompt returns false and there is no default permissions\n UI) then any related promises may remain unresolved.\n"]
    CEF_PERMISSION_RESULT_IGNORE = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Certificate types supported by CefTestServer::CreateAndStart. The matching\n certificate file must exist in the \"net/data/ssl/certificates\" directory.\n See CefSetDataDirectoryForTests() for related configuration.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_test_cert_type_t {
    #[doc = " Valid certificate using the IP (127.0.0.1). Loads the \"ok_cert.pem\" file."]
    CEF_TEST_CERT_OK_IP = 0,
    #[doc = " Valid certificate using the domain (\"localhost\"). Loads the\n \"localhost_cert.pem\" file."]
    CEF_TEST_CERT_OK_DOMAIN = 1,
    #[doc = " Expired certificate. Loads the \"expired_cert.pem\" file."]
    CEF_TEST_CERT_EXPIRED = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Preferences type passed to\n CefBrowserProcessHandler::OnRegisterCustomPreferences.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_preferences_type_t {
    #[doc = " Global preferences registered a single time at application startup."]
    CEF_PREFERENCES_TYPE_GLOBAL = 0,
    #[doc = " Request context preferences registered each time a new CefRequestContext\n is created."]
    CEF_PREFERENCES_TYPE_REQUEST_CONTEXT = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Download interrupt reasons. Should be kept in sync with\n Chromium's download::DownloadInterruptReason type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_download_interrupt_reason_t {
    CEF_DOWNLOAD_INTERRUPT_REASON_NONE = 0,
    #[doc = " Generic file operation failure."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_FAILED = 1,
    #[doc = " The file cannot be accessed due to security restrictions."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_ACCESS_DENIED = 2,
    #[doc = " There is not enough room on the drive."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_NO_SPACE = 3,
    #[doc = " The directory or file name is too long."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_NAME_TOO_LONG = 5,
    #[doc = " The file is too large for the file system to handle."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_TOO_LARGE = 6,
    #[doc = " The file contains a virus."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_VIRUS_INFECTED = 7,
    #[doc = " The file was in use. Too many files are opened at once. We have run out of\n memory."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_TRANSIENT_ERROR = 10,
    #[doc = " The file was blocked due to local policy."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_BLOCKED = 11,
    #[doc = " An attempt to check the safety of the download failed due to unexpected\n reasons. See http://crbug.com/153212."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_SECURITY_CHECK_FAILED = 12,
    #[doc = " An attempt was made to seek past the end of a file in opening\n a file (as part of resuming a previously interrupted download)."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_TOO_SHORT = 13,
    #[doc = " The partial file didn't match the expected hash."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_HASH_MISMATCH = 14,
    #[doc = " The source and the target of the download were the same."]
    CEF_DOWNLOAD_INTERRUPT_REASON_FILE_SAME_AS_SOURCE = 15,
    #[doc = " Generic network failure."]
    CEF_DOWNLOAD_INTERRUPT_REASON_NETWORK_FAILED = 20,
    #[doc = " The network operation timed out."]
    CEF_DOWNLOAD_INTERRUPT_REASON_NETWORK_TIMEOUT = 21,
    #[doc = " The network connection has been lost."]
    CEF_DOWNLOAD_INTERRUPT_REASON_NETWORK_DISCONNECTED = 22,
    #[doc = " The server has gone down."]
    CEF_DOWNLOAD_INTERRUPT_REASON_NETWORK_SERVER_DOWN = 23,
    #[doc = " The network request was invalid. This may be due to the original URL or a\n redirected URL:\n - Having an unsupported scheme.\n - Being an invalid URL.\n - Being disallowed by policy."]
    CEF_DOWNLOAD_INTERRUPT_REASON_NETWORK_INVALID_REQUEST = 24,
    #[doc = " The server indicates that the operation has failed (generic)."]
    CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_FAILED = 30,
    #[doc = " The server does not support range requests.\n Internal use only:  must restart from the beginning."]
    CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_NO_RANGE = 31,
    #[doc = " The server does not have the requested data."]
    CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_BAD_CONTENT = 33,
    #[doc = " Server didn't authorize access to resource."]
    CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_UNAUTHORIZED = 34,
    #[doc = " Server certificate problem."]
    CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_CERT_PROBLEM = 35,
    #[doc = " Server access forbidden."]
    CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_FORBIDDEN = 36,
    #[doc = " Unexpected server response. This might indicate that the responding server\n may not be the intended server."]
    CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_UNREACHABLE = 37,
    #[doc = " The server sent fewer bytes than the content-length header. It may\n indicate that the connection was closed prematurely, or the Content-Length\n header was invalid. The download is only interrupted if strong validators\n are present. Otherwise, it is treated as finished."]
    CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_CONTENT_LENGTH_MISMATCH = 38,
    #[doc = " An unexpected cross-origin redirect happened."]
    CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_CROSS_ORIGIN_REDIRECT = 39,
    #[doc = " The user canceled the download."]
    CEF_DOWNLOAD_INTERRUPT_REASON_USER_CANCELED = 40,
    #[doc = " The user shut down the browser.\n Internal use only:  resume pending downloads if possible."]
    CEF_DOWNLOAD_INTERRUPT_REASON_USER_SHUTDOWN = 41,
    #[doc = " The browser crashed.\n Internal use only:  resume pending downloads if possible."]
    CEF_DOWNLOAD_INTERRUPT_REASON_CRASH = 50,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Specifies the gesture commands.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_gesture_command_t {
    CEF_GESTURE_COMMAND_BACK = 0,
    CEF_GESTURE_COMMAND_FORWARD = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Specifies the zoom commands supported by CefBrowserHost::Zoom.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_zoom_command_t {
    CEF_ZOOM_COMMAND_OUT = 0,
    CEF_ZOOM_COMMAND_RESET = 1,
    CEF_ZOOM_COMMAND_IN = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Specifies the color variants supported by\n CefRequestContext::SetChromeThemeColor.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_color_variant_t {
    CEF_COLOR_VARIANT_SYSTEM = 0,
    CEF_COLOR_VARIANT_LIGHT = 1,
    CEF_COLOR_VARIANT_DARK = 2,
    CEF_COLOR_VARIANT_TONAL_SPOT = 3,
    CEF_COLOR_VARIANT_NEUTRAL = 4,
    CEF_COLOR_VARIANT_VIBRANT = 5,
    CEF_COLOR_VARIANT_EXPRESSIVE = 6,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "\n Specifies the task type variants supported by CefTaskManager.\n Should be kept in sync with Chromium's task_manager::Task::Type type.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum cef_task_type_t {
    CEF_TASK_TYPE_UNKNOWN = 0,
    #[doc = " The main browser process."]
    CEF_TASK_TYPE_BROWSER = 1,
    #[doc = " A graphics process."]
    CEF_TASK_TYPE_GPU = 2,
    #[doc = " A Linux zygote process."]
    CEF_TASK_TYPE_ZYGOTE = 3,
    #[doc = " A browser utility process."]
    CEF_TASK_TYPE_UTILITY = 4,
    #[doc = " A normal WebContents renderer process."]
    CEF_TASK_TYPE_RENDERER = 5,
    #[doc = " An extension or app process."]
    CEF_TASK_TYPE_EXTENSION = 6,
    #[doc = " A browser plugin guest process."]
    CEF_TASK_TYPE_GUEST = 7,
    #[doc = " A plugin process."]
    CEF_TASK_TYPE_PLUGIN = 8,
    #[doc = " A sandbox helper process"]
    CEF_TASK_TYPE_SANDBOX_HELPER = 9,
    #[doc = " A dedicated worker running on the renderer process."]
    CEF_TASK_TYPE_DEDICATED_WORKER = 10,
    #[doc = " A shared worker running on the renderer process."]
    CEF_TASK_TYPE_SHARED_WORKER = 11,
    #[doc = " A service worker running on the renderer process."]
    CEF_TASK_TYPE_SERVICE_WORKER = 12,
}
#[doc = "\n Structure representing task information provided by CefTaskManager.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_task_info_t {
    #[doc = " The task ID."]
    pub id: i64,
    #[doc = " The task type."]
    pub type_: cef_task_type_t,
    #[doc = " Set to true (1) if the task is killable."]
    pub is_killable: ::std::os::raw::c_int,
    #[doc = " The task title."]
    pub title: cef_string_t,
    #[doc = " The CPU usage of the process on which the task is running. The value is\n in the range zero to number_of_processors * 100%."]
    pub cpu_usage: f64,
    #[doc = " The number of processors available on the system."]
    pub number_of_processors: ::std::os::raw::c_int,
    #[doc = " The memory footprint of the task in bytes. A value of -1 means no valid\n value is currently available."]
    pub memory: i64,
    #[doc = " The GPU memory usage of the task in bytes. A value of -1 means no valid\n value is currently available."]
    pub gpu_memory: i64,
    #[doc = " Set to true (1) if this task process' GPU resource count is inflated\n because it is counting other processes' resources (e.g, the GPU process\n has this value set to true because it is the aggregate of all processes)."]
    pub is_gpu_memory_inflated: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_task_info_t"][::std::mem::size_of::<_cef_task_info_t>() - 80usize];
    ["Alignment of _cef_task_info_t"][::std::mem::align_of::<_cef_task_info_t>() - 8usize];
    ["Offset of field: _cef_task_info_t::id"]
        [::std::mem::offset_of!(_cef_task_info_t, id) - 0usize];
    ["Offset of field: _cef_task_info_t::type_"]
        [::std::mem::offset_of!(_cef_task_info_t, type_) - 8usize];
    ["Offset of field: _cef_task_info_t::is_killable"]
        [::std::mem::offset_of!(_cef_task_info_t, is_killable) - 12usize];
    ["Offset of field: _cef_task_info_t::title"]
        [::std::mem::offset_of!(_cef_task_info_t, title) - 16usize];
    ["Offset of field: _cef_task_info_t::cpu_usage"]
        [::std::mem::offset_of!(_cef_task_info_t, cpu_usage) - 40usize];
    ["Offset of field: _cef_task_info_t::number_of_processors"]
        [::std::mem::offset_of!(_cef_task_info_t, number_of_processors) - 48usize];
    ["Offset of field: _cef_task_info_t::memory"]
        [::std::mem::offset_of!(_cef_task_info_t, memory) - 56usize];
    ["Offset of field: _cef_task_info_t::gpu_memory"]
        [::std::mem::offset_of!(_cef_task_info_t, gpu_memory) - 64usize];
    ["Offset of field: _cef_task_info_t::is_gpu_memory_inflated"]
        [::std::mem::offset_of!(_cef_task_info_t, is_gpu_memory_inflated) - 72usize];
};
#[doc = "\n Structure representing task information provided by CefTaskManager.\n"]
pub type cef_task_info_t = _cef_task_info_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_base_ref_counted_t {
    pub size: usize,
    pub add_ref: ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_base_ref_counted_t)>,
    pub release: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_base_ref_counted_t) -> ::std::os::raw::c_int,
    >,
    pub has_one_ref: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_base_ref_counted_t) -> ::std::os::raw::c_int,
    >,
    pub has_at_least_one_ref: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_base_ref_counted_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_base_ref_counted_t"][::std::mem::size_of::<_cef_base_ref_counted_t>() - 40usize];
    ["Alignment of _cef_base_ref_counted_t"]
        [::std::mem::align_of::<_cef_base_ref_counted_t>() - 8usize];
    ["Offset of field: _cef_base_ref_counted_t::size"]
        [::std::mem::offset_of!(_cef_base_ref_counted_t, size) - 0usize];
    ["Offset of field: _cef_base_ref_counted_t::add_ref"]
        [::std::mem::offset_of!(_cef_base_ref_counted_t, add_ref) - 8usize];
    ["Offset of field: _cef_base_ref_counted_t::release"]
        [::std::mem::offset_of!(_cef_base_ref_counted_t, release) - 16usize];
    ["Offset of field: _cef_base_ref_counted_t::has_one_ref"]
        [::std::mem::offset_of!(_cef_base_ref_counted_t, has_one_ref) - 24usize];
    ["Offset of field: _cef_base_ref_counted_t::has_at_least_one_ref"]
        [::std::mem::offset_of!(_cef_base_ref_counted_t, has_at_least_one_ref) - 32usize];
};
pub type cef_base_ref_counted_t = _cef_base_ref_counted_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_base_scoped_t {
    pub size: usize,
    pub del: ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_base_scoped_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_base_scoped_t"][::std::mem::size_of::<_cef_base_scoped_t>() - 16usize];
    ["Alignment of _cef_base_scoped_t"][::std::mem::align_of::<_cef_base_scoped_t>() - 8usize];
    ["Offset of field: _cef_base_scoped_t::size"]
        [::std::mem::offset_of!(_cef_base_scoped_t, size) - 0usize];
    ["Offset of field: _cef_base_scoped_t::del"]
        [::std::mem::offset_of!(_cef_base_scoped_t, del) - 8usize];
};
pub type cef_base_scoped_t = _cef_base_scoped_t;
#[doc = "\n Callback structure for cef_browser_host_t::AddDevToolsMessageObserver. The\n functions of this structure will be called on the browser process UI thread.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_dev_tools_message_observer_t {
    #[doc = "\n Base structure.\n"]
    pub base: cef_base_ref_counted_t,
    #[doc = "\n Method that will be called on receipt of a DevTools protocol message.\n |browser| is the originating browser instance. |message| is a UTF8-encoded\n JSON dictionary representing either a function result or an event.\n |message| is only valid for the scope of this callback and should be\n copied if necessary. Return true (1) if the message was handled or false\n (0) if the message should be further processed and passed to the\n OnDevToolsMethodResult or OnDevToolsEvent functions as appropriate.\n\n Method result dictionaries include an \"id\" (int) value that identifies the\n orginating function call sent from\n cef_browser_host_t::SendDevToolsMessage, and optionally either a \"result\"\n (dictionary) or \"error\" (dictionary) value. The \"error\" dictionary will\n contain \"code\" (int) and \"message\" (string) values. Event dictionaries\n include a \"function\" (string) value and optionally a \"params\" (dictionary)\n value. See the DevTools protocol documentation at\n https://chromedevtools.github.io/devtools-protocol/ for details of\n supported function calls and the expected \"result\" or \"params\" dictionary\n contents. JSON dictionaries can be parsed using the CefParseJSON function\n if desired, however be aware of performance considerations when parsing\n large messages (some of which may exceed 1MB in size).\n"]
    pub on_dev_tools_message: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
            message: *const ::std::os::raw::c_void,
            message_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Method that will be called after attempted execution of a DevTools\n protocol function. |browser| is the originating browser instance.\n |message_id| is the \"id\" value that identifies the originating function\n call message. If the function succeeded |success| will be true (1) and\n |result| will be the UTF8-encoded JSON \"result\" dictionary value (which\n may be NULL). If the function failed |success| will be false (0) and\n |result| will be the UTF8-encoded JSON \"error\" dictionary value. |result|\n is only valid for the scope of this callback and should be copied if\n necessary. See the OnDevToolsMessage documentation for additional details\n on |result| contents.\n"]
    pub on_dev_tools_method_result: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
            message_id: ::std::os::raw::c_int,
            success: ::std::os::raw::c_int,
            result: *const ::std::os::raw::c_void,
            result_size: usize,
        ),
    >,
    #[doc = "\n Method that will be called on receipt of a DevTools protocol event.\n |browser| is the originating browser instance. |function| is the\n \"function\" value. |params| is the UTF8-encoded JSON \"params\" dictionary\n value (which may be NULL). |params| is only valid for the scope of this\n callback and should be copied if necessary. See the OnDevToolsMessage\n documentation for additional details on |params| contents.\n"]
    pub on_dev_tools_event: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
            method: *const cef_string_t,
            params: *const ::std::os::raw::c_void,
            params_size: usize,
        ),
    >,
    #[doc = "\n Method that will be called when the DevTools agent has attached. |browser|\n is the originating browser instance. This will generally occur in response\n to the first message sent while the agent is detached.\n"]
    pub on_dev_tools_agent_attached: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
        ),
    >,
    #[doc = "\n Method that will be called when the DevTools agent has detached. |browser|\n is the originating browser instance. Any function results that were\n pending before the agent became detached will not be delivered, and any\n active event subscriptions will be canceled.\n"]
    pub on_dev_tools_agent_detached: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_dev_tools_message_observer_t"]
        [::std::mem::size_of::<_cef_dev_tools_message_observer_t>() - 80usize];
    ["Alignment of _cef_dev_tools_message_observer_t"]
        [::std::mem::align_of::<_cef_dev_tools_message_observer_t>() - 8usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::base"]
        [::std::mem::offset_of!(_cef_dev_tools_message_observer_t, base) - 0usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::on_dev_tools_message"]
        [::std::mem::offset_of!(_cef_dev_tools_message_observer_t, on_dev_tools_message) - 40usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::on_dev_tools_method_result"][::std::mem::offset_of!(
        _cef_dev_tools_message_observer_t,
        on_dev_tools_method_result
    ) - 48usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::on_dev_tools_event"]
        [::std::mem::offset_of!(_cef_dev_tools_message_observer_t, on_dev_tools_event) - 56usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::on_dev_tools_agent_attached"][::std::mem::offset_of!(
        _cef_dev_tools_message_observer_t,
        on_dev_tools_agent_attached
    )
        - 64usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::on_dev_tools_agent_detached"][::std::mem::offset_of!(
        _cef_dev_tools_message_observer_t,
        on_dev_tools_agent_detached
    )
        - 72usize];
};
#[doc = "\n Callback structure for cef_browser_host_t::AddDevToolsMessageObserver. The\n functions of this structure will be called on the browser process UI thread.\n"]
pub type cef_dev_tools_message_observer_t = _cef_dev_tools_message_observer_t;
#[doc = "\n Structure that wraps other data value types. Complex types (binary,\n dictionary and list) will be referenced but not owned by this object. Can be\n used on any process and thread.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_value_t {
    #[doc = "\n Base structure.\n"]
    pub base: cef_base_ref_counted_t,
    #[doc = "\n Returns true (1) if the underlying data is valid. This will always be true\n (1) for simple types. For complex types (binary, dictionary and list) the\n underlying data may become invalid if owned by another object (e.g. list\n or dictionary) and that other object is then modified or destroyed. This\n value object can be re-used by calling Set*() even if the underlying data\n is invalid.\n"]
    pub is_valid: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if the underlying data is owned by another object.\n"]
    pub is_owned: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if the underlying data is read-only. Some APIs may expose\n read-only objects.\n"]
    pub is_read_only: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object and |that| object have the same underlying\n data. If true (1) modifications to this object will also affect |that|\n object and vice-versa.\n"]
    pub is_same: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_value_t,
            that: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object and |that| object have an equivalent\n underlying value but are not necessarily the same object.\n"]
    pub is_equal: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_value_t,
            that: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns a copy of this object. The underlying data will also be copied.\n"]
    pub copy:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_value_t) -> *mut _cef_value_t>,
    #[doc = "\n Returns the underlying value type.\n"]
    pub get_type:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_value_t) -> cef_value_type_t>,
    #[doc = "\n Returns the underlying value as type bool.\n"]
    pub get_bool: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the underlying value as type int.\n"]
    pub get_int: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the underlying value as type double.\n"]
    pub get_double: ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_value_t) -> f64>,
    #[doc = "\n Returns the underlying value as type string.\n"]
    pub get_string: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t) -> cef_string_userfree_t,
    >,
    #[doc = "\n Returns the underlying value as type binary. The returned reference may\n become invalid if the value is owned by another object or if ownership is\n transferred to another object in the future. To maintain a reference to\n the value after assigning ownership to a dictionary or list pass this\n object to the set_value() function instead of passing the returned\n reference to set_binary().\n"]
    pub get_binary: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t) -> *mut _cef_binary_value_t,
    >,
    #[doc = "\n Returns the underlying value as type dictionary. The returned reference\n may become invalid if the value is owned by another object or if ownership\n is transferred to another object in the future. To maintain a reference to\n the value after assigning ownership to a dictionary or list pass this\n object to the set_value() function instead of passing the returned\n reference to set_dictionary().\n"]
    pub get_dictionary: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t) -> *mut _cef_dictionary_value_t,
    >,
    #[doc = "\n Returns the underlying value as type list. The returned reference may\n become invalid if the value is owned by another object or if ownership is\n transferred to another object in the future. To maintain a reference to\n the value after assigning ownership to a dictionary or list pass this\n object to the set_value() function instead of passing the returned\n reference to set_list().\n"]
    pub get_list: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t) -> *mut _cef_list_value_t,
    >,
    #[doc = "\n Sets the underlying value as type null. Returns true (1) if the value was\n set successfully.\n"]
    pub set_null: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the underlying value as type bool. Returns true (1) if the value was\n set successfully.\n"]
    pub set_bool: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_value_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the underlying value as type int. Returns true (1) if the value was\n set successfully.\n"]
    pub set_int: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_value_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the underlying value as type double. Returns true (1) if the value\n was set successfully.\n"]
    pub set_double: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_value_t, value: f64) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the underlying value as type string. Returns true (1) if the value\n was set successfully.\n"]
    pub set_string: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_value_t,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the underlying value as type binary. Returns true (1) if the value\n was set successfully. This object keeps a reference to |value| and\n ownership of the underlying data remains unchanged.\n"]
    pub set_binary: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_value_t,
            value: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the underlying value as type dict. Returns true (1) if the value was\n set successfully. This object keeps a reference to |value| and ownership\n of the underlying data remains unchanged.\n"]
    pub set_dictionary: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_value_t,
            value: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the underlying value as type list. Returns true (1) if the value was\n set successfully. This object keeps a reference to |value| and ownership\n of the underlying data remains unchanged.\n"]
    pub set_list: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_value_t,
            value: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_value_t"][::std::mem::size_of::<_cef_value_t>() - 216usize];
    ["Alignment of _cef_value_t"][::std::mem::align_of::<_cef_value_t>() - 8usize];
    ["Offset of field: _cef_value_t::base"][::std::mem::offset_of!(_cef_value_t, base) - 0usize];
    ["Offset of field: _cef_value_t::is_valid"]
        [::std::mem::offset_of!(_cef_value_t, is_valid) - 40usize];
    ["Offset of field: _cef_value_t::is_owned"]
        [::std::mem::offset_of!(_cef_value_t, is_owned) - 48usize];
    ["Offset of field: _cef_value_t::is_read_only"]
        [::std::mem::offset_of!(_cef_value_t, is_read_only) - 56usize];
    ["Offset of field: _cef_value_t::is_same"]
        [::std::mem::offset_of!(_cef_value_t, is_same) - 64usize];
    ["Offset of field: _cef_value_t::is_equal"]
        [::std::mem::offset_of!(_cef_value_t, is_equal) - 72usize];
    ["Offset of field: _cef_value_t::copy"][::std::mem::offset_of!(_cef_value_t, copy) - 80usize];
    ["Offset of field: _cef_value_t::get_type"]
        [::std::mem::offset_of!(_cef_value_t, get_type) - 88usize];
    ["Offset of field: _cef_value_t::get_bool"]
        [::std::mem::offset_of!(_cef_value_t, get_bool) - 96usize];
    ["Offset of field: _cef_value_t::get_int"]
        [::std::mem::offset_of!(_cef_value_t, get_int) - 104usize];
    ["Offset of field: _cef_value_t::get_double"]
        [::std::mem::offset_of!(_cef_value_t, get_double) - 112usize];
    ["Offset of field: _cef_value_t::get_string"]
        [::std::mem::offset_of!(_cef_value_t, get_string) - 120usize];
    ["Offset of field: _cef_value_t::get_binary"]
        [::std::mem::offset_of!(_cef_value_t, get_binary) - 128usize];
    ["Offset of field: _cef_value_t::get_dictionary"]
        [::std::mem::offset_of!(_cef_value_t, get_dictionary) - 136usize];
    ["Offset of field: _cef_value_t::get_list"]
        [::std::mem::offset_of!(_cef_value_t, get_list) - 144usize];
    ["Offset of field: _cef_value_t::set_null"]
        [::std::mem::offset_of!(_cef_value_t, set_null) - 152usize];
    ["Offset of field: _cef_value_t::set_bool"]
        [::std::mem::offset_of!(_cef_value_t, set_bool) - 160usize];
    ["Offset of field: _cef_value_t::set_int"]
        [::std::mem::offset_of!(_cef_value_t, set_int) - 168usize];
    ["Offset of field: _cef_value_t::set_double"]
        [::std::mem::offset_of!(_cef_value_t, set_double) - 176usize];
    ["Offset of field: _cef_value_t::set_string"]
        [::std::mem::offset_of!(_cef_value_t, set_string) - 184usize];
    ["Offset of field: _cef_value_t::set_binary"]
        [::std::mem::offset_of!(_cef_value_t, set_binary) - 192usize];
    ["Offset of field: _cef_value_t::set_dictionary"]
        [::std::mem::offset_of!(_cef_value_t, set_dictionary) - 200usize];
    ["Offset of field: _cef_value_t::set_list"]
        [::std::mem::offset_of!(_cef_value_t, set_list) - 208usize];
};
#[doc = "\n Structure that wraps other data value types. Complex types (binary,\n dictionary and list) will be referenced but not owned by this object. Can be\n used on any process and thread.\n"]
pub type cef_value_t = _cef_value_t;
unsafe extern "C" {
    #[doc = "\n Creates a new object.\n"]
    pub fn cef_value_create() -> *mut cef_value_t;
}
#[doc = "\n Structure representing a binary value. Can be used on any process and\n thread.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_binary_value_t {
    #[doc = "\n Base structure.\n"]
    pub base: cef_base_ref_counted_t,
    #[doc = "\n Returns true (1) if this object is valid. This object may become invalid\n if the underlying data is owned by another object (e.g. list or\n dictionary) and that other object is then modified or destroyed. Do not\n call any other functions if this function returns false (0).\n"]
    pub is_valid: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_binary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object is currently owned by another object.\n"]
    pub is_owned: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_binary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object and |that| object have the same underlying\n data.\n"]
    pub is_same: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_binary_value_t,
            that: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object and |that| object have an equivalent\n underlying value but are not necessarily the same object.\n"]
    pub is_equal: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_binary_value_t,
            that: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns a copy of this object. The data in this object will also be\n copied.\n"]
    pub copy: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_binary_value_t) -> *mut _cef_binary_value_t,
    >,
    #[doc = "\n Returns a pointer to the beginning of the memory block. The returned\n pointer is valid as long as the cef_binary_value_t is alive.\n"]
    pub get_raw_data: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_binary_value_t) -> *const ::std::os::raw::c_void,
    >,
    #[doc = "\n Returns the data size.\n"]
    pub get_size:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_binary_value_t) -> usize>,
    #[doc = "\n Read up to |buffer_size| number of bytes into |buffer|. Reading begins at\n the specified byte |data_offset|. Returns the number of bytes read.\n"]
    pub get_data: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_binary_value_t,
            buffer: *mut ::std::os::raw::c_void,
            buffer_size: usize,
            data_offset: usize,
        ) -> usize,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_binary_value_t"][::std::mem::size_of::<_cef_binary_value_t>() - 104usize];
    ["Alignment of _cef_binary_value_t"][::std::mem::align_of::<_cef_binary_value_t>() - 8usize];
    ["Offset of field: _cef_binary_value_t::base"]
        [::std::mem::offset_of!(_cef_binary_value_t, base) - 0usize];
    ["Offset of field: _cef_binary_value_t::is_valid"]
        [::std::mem::offset_of!(_cef_binary_value_t, is_valid) - 40usize];
    ["Offset of field: _cef_binary_value_t::is_owned"]
        [::std::mem::offset_of!(_cef_binary_value_t, is_owned) - 48usize];
    ["Offset of field: _cef_binary_value_t::is_same"]
        [::std::mem::offset_of!(_cef_binary_value_t, is_same) - 56usize];
    ["Offset of field: _cef_binary_value_t::is_equal"]
        [::std::mem::offset_of!(_cef_binary_value_t, is_equal) - 64usize];
    ["Offset of field: _cef_binary_value_t::copy"]
        [::std::mem::offset_of!(_cef_binary_value_t, copy) - 72usize];
    ["Offset of field: _cef_binary_value_t::get_raw_data"]
        [::std::mem::offset_of!(_cef_binary_value_t, get_raw_data) - 80usize];
    ["Offset of field: _cef_binary_value_t::get_size"]
        [::std::mem::offset_of!(_cef_binary_value_t, get_size) - 88usize];
    ["Offset of field: _cef_binary_value_t::get_data"]
        [::std::mem::offset_of!(_cef_binary_value_t, get_data) - 96usize];
};
#[doc = "\n Structure representing a binary value. Can be used on any process and\n thread.\n"]
pub type cef_binary_value_t = _cef_binary_value_t;
unsafe extern "C" {
    #[doc = "\n Creates a new object that is not owned by any other object. The specified\n |data| will be copied.\n"]
    pub fn cef_binary_value_create(
        data: *const ::std::os::raw::c_void,
        data_size: usize,
    ) -> *mut cef_binary_value_t;
}
#[doc = "\n Structure representing a dictionary value. Can be used on any process and\n thread.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_dictionary_value_t {
    #[doc = "\n Base structure.\n"]
    pub base: cef_base_ref_counted_t,
    #[doc = "\n Returns true (1) if this object is valid. This object may become invalid\n if the underlying data is owned by another object (e.g. list or\n dictionary) and that other object is then modified or destroyed. Do not\n call any other functions if this function returns false (0).\n"]
    pub is_valid: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object is currently owned by another object.\n"]
    pub is_owned: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if the values of this object are read-only. Some APIs may\n expose read-only objects.\n"]
    pub is_read_only: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object and |that| object have the same underlying\n data. If true (1) modifications to this object will also affect |that|\n object and vice-versa.\n"]
    pub is_same: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            that: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object and |that| object have an equivalent\n underlying value but are not necessarily the same object.\n"]
    pub is_equal: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            that: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns a writable copy of this object. If |exclude_NULL_children| is true\n (1) any NULL dictionaries or lists will be excluded from the copy.\n"]
    pub copy: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            exclude_empty_children: ::std::os::raw::c_int,
        ) -> *mut _cef_dictionary_value_t,
    >,
    #[doc = "\n Returns the number of values.\n"]
    pub get_size:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_dictionary_value_t) -> usize>,
    #[doc = "\n Removes all values. Returns true (1) on success.\n"]
    pub clear: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if the current dictionary has a value for the given key.\n"]
    pub has_key: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Reads all keys for this dictionary into the specified vector.\n"]
    pub get_keys: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            keys: cef_string_list_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Removes the value at the specified key. Returns true (1) is the value was\n removed successfully.\n"]
    pub remove: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the value type for the specified key.\n"]
    pub get_type: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> cef_value_type_t,
    >,
    #[doc = "\n Returns the value at the specified key. For simple types the returned\n value will copy existing data and modifications to the value will not\n modify this object. For complex types (binary, dictionary and list) the\n returned value will reference existing data and modifications to the value\n will modify this object.\n"]
    pub get_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_value_t,
    >,
    #[doc = "\n Returns the value at the specified key as type bool.\n"]
    pub get_bool: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the value at the specified key as type int.\n"]
    pub get_int: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the value at the specified key as type double.\n"]
    pub get_double: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_dictionary_value_t, key: *const cef_string_t) -> f64,
    >,
    #[doc = "\n Returns the value at the specified key as type string.\n"]
    pub get_string: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> cef_string_userfree_t,
    >,
    #[doc = "\n Returns the value at the specified key as type binary. The returned value\n will reference existing data.\n"]
    pub get_binary: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_binary_value_t,
    >,
    #[doc = "\n Returns the value at the specified key as type dictionary. The returned\n value will reference existing data and modifications to the value will\n modify this object.\n"]
    pub get_dictionary: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_dictionary_value_t,
    >,
    #[doc = "\n Returns the value at the specified key as type list. The returned value\n will reference existing data and modifications to the value will modify\n this object.\n"]
    pub get_list: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_list_value_t,
    >,
    #[doc = "\n Sets the value at the specified key. Returns true (1) if the value was set\n successfully. If |value| represents simple data then the underlying data\n will be copied and modifications to |value| will not modify this object.\n If |value| represents complex data (binary, dictionary or list) then the\n underlying data will be referenced and modifications to |value| will\n modify this object.\n"]
    pub set_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified key as type null. Returns true (1) if the\n value was set successfully.\n"]
    pub set_null: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified key as type bool. Returns true (1) if the\n value was set successfully.\n"]
    pub set_bool: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified key as type int. Returns true (1) if the\n value was set successfully.\n"]
    pub set_int: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified key as type double. Returns true (1) if\n the value was set successfully.\n"]
    pub set_double: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: f64,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified key as type string. Returns true (1) if\n the value was set successfully.\n"]
    pub set_string: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified key as type binary. Returns true (1) if\n the value was set successfully. If |value| is currently owned by another\n object then the value will be copied and the |value| reference will not\n change. Otherwise, ownership will be transferred to this object and the\n |value| reference will be invalidated.\n"]
    pub set_binary: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified key as type dict. Returns true (1) if the\n value was set successfully. If |value| is currently owned by another\n object then the value will be copied and the |value| reference will not\n change. Otherwise, ownership will be transferred to this object and the\n |value| reference will be invalidated.\n"]
    pub set_dictionary: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified key as type list. Returns true (1) if the\n value was set successfully. If |value| is currently owned by another\n object then the value will be copied and the |value| reference will not\n change. Otherwise, ownership will be transferred to this object and the\n |value| reference will be invalidated.\n"]
    pub set_list: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_dictionary_value_t"]
        [::std::mem::size_of::<_cef_dictionary_value_t>() - 272usize];
    ["Alignment of _cef_dictionary_value_t"]
        [::std::mem::align_of::<_cef_dictionary_value_t>() - 8usize];
    ["Offset of field: _cef_dictionary_value_t::base"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, base) - 0usize];
    ["Offset of field: _cef_dictionary_value_t::is_valid"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, is_valid) - 40usize];
    ["Offset of field: _cef_dictionary_value_t::is_owned"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, is_owned) - 48usize];
    ["Offset of field: _cef_dictionary_value_t::is_read_only"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, is_read_only) - 56usize];
    ["Offset of field: _cef_dictionary_value_t::is_same"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, is_same) - 64usize];
    ["Offset of field: _cef_dictionary_value_t::is_equal"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, is_equal) - 72usize];
    ["Offset of field: _cef_dictionary_value_t::copy"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, copy) - 80usize];
    ["Offset of field: _cef_dictionary_value_t::get_size"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_size) - 88usize];
    ["Offset of field: _cef_dictionary_value_t::clear"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, clear) - 96usize];
    ["Offset of field: _cef_dictionary_value_t::has_key"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, has_key) - 104usize];
    ["Offset of field: _cef_dictionary_value_t::get_keys"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_keys) - 112usize];
    ["Offset of field: _cef_dictionary_value_t::remove"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, remove) - 120usize];
    ["Offset of field: _cef_dictionary_value_t::get_type"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_type) - 128usize];
    ["Offset of field: _cef_dictionary_value_t::get_value"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_value) - 136usize];
    ["Offset of field: _cef_dictionary_value_t::get_bool"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_bool) - 144usize];
    ["Offset of field: _cef_dictionary_value_t::get_int"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_int) - 152usize];
    ["Offset of field: _cef_dictionary_value_t::get_double"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_double) - 160usize];
    ["Offset of field: _cef_dictionary_value_t::get_string"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_string) - 168usize];
    ["Offset of field: _cef_dictionary_value_t::get_binary"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_binary) - 176usize];
    ["Offset of field: _cef_dictionary_value_t::get_dictionary"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_dictionary) - 184usize];
    ["Offset of field: _cef_dictionary_value_t::get_list"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_list) - 192usize];
    ["Offset of field: _cef_dictionary_value_t::set_value"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_value) - 200usize];
    ["Offset of field: _cef_dictionary_value_t::set_null"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_null) - 208usize];
    ["Offset of field: _cef_dictionary_value_t::set_bool"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_bool) - 216usize];
    ["Offset of field: _cef_dictionary_value_t::set_int"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_int) - 224usize];
    ["Offset of field: _cef_dictionary_value_t::set_double"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_double) - 232usize];
    ["Offset of field: _cef_dictionary_value_t::set_string"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_string) - 240usize];
    ["Offset of field: _cef_dictionary_value_t::set_binary"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_binary) - 248usize];
    ["Offset of field: _cef_dictionary_value_t::set_dictionary"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_dictionary) - 256usize];
    ["Offset of field: _cef_dictionary_value_t::set_list"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_list) - 264usize];
};
#[doc = "\n Structure representing a dictionary value. Can be used on any process and\n thread.\n"]
pub type cef_dictionary_value_t = _cef_dictionary_value_t;
unsafe extern "C" {
    #[doc = "\n Creates a new object that is not owned by any other object.\n"]
    pub fn cef_dictionary_value_create() -> *mut cef_dictionary_value_t;
}
#[doc = "\n Structure representing a list value. Can be used on any process and thread.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_list_value_t {
    #[doc = "\n Base structure.\n"]
    pub base: cef_base_ref_counted_t,
    #[doc = "\n Returns true (1) if this object is valid. This object may become invalid\n if the underlying data is owned by another object (e.g. list or\n dictionary) and that other object is then modified or destroyed. Do not\n call any other functions if this function returns false (0).\n"]
    pub is_valid: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object is currently owned by another object.\n"]
    pub is_owned: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if the values of this object are read-only. Some APIs may\n expose read-only objects.\n"]
    pub is_read_only: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object and |that| object have the same underlying\n data. If true (1) modifications to this object will also affect |that|\n object and vice-versa.\n"]
    pub is_same: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            that: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this object and |that| object have an equivalent\n underlying value but are not necessarily the same object.\n"]
    pub is_equal: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            that: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns a writable copy of this object.\n"]
    pub copy: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t) -> *mut _cef_list_value_t,
    >,
    #[doc = "\n Sets the number of values. If the number of values is expanded all new\n value slots will default to type null. Returns true (1) on success.\n"]
    pub set_size: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t, size: usize) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the number of values.\n"]
    pub get_size:
        ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_list_value_t) -> usize>,
    #[doc = "\n Removes all values. Returns true (1) on success.\n"]
    pub clear: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Removes the value at the specified index.\n"]
    pub remove: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t, index: usize) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the value type at the specified index.\n"]
    pub get_type: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t, index: usize) -> cef_value_type_t,
    >,
    #[doc = "\n Returns the value at the specified index. For simple types the returned\n value will copy existing data and modifications to the value will not\n modify this object. For complex types (binary, dictionary and list) the\n returned value will reference existing data and modifications to the value\n will modify this object.\n"]
    pub get_value: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t, index: usize) -> *mut _cef_value_t,
    >,
    #[doc = "\n Returns the value at the specified index as type bool.\n"]
    pub get_bool: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t, index: usize) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the value at the specified index as type int.\n"]
    pub get_int: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t, index: usize) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the value at the specified index as type double.\n"]
    pub get_double: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t, index: usize) -> f64,
    >,
    #[doc = "\n Returns the value at the specified index as type string.\n"]
    pub get_string: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t, index: usize) -> cef_string_userfree_t,
    >,
    #[doc = "\n Returns the value at the specified index as type binary. The returned\n value will reference existing data.\n"]
    pub get_binary: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> *mut _cef_binary_value_t,
    >,
    #[doc = "\n Returns the value at the specified index as type dictionary. The returned\n value will reference existing data and modifications to the value will\n modify this object.\n"]
    pub get_dictionary: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> *mut _cef_dictionary_value_t,
    >,
    #[doc = "\n Returns the value at the specified index as type list. The returned value\n will reference existing data and modifications to the value will modify\n this object.\n"]
    pub get_list: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t, index: usize) -> *mut _cef_list_value_t,
    >,
    #[doc = "\n Sets the value at the specified index. Returns true (1) if the value was\n set successfully. If |value| represents simple data then the underlying\n data will be copied and modifications to |value| will not modify this\n object. If |value| represents complex data (binary, dictionary or list)\n then the underlying data will be referenced and modifications to |value|\n will modify this object.\n"]
    pub set_value: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified index as type null. Returns true (1) if\n the value was set successfully.\n"]
    pub set_null: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_list_value_t, index: usize) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified index as type bool. Returns true (1) if\n the value was set successfully.\n"]
    pub set_bool: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified index as type int. Returns true (1) if the\n value was set successfully.\n"]
    pub set_int: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified index as type double. Returns true (1) if\n the value was set successfully.\n"]
    pub set_double: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: f64,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified index as type string. Returns true (1) if\n the value was set successfully.\n"]
    pub set_string: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified index as type binary. Returns true (1) if\n the value was set successfully. If |value| is currently owned by another\n object then the value will be copied and the |value| reference will not\n change. Otherwise, ownership will be transferred to this object and the\n |value| reference will be invalidated.\n"]
    pub set_binary: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified index as type dict. Returns true (1) if\n the value was set successfully. If |value| is currently owned by another\n object then the value will be copied and the |value| reference will not\n change. Otherwise, ownership will be transferred to this object and the\n |value| reference will be invalidated.\n"]
    pub set_dictionary: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Sets the value at the specified index as type list. Returns true (1) if\n the value was set successfully. If |value| is currently owned by another\n object then the value will be copied and the |value| reference will not\n change. Otherwise, ownership will be transferred to this object and the\n |value| reference will be invalidated.\n"]
    pub set_list: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_list_value_t"][::std::mem::size_of::<_cef_list_value_t>() - 264usize];
    ["Alignment of _cef_list_value_t"][::std::mem::align_of::<_cef_list_value_t>() - 8usize];
    ["Offset of field: _cef_list_value_t::base"]
        [::std::mem::offset_of!(_cef_list_value_t, base) - 0usize];
    ["Offset of field: _cef_list_value_t::is_valid"]
        [::std::mem::offset_of!(_cef_list_value_t, is_valid) - 40usize];
    ["Offset of field: _cef_list_value_t::is_owned"]
        [::std::mem::offset_of!(_cef_list_value_t, is_owned) - 48usize];
    ["Offset of field: _cef_list_value_t::is_read_only"]
        [::std::mem::offset_of!(_cef_list_value_t, is_read_only) - 56usize];
    ["Offset of field: _cef_list_value_t::is_same"]
        [::std::mem::offset_of!(_cef_list_value_t, is_same) - 64usize];
    ["Offset of field: _cef_list_value_t::is_equal"]
        [::std::mem::offset_of!(_cef_list_value_t, is_equal) - 72usize];
    ["Offset of field: _cef_list_value_t::copy"]
        [::std::mem::offset_of!(_cef_list_value_t, copy) - 80usize];
    ["Offset of field: _cef_list_value_t::set_size"]
        [::std::mem::offset_of!(_cef_list_value_t, set_size) - 88usize];
    ["Offset of field: _cef_list_value_t::get_size"]
        [::std::mem::offset_of!(_cef_list_value_t, get_size) - 96usize];
    ["Offset of field: _cef_list_value_t::clear"]
        [::std::mem::offset_of!(_cef_list_value_t, clear) - 104usize];
    ["Offset of field: _cef_list_value_t::remove"]
        [::std::mem::offset_of!(_cef_list_value_t, remove) - 112usize];
    ["Offset of field: _cef_list_value_t::get_type"]
        [::std::mem::offset_of!(_cef_list_value_t, get_type) - 120usize];
    ["Offset of field: _cef_list_value_t::get_value"]
        [::std::mem::offset_of!(_cef_list_value_t, get_value) - 128usize];
    ["Offset of field: _cef_list_value_t::get_bool"]
        [::std::mem::offset_of!(_cef_list_value_t, get_bool) - 136usize];
    ["Offset of field: _cef_list_value_t::get_int"]
        [::std::mem::offset_of!(_cef_list_value_t, get_int) - 144usize];
    ["Offset of field: _cef_list_value_t::get_double"]
        [::std::mem::offset_of!(_cef_list_value_t, get_double) - 152usize];
    ["Offset of field: _cef_list_value_t::get_string"]
        [::std::mem::offset_of!(_cef_list_value_t, get_string) - 160usize];
    ["Offset of field: _cef_list_value_t::get_binary"]
        [::std::mem::offset_of!(_cef_list_value_t, get_binary) - 168usize];
    ["Offset of field: _cef_list_value_t::get_dictionary"]
        [::std::mem::offset_of!(_cef_list_value_t, get_dictionary) - 176usize];
    ["Offset of field: _cef_list_value_t::get_list"]
        [::std::mem::offset_of!(_cef_list_value_t, get_list) - 184usize];
    ["Offset of field: _cef_list_value_t::set_value"]
        [::std::mem::offset_of!(_cef_list_value_t, set_value) - 192usize];
    ["Offset of field: _cef_list_value_t::set_null"]
        [::std::mem::offset_of!(_cef_list_value_t, set_null) - 200usize];
    ["Offset of field: _cef_list_value_t::set_bool"]
        [::std::mem::offset_of!(_cef_list_value_t, set_bool) - 208usize];
    ["Offset of field: _cef_list_value_t::set_int"]
        [::std::mem::offset_of!(_cef_list_value_t, set_int) - 216usize];
    ["Offset of field: _cef_list_value_t::set_double"]
        [::std::mem::offset_of!(_cef_list_value_t, set_double) - 224usize];
    ["Offset of field: _cef_list_value_t::set_string"]
        [::std::mem::offset_of!(_cef_list_value_t, set_string) - 232usize];
    ["Offset of field: _cef_list_value_t::set_binary"]
        [::std::mem::offset_of!(_cef_list_value_t, set_binary) - 240usize];
    ["Offset of field: _cef_list_value_t::set_dictionary"]
        [::std::mem::offset_of!(_cef_list_value_t, set_dictionary) - 248usize];
    ["Offset of field: _cef_list_value_t::set_list"]
        [::std::mem::offset_of!(_cef_list_value_t, set_list) - 256usize];
};
#[doc = "\n Structure representing a list value. Can be used on any process and thread.\n"]
pub type cef_list_value_t = _cef_list_value_t;
unsafe extern "C" {
    #[doc = "\n Creates a new object that is not owned by any other object.\n"]
    pub fn cef_list_value_create() -> *mut cef_list_value_t;
}
#[doc = "\n Container for a single image represented at different scale factors. All\n image representations should be the same size in density independent pixel\n (DIP) units. For example, if the image at scale factor 1.0 is 100x100 pixels\n then the image at scale factor 2.0 should be 200x200 pixels -- both images\n will display with a DIP size of 100x100 units. The functions of this\n structure can be called on any browser process thread.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_image_t {
    #[doc = "\n Base structure.\n"]
    pub base: cef_base_ref_counted_t,
    #[doc = "\n Returns true (1) if this Image is NULL.\n"]
    pub is_empty: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_image_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this Image and |that| Image share the same underlying\n storage. Will also return true (1) if both images are NULL.\n"]
    pub is_same: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_image_t,
            that: *mut _cef_image_t,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Add a bitmap image representation for |scale_factor|. Only 32-bit\n RGBA/BGRA formats are supported. |pixel_width| and |pixel_height| are the\n bitmap representation size in pixel coordinates. |pixel_data| is the array\n of pixel data and should be |pixel_width| x |pixel_height| x 4 bytes in\n size. |color_type| and |alpha_type| values specify the pixel format.\n"]
    pub add_bitmap: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            pixel_width: ::std::os::raw::c_int,
            pixel_height: ::std::os::raw::c_int,
            color_type: cef_color_type_t,
            alpha_type: cef_alpha_type_t,
            pixel_data: *const ::std::os::raw::c_void,
            pixel_data_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Add a PNG image representation for |scale_factor|. |png_data| is the image\n data of size |png_data_size|. Any alpha transparency in the PNG data will\n be maintained.\n"]
    pub add_png: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            png_data: *const ::std::os::raw::c_void,
            png_data_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Create a JPEG image representation for |scale_factor|. |jpeg_data| is the\n image data of size |jpeg_data_size|. The JPEG format does not support\n transparency so the alpha byte will be set to 0xFF for all pixels.\n"]
    pub add_jpeg: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            jpeg_data: *const ::std::os::raw::c_void,
            jpeg_data_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the image width in density independent pixel (DIP) units.\n"]
    pub get_width: ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_image_t) -> usize>,
    #[doc = "\n Returns the image height in density independent pixel (DIP) units.\n"]
    pub get_height: ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_image_t) -> usize>,
    #[doc = "\n Returns true (1) if this image contains a representation for\n |scale_factor|.\n"]
    pub has_representation: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_image_t, scale_factor: f32) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Removes the representation for |scale_factor|. Returns true (1) on\n success.\n"]
    pub remove_representation: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_image_t, scale_factor: f32) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns information for the representation that most closely matches\n |scale_factor|. |actual_scale_factor| is the actual scale factor for the\n representation. |pixel_width| and |pixel_height| are the representation\n size in pixel coordinates. Returns true (1) on success.\n"]
    pub get_representation_info: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            actual_scale_factor: *mut f32,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns the bitmap representation that most closely matches\n |scale_factor|. Only 32-bit RGBA/BGRA formats are supported. |color_type|\n and |alpha_type| values specify the desired output pixel format.\n |pixel_width| and |pixel_height| are the output representation size in\n pixel coordinates. Returns a cef_binary_value_t containing the pixel data\n on success or NULL on failure.\n"]
    pub get_as_bitmap: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            color_type: cef_color_type_t,
            alpha_type: cef_alpha_type_t,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> *mut _cef_binary_value_t,
    >,
    #[doc = "\n Returns the PNG representation that most closely matches |scale_factor|.\n If |with_transparency| is true (1) any alpha transparency in the image\n will be represented in the resulting PNG data. |pixel_width| and\n |pixel_height| are the output representation size in pixel coordinates.\n Returns a cef_binary_value_t containing the PNG image data on success or\n NULL on failure.\n"]
    pub get_as_png: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            with_transparency: ::std::os::raw::c_int,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> *mut _cef_binary_value_t,
    >,
    #[doc = "\n Returns the JPEG representation that most closely matches |scale_factor|.\n |quality| determines the compression level with 0 == lowest and 100 ==\n highest. The JPEG format does not support alpha transparency and the alpha\n channel, if any, will be discarded. |pixel_width| and |pixel_height| are\n the output representation size in pixel coordinates. Returns a\n cef_binary_value_t containing the JPEG image data on success or NULL on\n failure.\n"]
    pub get_as_jpeg: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            quality: ::std::os::raw::c_int,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> *mut _cef_binary_value_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_image_t"][::std::mem::size_of::<_cef_image_t>() - 144usize];
    ["Alignment of _cef_image_t"][::std::mem::align_of::<_cef_image_t>() - 8usize];
    ["Offset of field: _cef_image_t::base"][::std::mem::offset_of!(_cef_image_t, base) - 0usize];
    ["Offset of field: _cef_image_t::is_empty"]
        [::std::mem::offset_of!(_cef_image_t, is_empty) - 40usize];
    ["Offset of field: _cef_image_t::is_same"]
        [::std::mem::offset_of!(_cef_image_t, is_same) - 48usize];
    ["Offset of field: _cef_image_t::add_bitmap"]
        [::std::mem::offset_of!(_cef_image_t, add_bitmap) - 56usize];
    ["Offset of field: _cef_image_t::add_png"]
        [::std::mem::offset_of!(_cef_image_t, add_png) - 64usize];
    ["Offset of field: _cef_image_t::add_jpeg"]
        [::std::mem::offset_of!(_cef_image_t, add_jpeg) - 72usize];
    ["Offset of field: _cef_image_t::get_width"]
        [::std::mem::offset_of!(_cef_image_t, get_width) - 80usize];
    ["Offset of field: _cef_image_t::get_height"]
        [::std::mem::offset_of!(_cef_image_t, get_height) - 88usize];
    ["Offset of field: _cef_image_t::has_representation"]
        [::std::mem::offset_of!(_cef_image_t, has_representation) - 96usize];
    ["Offset of field: _cef_image_t::remove_representation"]
        [::std::mem::offset_of!(_cef_image_t, remove_representation) - 104usize];
    ["Offset of field: _cef_image_t::get_representation_info"]
        [::std::mem::offset_of!(_cef_image_t, get_representation_info) - 112usize];
    ["Offset of field: _cef_image_t::get_as_bitmap"]
        [::std::mem::offset_of!(_cef_image_t, get_as_bitmap) - 120usize];
    ["Offset of field: _cef_image_t::get_as_png"]
        [::std::mem::offset_of!(_cef_image_t, get_as_png) - 128usize];
    ["Offset of field: _cef_image_t::get_as_jpeg"]
        [::std::mem::offset_of!(_cef_image_t, get_as_jpeg) - 136usize];
};
#[doc = "\n Container for a single image represented at different scale factors. All\n image representations should be the same size in density independent pixel\n (DIP) units. For example, if the image at scale factor 1.0 is 100x100 pixels\n then the image at scale factor 2.0 should be 200x200 pixels -- both images\n will display with a DIP size of 100x100 units. The functions of this\n structure can be called on any browser process thread.\n"]
pub type cef_image_t = _cef_image_t;
unsafe extern "C" {
    #[doc = "\n Create a new cef_image_t. It will initially be NULL. Use the Add*()\n functions to add representations at different scale factors.\n"]
    pub fn cef_image_create() -> *mut cef_image_t;
}
#[doc = "\n Structure the client can implement to provide a custom stream reader. The\n functions of this structure may be called on any thread.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_read_handler_t {
    #[doc = "\n Base structure.\n"]
    pub base: cef_base_ref_counted_t,
    #[doc = "\n Read raw binary data.\n"]
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_read_handler_t,
            ptr: *mut ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    #[doc = "\n Seek to the specified offset position. |whence| may be any one of\n SEEK_CUR, SEEK_END or SEEK_SET. Return zero on success and non-zero on\n failure.\n"]
    pub seek: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_read_handler_t,
            offset: i64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Return the current offset position.\n"]
    pub tell: ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_read_handler_t) -> i64>,
    #[doc = "\n Return non-zero if at end of file.\n"]
    pub eof: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_read_handler_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Return true (1) if this handler performs work like accessing the file\n system which may block. Used as a hint for determining the thread to\n access the handler from.\n"]
    pub may_block: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_read_handler_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_read_handler_t"][::std::mem::size_of::<_cef_read_handler_t>() - 80usize];
    ["Alignment of _cef_read_handler_t"][::std::mem::align_of::<_cef_read_handler_t>() - 8usize];
    ["Offset of field: _cef_read_handler_t::base"]
        [::std::mem::offset_of!(_cef_read_handler_t, base) - 0usize];
    ["Offset of field: _cef_read_handler_t::read"]
        [::std::mem::offset_of!(_cef_read_handler_t, read) - 40usize];
    ["Offset of field: _cef_read_handler_t::seek"]
        [::std::mem::offset_of!(_cef_read_handler_t, seek) - 48usize];
    ["Offset of field: _cef_read_handler_t::tell"]
        [::std::mem::offset_of!(_cef_read_handler_t, tell) - 56usize];
    ["Offset of field: _cef_read_handler_t::eof"]
        [::std::mem::offset_of!(_cef_read_handler_t, eof) - 64usize];
    ["Offset of field: _cef_read_handler_t::may_block"]
        [::std::mem::offset_of!(_cef_read_handler_t, may_block) - 72usize];
};
#[doc = "\n Structure the client can implement to provide a custom stream reader. The\n functions of this structure may be called on any thread.\n"]
pub type cef_read_handler_t = _cef_read_handler_t;
#[doc = "\n Structure used to read data from a stream. The functions of this structure\n may be called on any thread.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_stream_reader_t {
    #[doc = "\n Base structure.\n"]
    pub base: cef_base_ref_counted_t,
    #[doc = "\n Read raw binary data.\n"]
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_stream_reader_t,
            ptr: *mut ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    #[doc = "\n Seek to the specified offset position. |whence| may be any one of\n SEEK_CUR, SEEK_END or SEEK_SET. Returns zero on success and non-zero on\n failure.\n"]
    pub seek: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_stream_reader_t,
            offset: i64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Return the current offset position.\n"]
    pub tell: ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_stream_reader_t) -> i64>,
    #[doc = "\n Return non-zero if at end of file.\n"]
    pub eof: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_stream_reader_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Returns true (1) if this reader performs work like accessing the file\n system which may block. Used as a hint for determining the thread to\n access the reader from.\n"]
    pub may_block: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_stream_reader_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_stream_reader_t"][::std::mem::size_of::<_cef_stream_reader_t>() - 80usize];
    ["Alignment of _cef_stream_reader_t"][::std::mem::align_of::<_cef_stream_reader_t>() - 8usize];
    ["Offset of field: _cef_stream_reader_t::base"]
        [::std::mem::offset_of!(_cef_stream_reader_t, base) - 0usize];
    ["Offset of field: _cef_stream_reader_t::read"]
        [::std::mem::offset_of!(_cef_stream_reader_t, read) - 40usize];
    ["Offset of field: _cef_stream_reader_t::seek"]
        [::std::mem::offset_of!(_cef_stream_reader_t, seek) - 48usize];
    ["Offset of field: _cef_stream_reader_t::tell"]
        [::std::mem::offset_of!(_cef_stream_reader_t, tell) - 56usize];
    ["Offset of field: _cef_stream_reader_t::eof"]
        [::std::mem::offset_of!(_cef_stream_reader_t, eof) - 64usize];
    ["Offset of field: _cef_stream_reader_t::may_block"]
        [::std::mem::offset_of!(_cef_stream_reader_t, may_block) - 72usize];
};
#[doc = "\n Structure used to read data from a stream. The functions of this structure\n may be called on any thread.\n"]
pub type cef_stream_reader_t = _cef_stream_reader_t;
unsafe extern "C" {
    #[doc = "\n Create a new cef_stream_reader_t object from a file.\n"]
    pub fn cef_stream_reader_create_for_file(
        fileName: *const cef_string_t,
    ) -> *mut cef_stream_reader_t;
}
unsafe extern "C" {
    #[doc = "\n Create a new cef_stream_reader_t object from data.\n"]
    pub fn cef_stream_reader_create_for_data(
        data: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> *mut cef_stream_reader_t;
}
unsafe extern "C" {
    #[doc = "\n Create a new cef_stream_reader_t object from a custom handler.\n"]
    pub fn cef_stream_reader_create_for_handler(
        handler: *mut cef_read_handler_t,
    ) -> *mut cef_stream_reader_t;
}
#[doc = "\n Structure the client can implement to provide a custom stream writer. The\n functions of this structure may be called on any thread.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_write_handler_t {
    #[doc = "\n Base structure.\n"]
    pub base: cef_base_ref_counted_t,
    #[doc = "\n Write raw binary data.\n"]
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_write_handler_t,
            ptr: *const ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    #[doc = "\n Seek to the specified offset position. |whence| may be any one of\n SEEK_CUR, SEEK_END or SEEK_SET. Return zero on success and non-zero on\n failure.\n"]
    pub seek: ::std::option::Option<
        unsafe extern "C" fn(
            self_: *mut _cef_write_handler_t,
            offset: i64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Return the current offset position.\n"]
    pub tell: ::std::option::Option<unsafe extern "C" fn(self_: *mut _cef_write_handler_t) -> i64>,
    #[doc = "\n Flush the stream.\n"]
    pub flush: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_write_handler_t) -> ::std::os::raw::c_int,
    >,
    #[doc = "\n Return true (1) if this handler performs work like accessing the file\n system which may block. Used as a hint for determining the thread to\n access the handler from.\n"]
    pub may_block: ::std::option::Option<
        unsafe extern "C" fn(self_: *mut _cef_write_handler_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_write_handler_t"][::std::mem::size_of::<_cef_write_handler_t>() - 80usize];
    ["Alignment of _cef_write_handler_t"][::std::mem::align_of::<_cef_write_handler_t>() - 8usize];
    ["Offset of field: _cef_write_handler_t::base"]
